{
  "youtube": {
    "vehicle": "Hyundai Venue",
    "videos": [
      {
        "videoId": "f-WKsk0-ixw",
        "title": "Hyundai Venue : World Class Compact SUV : PowerDrift",
        "description": "The Hyundai Venue is the new talk of the town. That's because it is Hyundai India's first crack at the teeming compact SUV market. A truly global product, the Venue will go up against established players like the Maruti Brezza,  the Mahindra XUV300 and the Ford EcoSport. Starting at INR 6.5 lakhs (ex-showroom), it is also priced very competitively. Rohan travels to a special  venue to find what's what.\n\n#PowerDrift  \nJoin the 1.6 Million strong #PDArmy : http://bit.ly/PDARMY\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nTee Shirts, Badges & More official merchandise : http://www.powerdrift.com/merchandise\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/PD_Official",
        "channelTitle": "PowerDrift",
        "publishedAt": "2019-06-06T03:30:00Z",
        "viewCount": "742425",
        "transcript": "and I step forward is agar which is a sign of things to come a car which is more than a car because it's a venue a place now if this is a venue then it needs to be a place to be that needs to be for every occasion so here we are in the morning the car and I wear the car grace is the morning occasion with its fine lines looking and sitting very pretty outside my imaginary house a mix leaky front and overall nice tail and a chunky design that makes me wonder if the car were a sumptuous 5-star chocolate bar for the young and the trendy [Music] now typically my mornings are full of realizations and one such realization that often happens is the fact that I ten or forgot to charge my phone last night now on occasions like these the venue here does not disappoint for all you have to do with your not so charge phone is simply place it out here in this area and charges all by itself no cables no hassles no adapters let's go [Music] welcome back now my other realization is that I am in the city of Guwahati your other realization possibly is that you're watching power drift and we should be heading to a place called freakin jet when I was driving the venue in the city it seemed to be a very well behaved car for city driving conditions especially because of the light steering now the steering is not just light I will come to that later let's come to it now as we are in the twisties it's a light steering but it also is very precise there's no vagueness to it what also helps city driving conditions is the communicative brakes that you have keep in mind that the front brakes on the venue are his brakes the rear ones aren't [Music] now if you get the window down you won't be able to tell but I can the kind of the insulation for Cap'n seems to be really really nice it is instantly cuts out all the noise as soon as the windows are all up [Applause] [Music] now the venue comes in three different engine options I'm sure you already know that one liter turbocharged engine which turns out 120 horses there is the money point 2 liter petrol engine which is 83 horses the same one has seen in the earlier new toy cars and then there's the diesel engine car which I'm driving right now 1.4 liter diesel manual power figures talk numbers you can read them off the screen what I want to tell you is that both the petrol and the diesel engines drive very similarly both of them start looking up thousand seven hundred thousand five hundred rpm onwards at about 3000 rpm both of them have that power nudge to them in fact the diesel is so smooth so quiet that you might sometimes mistake it to be a petrol car which is not true the other way round or rather which is also true the other way round if you happen to be in the petrol then you might think it's a diesel one why is that well that is because three-cylinder engines inherently are going to be more clattery not so well defined as four-cylinder ones in all the engines the diesel one here of course is the peppiest of the lot when I was driving the petrol automatic variant of the venue I was a happy man you know why because a dual clutch transmission DCT which is going to bring a lot of effectivity to the table besides gear ships and the issues aren't sporty fast but really get the job done as well as any DCT in the world must talk of the ground clearance which happens to be one ninety millimeters it's a new car 190 millimeters if I am to remember it correctly Scorpio ground clearance is about 180 millimeters and next one is about two hundred and nine millimeters I think this soon died drives better than any human died before it's a car that will make you want to come back to it again and again because of the whole package that it is we the foot seats will be great three eight NVH levels of the car good engine options of course we go for the turbocharged petrol automatic hood stuff but you miss out on the six airbags on the petrol automatic which is crazy the handling wise the package is really nice like bit of body roll that is expected but precise steering no weakness to it all of this put together really makes this of bell engineered car good job you man the venue then certainly is more of a venue when you are inside it and driving week in J resort there it is [Music] [Music] [Applause] only one last occasion remains now and that is stepping out of the venue to look young beautiful exuberant and vibrant to attend a party a party where I meet a good friend of mine gothic a singie I shall do it only after packing a piece of this whether in the venue or the press of a button on the blue link okay so I have stepped into the prequel cabin off the venue which I did remotely from my phone I'm sitting at a pleasant 22 degrees Celsius which is near about the temperature where you should take a look at the insides of the venue we haven't done that yet I'll see you at the party the inside of the venue are all black I may say that black makes it look sporty you may say that it makes it look small I may say but it's cozy but you will say the car is narrow and you are right narrow it is let's down to the platform but the seats are stupendous will make you want to come sit in the tar if you were bored inside the venue this lack of soft touch materials remember though it starts at 6.5 lakh rupees and comes to the sunroof even at that price the car gets an 8 inch touchscreen as its customary but for the young and the stylish it doesn't come with a sunglass holder then at the back it is a bit too compact in fact there are hatchbacks out there that offer more space but again you get good contoured seat backs and good under type support less Miri now I forgot to mention that the venue is also quite a safe place to be because of the three buttons that you get on the rear view mirror here the rear view mirror itself is not auto dimming but then the three buttons here do their job the one to the left written in red is SOS for medical emergencies and assistance one in the middle is roadside assistance if you happen to be stranded in the middle of nowhere and then here on to the right is the blue link button which will place a call to the call centre with the help of the inbuilt Vodafone SIM card of course if the car gets stolen or if any unauthorized access is detected you will know it on your phone and then you can also again make a call to the call centre to immobilize the car [Music] what is this venue thank you for having me here know before you explain me that what is this venue we don't bit of a surprise yeah you know like noting about it then we know so much about it and then to drive it today yeah today and it turns out that it's so much more than what it just seems like on paper for me it's the direction that genre is taking of brief step like weather is the way right through in driving yeah it's gone from being something that's a bit of a breeze or something that's absolutely something that focus and identity and I think this this a is for younger people yeah yeah like that like somebody young with want to drive I want to drive it yeah that makes me young now does it that's it and if you thought you liked the venue or if you thought you didn't like the venue or if you like classic do comment below in the comment section ladies and gentlemen I'll see you again very soon ciao [Music] [Applause] [Music]",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@sdc7173",
            "text": "After a decent amount of time, finally you are together! It feels nice.\nWhat feels even better is the fact that Hyundai did manage to make the Venue a Value for Money proposition even after offering so many features, unlike Mahindra or Ford...\nNow the Hyundai and the Tata are the two most VFM products in the segment... Hyundai did a great job!!!",
            "likeCount": 5,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@asifsayani610",
            "text": "So this is a request totally out of the box. I have requested a lot of channels and auto shows but none could help. \nI use a wheelchair as I am a quadriplegic (spinal cord injury) and I am paralyzed.\nI used a TATA WINGER for about 8 years which I recently sold.\nI am looking for a car, MPV or a 7 seater in India which could be useful for people with disabilities. \nIdeally, I would love for my wheelchair to fit in my car whilst I am sitting on it. However, if not that, could u suggest which car I should buy where shifting in and out of the car is easy(Remember, I can't even stand), low entry & exit, wide doors, good head space, boot space and a 7 seater. \nToyota hiace would fit in but it's too expensive and isn't available in India yet. \nI'd be grateful if u could help.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@bhooshanw27",
            "text": "Thats what I have been waiting for,   a Powerdrift review. But nothing much flashy or cinematic. Did not expect this from you guys, I thought a late review would be more like a Powerdrift review. I have always looked at Powerdrift as something which makes the reviews a bit interesting in a creative way, this review seems like a normal review. Sorry I had to say this, the reviews was not bad, it was okay but you have exceeded our expectations before which has set a new bar and I think we are spoiled from that.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@veereshsangolliV12",
            "text": "Man the video was definitely worth the wait, always great to see Rohan and Kartikeya share the screen 😁 \nHyundai seem to have really hit the sweet spot with this car, the pricing is bang on! The styling although is subjective looks great with those harrier styled dual headlamp setup, I'm no chrome guy but that grill looks sweet! The overall styling is tasty. The power train options offered are a plenty just like the features on this car, great to finally see some European tech like the blue link. My only concern now is the safety part, after the nexon scored 5 stars in the NCAP, my perspective towards cars has completely changed! First thing I look out for is safety and Idk how safe this car will be, and that's the only thing bugging me about this car",
            "likeCount": 2,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@satya_gogoi",
            "text": "@PowerDrift The venue has a dry clutch DCT system. Someone spoke of it that there can be some issues in hot climatic areas. Guwahati/Assam or it's adjoining areas are not that bloody hot as compared to north or south India. Will there be any issues in the long term? And secondly, how good is it in pulling off in hilly roads with 5 pax?",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@pranx90",
            "text": "Dear Mr Tenhut, I did not believe in magic , before seeing videos by you ...now , well I do . You very inexplicably manage to sprinkle magic dust all over your videos. \nI don't generally bow ( unless I am in Japan) , but if I ever bump into you, first thing I'm gonna do is BOW!\n( Huge respect for you man )",
            "likeCount": 2,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@mayurnayudu3376",
            "text": "EXXXXCITING Time for  Indian Automotive. Never have we seen so many entrants barging in the market with nice high quality products. Hyundai,Kia,MG,TATA, MAHINDRA doing so much . Wish them all the best. Its gonna get very tough for Maruti now.These manufacturers should focus on rural/semi urban markets ..thats where the meat of the sales lies..not in the Cities. ....There Maruti is the king .",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@Opiniated",
            "text": "#PDArmy Soldier request...\nPlease keep up this kind of work, club it with north, east, west and southern parts of india.\nI mean can you club your reviews be it car/bike or anything across different places in india, like you did this time and with that skoda video of with rajasthan(it's still in my mind). this kind of narrative is very fresh and is inspiring to you know check the vehicle review and pick your own vehicle and go out for a spin.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          }
        ]
      },
      {
        "videoId": "dY97V5GvUA0",
        "title": "2019 Hyundai Venue : An SUV that could blow up the sub-4m segment? : PowerDrift",
        "description": "Hyundai makes well-made feature-loaded cars. And when they entered the SUV space, especially with the Creta, they created waves too. So watch out, SUV makers and look close SUV buyers — this is the new Hyundai Venue. A global SUV revealed in India, on a ship! It goes on sale May 21, and Rohan has all the info on the Venue from the launch venue.\nExpected to be priced between Rs 7.50 lakh and Rs 12 lakh (ex-showroom), the Venue competes with the Mahindra XUV300, Maruti Suzuki Vitara Brezza, Ford Ecosport and Tata Nexon.\n\n#PowerDrift  \nJoin the 1 Million strong #PDArmy : http://bit.ly/PDARMY\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nTee Shirts, Badges & More official merchandise : http://www.powerdrift.com/merchandise\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/PD_Official",
        "channelTitle": "PowerDrift",
        "publishedAt": "2019-04-24T04:08:31Z",
        "viewCount": "541828",
        "transcript": "[Music] [Applause] good morning folks now today is a special morning because as you can see I happen to be in the middle of Arabian Sea and I'm here of course for the launch of a very important car for Hyundai India which is the human eye when you let's check it out [Music] but I can't get to it yet because this is a big long huge ship ship called Andrea which has 13,500 horses we should talk about the plethora of engine options that it gets so it gets a turbocharged 1 litre petrol engine 1.2 liter petrol engine and diesel is your poison then you also get the 1.4 liter diesel engine that you've seen in the i-20 s4d craters the car is this way [Music] [Applause] even before I had reached the venue it became very clear that it is a looker it's bold front grille is bigger than its rivals and it's chisel bodywork total overall let's just say it looks like it comes from across the sea no surprises there because the venue is a world car a world car with a world-class interior nothing too flashy just clean and classy detailed with cruise control wireless charging and MOT safe with six airbags and stability control finally with the Hyundai venue rather in the Hyundai venue out here a tapas ship now the plethora of engine options that we spoke off you want liter turbocharged petrol engine churns out 120 horses that's quite a lot and of course is backed up with a 7-speed dual-clutch transmission which is a first in-class feature I would say but then I would say not because the four Nico Sport did get a dual clutch transmission let's talk of the space inside the human dive venue well it is not very spacious at the back especially three people yes can sit in comfort so it will suit your family there's good and the thigh support there rear AC vents out here by the way you also do happen to have a small sunroof eco sport and the XUV 3w also get a sunroof now behind me is going to be a massive boot which is gonna be to the tune of 350 liters of boot space what's the quality like on the inside human dies never faltered went into quality so the venue does end up looking premium and everything the fit and finish is at par with the competing SUVs for a tad bit more you also get an HD display screen [Music] and this is no ordinary HD display because it is the window to all things connected which means that Hyundai venue comes with its own SIM card giving you real-time traffic updates and vehicle diagnostics what's more you can even turn the ignition on and off remotely or play around with your climate control remotely or honk to scare off registry ins all through your phone now all these features and the connected awesome lists are going to be ready to be had at a showroom starting May 21st which we need lakh rupees to 12 lakh rupees which makes me think that going better looks the style and the venue of it the other competing compact SUVs are gonna have a tough time getting past this unite venue which begs the question what's gonna happen to our beloved Greta for the Creta itself stands to get a mighty upgrade as is already revealed in China in form of the IX 25 it's now even gonna get a screen as big as the one seen in Tesla just imagine all the things that you can watch on it maybe about it video just like this one goodbye ok and now it's time to be with the master marina let my eye is mr. Nathan Gong who is the captain of the ship captain hey tell us a bit about this ship yeah this is a beautiful ship which we have got it for the west coast of India and very endemic we have been very endemic to the post it is named as the chronology after the circle comma geometry the first Murata admitted right so this is beautiful fine lines yeah and you have have been on a good you see the void yeah absolutely absolutely I've been here from Mumbai to go I think this has been one of the best journeys between the two cities I would say so look out and watch out for this ship called Andrea if you want to get to go out from Mumbai this is the best possible way to do it has been since October 24th last year what a clarity for all of us now captain what did you think of the car that got launched on this ship I think it's the very first time that something like this is happening what's your this is the first time it has ever happened in ER the car has been launched off on a ship yeah we were very excited because we loaded this fasten know the wrapped up and we had all that excitement to see we had a great unveiling ceremony yesterday just sundowning and like I said they're connected intelligent intelligent she look robust with the lights were very fine and beautiful one more it was really nice to have these two cars and they give it like thank you so much for having our you",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@theridersoul1384",
            "text": "You guys are late to the venue first look party But trust me you are here with a bang..!! after seeing the audio quality of some channels, I cant churn out their names but you guys know well I was keep thinking that why Hyundai planned to have a media launch event at such place where there is so much of wind around. Now this video got me thinking that why other channels out there are in so hurry to upload their video that they forgot about the quality of the content ..!! #PD_Army #Love_Power_Drift",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@Enfielder1985",
            "text": "Firstly I'm so glad to see you spoke to the Captain... Very different from others. And I was caught between Nexon and Ecosport for a while and was planning to book the Nexon AMT  in June... Now I know which one to book considering I've owned an Xcent for nearly 5 years and had a wonderful ownership experience",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@JayanandSupali",
            "text": "absolutely loved the last bit with the Captian of the Ship. About the car, will wait for the review. Can't wait to see how the 1-liter Turbo performs. \nWhich reminds me, I just feel sad that Ford never got its Award-winning 1 liter Ecoboost engine to India. Sad for them. \nBut now i am sure this Tine Turbocharged engine is gonna make the same noise as the EcoBoost would have. Performance as well as good fuel efficiency.\nPower Drift, plz do review that engine. I am so looking forward to it.",
            "likeCount": 1,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@rahul11116",
            "text": "PD never disappoints with uploads. 😍\nBut please upload relevant videos faster. This exact video should have been uploaded 2 days earlier. Other channels are able to upload it much faster.\nHands down, quality of the video is better, no doubt. I would still love it if it was uploaded right on time.\nPD army rocks.",
            "likeCount": 4,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          },
          {
            "author": "@gauravthakral9719",
            "text": "Hyundai certainly has got a winner up their sleeves. However, right pricing wrt competition and pollution norms may define further popularity. Hyundai perhaps would be able to sell the 1L turbo petrol variant better than what EcoSport could do with their Ecoboost engine.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.900Z"
          }
        ]
      },
      {
        "videoId": "_FOJBtWOZDY",
        "title": "2025 Hyundai Venue Review: Gets (Almost) Everything Right",
        "description": "The Hyundai Venue gets its biggest update yet! More space, more features, and a more premium cabin than ever before. The second row is finally more comfortable, the cabin quality has taken a huge leap, and safety has been amped up with Level 2 ADAS and all-wheel disc brakes.\n\nKaran Singh heads to Goa to drive the new Venue Turbo-Petrol N Line and finds out whether it’s now the best compact SUV in India. With petrol and diesel options, manual and automatic transmissions, and Hyundai’s trademark reliability, the new Venue aims to be the perfect mix of practicality, performance, and premium appeal.\n\nBut with prices going all the way up to ₹17 lakh (ex-showroom), does it still offer enough value for money? Watch till the end to find out!\n\n#PowerDrift #PDArmy #HyundaiVenue #HyundaiVenue2025 \n\nJoin the 3 Million strong #PDArmy: http://bit.ly/PDARMY\nMerch Drop: http://www.powerdrift.com/merch\nListen to the #PowerDriftPlaylist: https://spoti.fi/3Ny2uVr\n\nFollow us on: \nInstagram: https://www.instagram.com/powerdrift/\nFacebook: http://facebook.com/POWERDRIFTOFFICIAL/\nTwitter: https://twitter.com/powerdrift\nWhatsApp: https://whatsapp.com/channel/0029VamrxqfL7UVRtRwR9F3N\nThreads: https://www.threads.net/@powerdrift\nJosh: https://bit.ly/3O8Y6fJ",
        "channelTitle": "PowerDrift",
        "publishedAt": "2025-11-11T05:30:22Z",
        "viewCount": "112871",
        "transcript": "Check it out. Check [music] boom, baby. Feeling it. I'mma go crazy. Everything's looking [music] good, good like should baby. >> When you think of the updates to any new car today, big screens, more features, and more money is usually the script. [music] And when you think of buying a comfortable, reliable, feature-p packed SUV for [music] near 15 lakh rupees, the Venue is where you start. And this is the new one. >> And yes, new of course means it does get bigger screens, [music] more features. And with a price range from just under 8 lakh rupees to near 17 lakh rupees, it is more expensive than before. But is it better? If you want the long answer, then stick around till the end. But the short answer is yes. Back here, you get a little bit more knee room thanks to a slightly longer wheelbase. There's also a two-step recline for the rear back [music] rest, and you also get sun shades. Now, the rear seat has always been the Venue's Achilles heel, and these small changes put together definitely take it from a 6 on 10 to a 7.5 or even an 8 on 10, which is respectable. There are still only two headrests back here. So, the person sitting in the middle does have higher chances of a whiplash injury, but at least you get AC vents and two type-C ports to keep you cool and charge your phone while it happens. Safety is no laughing matter, and Hyundai agrees. The Venue therefore sits on a revised global K1 platform with more use of high strength steel. There are also all-wheel [music] disc brakes now and it gets level to ADAS with six additional safety features compared to the outgoing venue. There's no endcap crash test ratings just yet, but I do have high expectations. And no matter your expectations, you're definitely going to be impressed by this cabin. The quality of the materials firstly is [music] spectacular pretty much everywhere you touch. The switches, the dashboard, the console [music] here, the stuff here, it is really very very good quality. You have two dual 12.3 in screens with really sharp resolution, very fast responses as [music] well. And yes, wireless Apple CarPlay and Android Auto, which is great because these [music] really are the kind of screens that make you want to use maps even when you know the way. [music] And Hyundai clearly knows the way forward. physical controls, proper buttons for media and air conditioning. Finally, a manufacturer that realizes that not every surface needs to be touch-based. [music] So, the new Venue is more spacious, has [music] more features, and more safety built in. So, you would automatically assume that Hyundai has gone to town with the engines as well, and they have. There's [music] a new 170 horsepower petrol engine. I'm just kidding. It's the same engines as before. [music] You still get the smooth naturally aspirated [music] petrol with a manual, the punchy but thirsty turbo 3-cylinder petrol with a manual and DCD, and the awesome diesel, which finally gets both a [music] manual and an automatic. Basically the same playlist, just better speakers. If you're not a driving enthusiast, firstly, you need help, [music] and secondly, you need nothing more than the standard petrol engine. It does get a little bit lethargic if you load it up with people [music] and luggage, but otherwise, it's got enough grunt for the city and for occasional highway runs as well. There is a drunk man on the road attempting to cross. I will quickly navigate past him and get back to the topic. Now, there are two catches with the standard petrol engine. First is that [music] it's only available with the manual. Hundai for some reason is not offering the CVT like they do with the [music] i20. The second catch is that it's only available in the mid-spec variants. So only till H5 is where the [music] standard petrol goes uphill. So none of the higher variants. If you do want one of the higher variants and you spend a lot of time on the highway, the diesel is a great choice. It is expensive, but you more than recover that cost in terms of its [music] fuel efficiency. It's also smooth. It's got a great amount of range on the tank and honestly a very nice engine. Huna is also offering it with the automatic now, which is great. But the catch with the automatic is that it's only available in one midspec variant and one topsp spec variant. And that brings us on to the turbo petrol, [music] which is this. It's punchy, it's fast, and in this endline, it also sounds really nice. Uh Huna is offering a seven-speed [music] DCT or a manual gearbox. Again, super nice. You have the option of both. The DCT is offered in four [music] different variants. So again, that's great. And it's also really fun to drive. What's not fun though is [music] the 8 to 9 kmpl mileage that you'll get in the city. Fun though is what Hyundai's designers seem to be having because the new venue looks interesting. It's more imposing for sure. Angrier face, taller stance, and swollen arches. [music] Looks can be subjective, so I'll leave you to decide what you think about the new Venu's design. But if you ask me personally, I'm not a big fan of it. For me, the design is a little bit too busy and there's just a lot going on pretty much everywhere you [music] look as compared to the old Venue, which was a really nice, smart, clean design that [music] aged pretty well. Anyways, that brings us on to some frequently asked questions about the new Venue. How big is the boot? It's 375 [music] L, which is just about perfect for fitting a couple of cabin bags and a couple of bodies. >> What? >> Just kidding. The cabin bags won't fit after the bodies. Okay, next question. Can it do a J turn? Only one [music] way to find out. [music] Yes, it can. How are the speakers? This topsp spec variant of the Venue gets an 8 speakeraker Bose audio system with a new amplifier in the back and it sounds good. Gets a solid [music] 8 on 10, but it's not a night and day difference from the outgoing Venue. Next question. Is it worth upgrading from the old Venue? [music] I'd say if your old venue is still starting, stopping, running just fine, then I would not suggest that you get the new Venue. But if you're upgrading from a smaller car or a hatchback or [music] planning this as your very first car, then yes, the new Venue is smarter, it's safer, it's bigger than ever before, and [music] honestly, the Venue is just such an easy car to recommend that this would make a great first car or a great upgrade. The cabin [music] feels very premium, and this just feels like a small car and not a cheap car, which is very nice. >> [music] [music] >> And that's really the best way to sum up the new venue. It appeals to one and all. Yes, the variant split is a bit odd. It's still not our recommendation. Even if the rear seat is your priority and it is expensive near 1 to 1 and a half lakh rupees more than its rivals at the very top and you don't get too much extra in return but what you do get is a comfortable feature-packed SUV with a [snorts] really premium cabin that you would look forward to stepping into every single day. We've also only heard good things about Hyundai's service and reliability which is definitely a major question mark for some of its rivals. The new venue then is really a jack of all trades. [music] Welcome ladies and gentlemen to the unscripted part of the venue review. I hope we've covered pretty much everything. Some stuff that I wanted to cover uh as extras is one is the blind spot monitor. It's actually really nice. Uh you put on your indicator and the blind spot monitor comes onto your cluster. [cough] >> Mah is having a cough. In fact, I have a really bad cough as [music] well. And Jay, who's our social media guy sitting in the back there, also has a really bad cough. All of us have blocked [music] noses and serious cough. So, send us some get well soons in the comments. But anyways, blind spot monitor is actually really nice. Uh, you put on the indicator. You might have seen it on the cells in the sonnet. You put on your indicator, [music] you get a display in your cluster, and it's actually very convenient. You almost stop using the mirrors if you get used to [music] it. Very, very nice. The quality of the materials is the main thing I wanted to talk about. [music] It is genuinely fantastic. You don't notice it so much on the endline because all the plastics are black, but on the standard car with the cream and blue interior, it just feels very premium. And [music] for me, this is the main thing. The Venue is a car that hasn't ever felt wow. Like the Sonnet to me has felt wow [music] in a lot of places, but now the Venue feels properly wow. And genuinely, the quality of the materials is spectacular. There's not soft touch plastics in a lot of places, but the plastics feel really premium. Even this uh bit on the dashboard where the venue lettering [music] is. It honestly feels like a stone tile and not a plastic. It's really well done. I really like the layout of the interior as well. [music] The screen is curved towards the driver. There's nice big chunky physical controls. It just feels very well put together. It's expensive and honestly a lack and a half maybe more uh variant to variant against some of its rivals is a [music] lot of money and there's not too much you're getting in terms of uh stuff on the spec sheet. But as a product, this is a car that you [music] just it's so easy to recommend, so easy to buy. It's just really very very nice. [music] Anyways, thank you for watching Power Drift. Hopefully you liked our review of the Venue Nline and the Venue and uh yeah, some get well [music] soons in the comments, please.",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@svp6296",
            "text": "Am about to book HX5 turbo manual but now holding coz of city traffic mileage reviews. Some user mentioned as 4 to 7 kmpl in bangalore..!!\n\nIs it really that bad!? My usage is mostly within city (bangalore)\n\nIs the fuel economy a deal breaker?\nThanks in advance.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@sammathew1127",
            "text": "Scammers 😡\nThe alloys look so so so *shabby* even after paying so so much 🤮 \nLooks like a *Exter* ,\n update after the bad looking bumper.. only N-line has good bumper.. why ????\nEven NiOS has 100 times better alloys and rest of Hyundai and KIA has good alloys!!\n\nAll the GST cut *Hyundai* is enjoying  and looting Indians 😡😡😡 \nDespite owning and Hyundai and Being a *Big Fan* , now these KOREANS ARE looting Indian's 😡😡😡\n1)\nVENUE is... Very very  very overpriced 😡😡😡😡\nAnd only *H5* for diesel automatic..and no other model between the top end and *H5* 😡😡😡😡😡😡\nTerrible planning by Hyundai [they want to loot Indians]..😢 \n\nSyros, even though it doesn't look good.. its practically toooo good. \n\npanoramic roof with.. *top notch* build  quality \nAnd very very very very spacious ❤❤❤ \n\nAnd yet the *car is very strong* 💪🏼  quality is 🥰❤️🥰❤️ \n\n2)\nYes man ❤.. Syros is 👏🏻 \n\nBut, still Syros Base model diesel manual is ❤ [ 13.2 lakhs onroad Bangalore/Kerala ]\n[has all all all all the  necessary features] all door power window/ sunroof/ tpms / wireless android auto/ reverse camera/ 6 airbags which is a mandate in India.\n[ AND SPACIOUS AS much as INNOVA HYCROSS]\nBut they don't provide automatic for diesel base model \nOnly top end has automatic diesel 😡😡😡😡😡 \n\nElse, would have bought one as I want one 😪😪😪 \n\nBut KIA = Hyundai [same parent company] they are playing games 😡😡😡😡😡",
            "likeCount": 1,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@niranjankn280",
            "text": "It costs 9.5lacs for a base petrol 1.2ltr venue which gets gst benefits and 9.9lacs onroad for brezza base 1.5ltr petrol in Karnataka which doesn’t gets gst benefits. I don’t care much for fancy useless features, venue is overpriced, period. And NLine, I really don’t talk about it, god bless those souls who gets one.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@shibilmohammed4366",
            "text": "Old venue n line is much better in looks except for the alloy wheels. \n\nBut features wise the new one is incomparable with the old. \n\nEspecially the Adas, ventilated seats, 360 camera, more leg room for rear seats, blinds for rear seats, big screen, etc \n\nI will be happy to get old car design with all these new cool features.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "B_lM7N0WzYQ",
        "title": "Head2Head - Brezza vs Venue | We Compare Styling, Features, Engine, and Driving | PowerDrift",
        "description": "City SUVs have plenty expectations to fulfill. They're here to be used by many members of the family - young and old,  they're expected to drive well over hard concrete yet still keep up with off-road escapades when the family decides, and they've got to look stylish for the neighbours to notice. So much to deliver in such compact packages. We pick two of the most popular choices, and put them Head2Head. \n#powerdrift  #hyundaivenue #marutibrezza \n\nJoin the 2 Million strong #PDArmy : http://bit.ly/PDARMY\nMerch Drop : HTTP://www.powerdrift.com/merch\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/powerdrift",
        "channelTitle": "PowerDrift",
        "publishedAt": "2022-11-24T10:30:03Z",
        "viewCount": "385677",
        "transcript": "Hi! I'm back, and you, are looking at the backs of two of India's most loved compact SUVs. For these SUVs, they don't need no introduction. But, you definitely need to know, where should you park your money? 12 lakhs and 7 thousand rupees will get you this. A compact, yet stylish Hyundai Venue, in its top spec form. So this is the SX(O) with the dual tone colour option, and the IMT transmission. Add 39 thousand more to the equation, and you can get yourself this. India's most loved and most sold compact SUV, the Maruti Suzuki Brezza. And this one too is in its top spec form. So ZXI Plus, with a dual tone colour option, and a manual transmission inside. But if you are considering automatic transmission, this price gap is going to widen. And it widens by a lakh and 25 thousand rupees. So we've established that the Venue is a lot cheaper than the Brezza. What does that mean? If it is a better car? Or can the Brezza prove its worth, is what we're going to find out in today's video. (music) As you know, money saved is money earned. And that is why if you buy yourself the Hyundai Venue, you can finally take that international trip that you always wanted to. You can also... get yourself a beautiful pet. Or maybe buy yourself an iphone. Like my DoP Vikas is planning to. I personally would go ahead and buy the Ather 450X. A stylish scooter to match my stylish SUV. Yes, the Venue has gotten a lot more prettier, after this facelift. Or maybe call it a cosmetic job. What also makes it draw eyeballs, are the snazzy dual tone alloy wheels, and black appliqué around the grille. The bumpers, although proportionate, have too many elements that make it look a little too busy for my liking. Now, if you're the sort who always prefers the largest pizza on the menu, it is the Brezza that will certainly appetise you. Now this SUV has gotten people thinking that it competes with the Creta! And not the Venue, and that is despite it having the exact same length, and the exact same wheelbase, as compared... to the Venue. It is however wider by 20mm. And taller by 68mm. So, it is a large SUV. Imposing, upright, tall. Things that we prefer our SUVs to be. It also comes with a great boot where you can stack your things neat and tidy. However, the boot space on offer, is not as great as what the Venue has to offer. Which is 22 litres more than the Brezza. It's not blingy like the Venue is. And comes across as an SUV in its prime. Love the new illumination units on the front, and the rear. Especially how the front cluster now gets LED turn signals. Also, that clamshell bonnet looks really nice. Looks on the outside are really important, but not as important as the cabin experience, because this is where you will be spending a lot of the time, and this is also where the Brezza, triumphs over the Venue. And it all starts with the seats itself. They are large, they are supportive. They are very comfortable. Also the dashboard, it sits higher. It's wider, so you get the sense of driving something big. Bigger than the Venue. The cabin is wide, yes. So that liberates a lot of space between you and your co-passenger. Talking about space, there's plenty, both in the front, and the rear. Now about the features, let's quickly talk about them. It gets everything that the Venue gets, but also... it gets a lot of segment first features. That includes a 360 degree camera, with a cool animation of the Brezza itself, and that is very helpful, especially when you're navigating this big car in the city. Also, it gets a heads-up display, and that again gets a lot of different views that you can toggle with, using the switch on the right side of the dashboard. The dashboard itself gets an ambient lighting that extends to the door cuts. Quite a classy thing! Now talking about things being classy here, look at that beautiful analogue dash! Look at it dance when I rev the engine! Now this is called beautiful! I quite love these analogue dials. This... as opposed to that? Nah! Yes, the Venue gets a full digital instrument cluster, but then again its just throwing random information at me. It's not at all classy. I used to prefer the analogue dials that the Venue used to get. Remember those? Those were really nice! So when you jump into this cabin straight after the Brezza, you feel it is cramped all of a sudden! Space has been deleted from all 4 corners. However the use of this light upholstery, does add some sense of airiness into this cabin. But then again it's not as big as the Brezza. Also the fit and finish levels? Not as good as the Brezza. Lots of hard plastics being used everywhere. Scratchy hard plastics; now both the cars get those. But then again the quality here in the Venue feels a grade lower than what the Brezza has to offer. So, this is a slightly smaller, slightly complicated cabin to live with. Now talking about the features, it covers the basics. So you get a really responsive high definition screen. With your modern smartphone connectivity. You get a single pane sunroof. You get you automatic climate control. You also get wireless charging. Everything that the Brezza gets, except... those segment first features. And what the Venue offers over and above the Brezza, or basically what the Brezza doesn't get, that the Venue gets, is that integrated air purifier with the central armrest, which is quite cool. And also gets a 4 way powered driver's seat. But then my question to you is... How often would you adjust your driving position? Once a month? 5 times a month? 12 times a month? I could live without it. Alright, erase all of that fluff, because now that I've got myself into a really good driving position, thanks to these \"electronically adjusted\" driving seats, it's time to fire up, the better of the two engines. Which, Ladies and Gentlemen is... the TGDI turbo charged 3 cylinder 1 litre engine, that eats 8 powered horses for breakfast! (music soars) You know what, Ladies and Gentlemen, this is what you called a compact SUV, with a compact engine. But it is also very nimble. It's very fun to drive in the city. You can squeeze it through the gaps and really have lots of fun. Even on mundane drives, like your commute to work, it's fantastic! It is a little stiff. So when it put it through the potholes, it will unsettle the entire cabin. But the flip side to that is, when you find yourself a good driving road, like how I have at this very moment, it is an absolute joy, and an absolute hoot to drive this thing around. It is so much more lively, and so much more involving and so much more connected, than the Brezza, and that is what I absolutely like, about the Hyundai Venue. Behind the wheels the Venue feels like a compact hatchback, that is allowing you to have a lot more fun in the city. Also, when you push it a little too hard, it tends to understeer. I mean it is a front wheel drive, so yes, it will understeer. But then it still feels very well controlled. This entire platform, this chassis, gearbox, it all demands a manual transmission to go along with it. And that is where Venue misses out. Yes it does have the DCT, but then, that comes with a price. And that is also quite expensive to repair, if something does happen to it. A manual transmission, a simple 6 speed manual transmission would've really been very sweet. But then what you get instead is this IMT. A intelligent manual transmission. It might be intelligent, but in terms of the fun that it offers? Not so much. So what is an IMT? Basically, you don't get a clutch. Whereas you still have to slot it into individual gears. How does the clutch operate? Well there is a cable that sits right under here. So every time you shift, the clutch engages first, and after that is when you slot it into the gear, your desired gear. Now while you're driving in the city, it's actually quite beneficial. Because you don't have to worry about your left foot. You can just rest your left foot. And also you don't have to shell a million bucks to get yourself a good automatic transmission. But, when you're driving out here, when you're driving enthusiastically, this tends... to just not the driving thrills. It lags. I mean it feels notchy, and the gear shifts, they take a little effort. Sometimes it also tends to miss, and that is something that I really don't like about this transmission. But then again... the normal audience out there, never really drive like this, do they? They drive in a much more sedated fashion. And in those sort of driving conditions, this transmission works absolutely fine. It works like a dream, to be honest. Actually magical, how you can change it, into any gear without the need of pressing a clutch pedal. It's as easy as that! 3rd to 4th? That's it! It's actually pretty easy to drive this IMT. It's not fun though. (music) Quite raspy, the way it sounds as well. And the steering wheel might be light in the city, but out on the highway, it does really weigh up. And that makes it quite an enthusiastic car. Not an M5. It's not a twin turbo charged V8. But then again for the money that you spent... it is quite good. There are 3 things that are made evidently clear when you start driving the Maruti Suzuki Brezza. Number 1, it lacks power. It is fine till about the speeds of 40, but then after that... it runs out of breath, as if it has cholesterol. It really takes a lot of effort to get this thing moving. Number 2, the ride is phenomenal! It is just brilliant! It is great, it is... It is unbelievable! I mean you can throw anything at it and the suspension will sort you out. And that list can even include speed breakers. And number 3. Everything touch point that involves human interaction has been smoothened out. It's peaceful enough to a level that it's hard to believe that it's a machine that you are operating! Like for instance that engine is super silky smooth. As a result of this, the pedals have zero vibration and they are very well strung. And then the clutch is very light, the bite point is very well refined. And the gearbox, the slots, the gates, everything is just brilliant! It feels like this gearbox deserves to be in a sports car. And no, I'm not making this up. This is actually the reason why you still love driving manual transmission. So the gearbox is a lot of fun to operate. The only thing that the Brezza then lacks is power. And what a shame that is. Because power was never really a concern with the earlier Brezzas. The diesel was. But the earlier Brezza, the petrol powered Brezza, it never felt so underpowered like how this one feels. Now while the Brezza might have lost all that performance, it has definitely earned a lot more fuel efficiency. Yep, this is one of the most efficient petrol powered compact SUV that our market currently has. And yes, I've been driving it like a maniac since the morning, and all of that verifies, it checks. Cause this thing has been throwing some unreal fuel efficiency figures at me! So then this power-train combined with that gimmicky mild-hybrid system, does not make you want to miss that diesel Brezza that we all used to love and adore for its fuel efficiency. Especially this one does the job equally well, while being a lot more refined and while being pollution compliant as well. So I think it's a win-win situation for most of us out there. Alright, this one has been really difficult, but now it's time to sum it up all together. Which of these two should you consider? Which one would we buy happily, as Indians? Well I believe the answer to that question lies in that question itself. No? You don't agree? Well think of it this way... While it was the Venue that really made me smile and I really did enjoy, this compact little SUV with that punchy turbo charged engine, I've come to realise that occasions like these, where you drive in a spirited fashion, present themselves very rare. For normal drivers, normal road users, are going to find themselves either in traffic, or in pothole ridden roads, and that is where, it is the Brezza that feels a lot more rewarding. It is also a lot larger than a Venue. Offers a lot more features than a Venue. So I think it deserves to take that crown. So that extra money that you paid to get yourself this Suzuki badge, not only gets you all those features, it also gets you a peace of mind, and ease of ownership. Ladies and Gentlemen... this is then... the winner of today's comparison. Well, all hail the King! My Lord, you really are great!",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@rashmiranjanbaral2115",
            "text": "Venue in comparison to new brezza costs drastically less also... Brezza's  interiors are the worst feeling interior in the 15lac price bracket.. fabric seats , stearing and switches from Swift and overall I don't see any practicality advantage over venue .. Have u sat in back seat of new venue ? It offers similar space if not better than brezza has better thigh support and has recline also which gives a far comfortable experience.. Now if you want to compare Venue's top to brezaa it's a whole 70-80k cheaper at 13.70 lacs on road for SX(O)imt.. so ideally venue is better kitted out if you compare with one below top variant of brezza.. and if you want to compare with Features let's bring in Sonet.. Ventilated Seats, Front Parking Sensors, Airpurifier, Digital MID which shows Navigation directions also , 10inch touchscreen, fully leatherette seats and stitching in doar pads, Bose 7 speaker sound system with sound mood lighting.... And still costs 14.42 for GTX+ imt on road Bhubaneswar than 14.41Brezza Zxi plus Manual... And has bigger boot, better practicality in cabin storage spaces and much better handling dynamics & performance... I do agree Sonet offers little less space at the back but that's about it... I personally will rather be happy with a Sonet or Venue in my garage.. now safety wise brezza last gen got 4 star and i20 new gen got 3stars at 8.84points so even if sonet or venue comes with 3 stars it is not making brezza a whole lot safer... And specially when u are taking top variants with 6 airbags,VSM , traction control and all..",
            "likeCount": 11,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@bull2026",
            "text": "I did test drive both..\n\nReally heads up display and 360 camera is not the future needed in top model. During Day time heads up display has poor visibility. So far I am driving car with out camera so 360 is not my wish list. \n\nBreeza has its own stand for boxy look outside and road view from inside. But venue is definitely a city car with lot of features. \n\nBut finally I decided to go with imt top model which comes on road 14.5 lks where as zxi plus will be 15.5 lks . I am thinking about future to void manual clutch in traffic.\n\nI often adjust seating position while driving long distance. He did not mention about body roll in Brezza during high speed corner. \n\nIf you have family with two kids go with venue, for adults go with Breeza. But decide you want manual / imt / AT/ DCT",
            "likeCount": 11,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@nitinkavade1684",
            "text": "Finally, someone comes out with a clear-cut verdict!! Yes, every buyer and their requirement can be different but the entire point of a comparison video is giving a clear cut verdict as per your analysis... Seen so many other videos, it depends, this/that, if you want X you buy this, if you want Y you buy that... I mean c'mon. This is a really good start for clear verdict videos PD.",
            "likeCount": 18,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@surajbiruly8298",
            "text": "5:43 Well Everytime actually..\nMere papa always sit close to steering aur seat height uppermost setting pe + straight position\nMeanwhile Me : Hum steering se duur hokr baith te hy + 4th lower seat height pe aur back position mera piche k taraf thora tilted rehta hy",
            "likeCount": 3,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "cwLZggWHqQ0",
        "title": "2022 Hyundai Venue | More Features, More Money. Worth It? | First Drive Review | PowerDrift",
        "description": "As the segment gets hotter, Hyundai has decided to freshen things up with its compact SUV. Is this the makeover that we need? Vipul heads to Hyderabad to find out.\n\n#PowerDrift \nJoin the 2 Million strong #PDArmy : http://bit.ly/PDARMY\nMerch Drop : HTTP://www.powerdrift.com/merch\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/powerdrift",
        "channelTitle": "PowerDrift",
        "publishedAt": "2022-06-23T09:30:13Z",
        "viewCount": "390905",
        "transcript": "Who you are as an essence has been here before. And when you realize this, at some point you get this urge to evolve, do better. That's what facelifts are all about. A midlife refresh to liven things up, make it more attractive. And look who is looking a lot sharper now. It's the new venue. Now, as is the case with most facelifts, there aren't any changes to the engine, gearbox options, or even the suspension setup, which isn't a bad thing because we never really had any concerns around those things. In fact, there is an engine and gearbox transmission for every one of you out there, including a diesel, which a lot of manufacturers are shying away from. [Music] Now, in terms of the driving dynamics, we really like how the Venue drives. It's slightly on the firmer side, but that is what makes it really enjoyable and that the Venue continues to be. What they've also done on the 1 L turbocharged DCT option is added three driving modes. Eco that tends to sip fuel a little less. You get the normal mode that offers best of all worlds. And then you get sports that offers slightly spirited performance. Sweet. [Music] So dynamically we know that the venue continues to impress us which is a great thing and appreciated factor of it. And just like a hot sunny day like this when you would pull out your dark sunglasses to feel slightly cooler. The venue well it wears this dark chrome grill on its face to look slightly cooler. Now drivers who are going to drive the venue during the night are going to appreciate LED illumination that replaces H hallogen setup while retaining the same projector lamps. Quite a cool thing. You'll also notice that this unit here has been redesigned very slightly slow just like the front bumper and the rear bumper which now look a lot more squared off. It is the rear though that differentiates this new Venue from the older one. All thanks to this connecting tail lamp that looks really cool. Following the trend then, isn't it Hyundai Venue? Now, which SUV pulls it better? Let us know in the comments below. Also, while you're there, let me know if you like design of these new alloy wheels because I'm not really sure about it. Now, while you were busy commenting in the section below, I took some time to check out the interiors of the all new Venue, which in terms of the changes offers a lot more usable additions as compared to the polarizing cosmetic changes on the outside. Starting with this rear seat itself. A lot of us complained that the venue never offered a lot of space for the rear passengers. But look what Hyundai has done. They've scooped the back of the front seat that liberates a few more inches of space and the bench itself can be reclined. There's a two-step recline. So the experience is slightly better than what the Venue used to offer. Also, what Hyundai has done is offered a 60/40 split with a rear bench that offers a lot more versatility with this compact SUV. Now, what really used to annoy me with the older venue was the air purifier that used to occupy one entire cup holder space here, right here. But Hyundai has fixed that. They've integrated the air purifier with the central armrest. Very similar to what is being offered with the Creta. Quite nice. The functionalities of this can be accessed via the button on the side or via the screen. Now talking about the screen, this is the same 8 in unit but with better resolution and more functionalities which include more screen options. You have overthe-air updates and also multiple language support. Also, just in case if you're missing the quiet and calm of a beautiful serene location while you're in the city's hustly bustly traffic, this system will emit noises that are inspired by nature. Nice, Hyundai. That's what I need while I'm traveling from home to work. Thank you. What's more, you now have a four-way powered driver seat, a first of its kind in this segment, and a new color for the upholstery, which I can affirm looks much better than before. There's also a new instrument cluster that's been borrowed by a certain Kia, although I like my analog dials better, especially because the ones on the Venue were nicely done. But I suppose the same has been added to keep the newer gen of users happy just like the type-C charging points. Now, along with all those changes, the prices of the Hyundai Venue have been revised to, it is slightly more expensive than what it used to be retailed as, which makes it sit right in the middle of the segment that spans from the Nissan Magnite all the way up to the XTV 3O and everything in between. The benefits of the Hyundai Venue, well, there are plenty, especially if you love your cars feature loaded. This offers a lot of features, including some that are segment first, which is a great thing. Now, along with that is the possibility of configuring it the way you want. There is a Hyundai Venue for everyone as I like to put it. Got yourself 7 and a half lakhs, you can opt for the base Hyundai Venue. If you got yourself 10 lakhs, I have two options for you. You can opt for the base turbocharged petrol which is quite fun to drive or a base diesel engine that is quite frugal. And if you want more toys, you'll have to shell out 2 1/2 lakhs, but 7 1/2 lakhs, 12 1/2 lakhs, and there is literally a venue for everyone in that price bracket. So, it still retains to be quite an impressive SUV, a modern SUV that can do a lot of modern things that you would expect from your daily driven car. It's like the Venue has got a complete makeover and it looks and feels a lot more better. Isn't that a good thing? [Music]",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@sahilroy893",
            "text": "So, you don't call them out for making unsafe cars. There is a massive price hike in top variants and still you say it's minimal. No ventilated seats, no rear disk brakes and yet you call it modern. Hyundai kafi khayal rakha hai tumhara. Such a shame!",
            "likeCount": 2,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@chandanraina",
            "text": "Why Hyundai why. Why do you have to make your cars ugly?! The in your face chrome grill and the what appears to be a totally randomly slapped together cluster of lights in the rear, completely killed the car for me. I was always a huge Venue fan. The previous gen looked so good - understated, European, humble yet attractive. This is such a step back. When is this obsession with chrome gonna end? Ugh!",
            "likeCount": 5,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "930zKqOyMWE",
        "title": "Hyundai Venue N Line | What Does Rs 13 Lakh Get You? | First Drive Review | PowerDrift",
        "description": "The new Hyundai Venue N Line is the sportier version of the compact SUV. With the N Line badge, this Venue gets stiffer suspension, heavier steering, new exhaust tip with a throaty exhaust note, and some cosmetic like badging, stitching, and more. But there's more to this. Vipul explains what Rs 13 lakh gets you, in this first drive review of the 2022 Hyundai Venue N Line.\n\n#PowerDrift \nJoin the 2 Million strong #PDArmy : http://bit.ly/PDARMY\nMerch Drop : HTTP://www.powerdrift.com/merch\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/powerdrift",
        "channelTitle": "PowerDrift",
        "publishedAt": "2022-09-19T05:34:56Z",
        "viewCount": "325952",
        "transcript": "[Music] foreign [Music] they've given us a second product in the end lineup and this time they've priced it really competitive I say that because in a market like ours that is getting expensive by the day the venue end line it sits just north of 13 lakhs now for reference the maruti Suzuki brezza in a top shelf variant will cost you almost a lakh more by the time you get the Cars road legal so what does 13 lakh get you and are there any compromises that you should be aware of foreign [Music] there is plenty of enthusiasm to be cherished inside the cabin of the Hyundai venue Inland and that is down to the enhancements that Hyundai has made in addition to that 20th exhaust that adds to the oral effect inside the cabin now bear in mind the Hyundai when you end line it has the same engine and power output as the venue turbo which means the one liter three cylinder turbocharged engine puts out 120 horses and 172 newton meters of torque and since far to the front wheels via a seven speed DCT but look Slappy paddles one thing that you need to make sure is that this drive mode is selected to sport you have three modes Eco normal and Sport selected to sport because that it just sharpens the throttle response a lot better and it also just splashes red on the instrument cluster and that it does entice you it does egg you to drive this a little faster a little harder [Music] [Applause] [Music] you've got a suspension setup that's former by about 30 percent and slightly heavier steering setup it doesn't feel a whole lot different in the city but I really love the way that it weighs as you gather speed when you're hot on the heels of a brezza you will be enjoying yourself in here these changes make it a better Handler body roll is well contained and the steering although still very artificial and disconnected allows for better control enthusiastic drivers will certainly love the paddle shifters behind the steering wheel all of this combined brings out an experience far more Superior than the standard venue [Music] it is quite an enjoyable experience driving the Hyundai venue inline but I'll tell you what Hyundai has made no changes to this DCd transmission which means that the shift speeds are exactly like the venue turbo now I wish Hyundai would have made a few changes because that would definitely have helped shave a few seconds of the 0-200 Sprint and thus helped you earn a few bragging rights when you're talking about this SUV to your mates but possibly in the near future that would also have meant that you incur a few expensive wills and US Indians well we don't like that I mean we don't appreciate such things do we so Hyundai well they've made a very logical decision in keeping the transmission the way it is and I'll tell you what if you're not demanding too much of this SUV it performs just fine in fact it's adequate for most of the Indians out there it's quite fun to be honest it's not just the driving experience that rules you away it's also got the looks based on the face lifted venue the end line adds plenty Drama by introducing a detailed dark chrome grill and lots of red accents on the bumper cladding and roof rails there are also red calipers from Factory so you don't spray paint them yourself now all of the drama from the outside is carried forward on the inside as well with pizza driver and the occupants well they are greeted to an all-black cabin with lots of red splashed around the seats well they get a checkered flag with the end logo and it just adds to the sportiness of This SUV lots of red stitching and red piping on the seats this gear knob with the end branding is quite nice a three spoke steering wheel again quite nice everything is just so easily accessible from where I am seated it just is a very joyous experience [Music] [Applause] if you're family or even your wife try and keep you away from this toy well here's a little advice on how you can keep them convinced you point there at those rear discs because they really add to the stopping power of the Hyundai when you end line and if they are still not convinced you can point up here this is a dual cam dash cam that comes installed with the Hyundai when you online please although sporty the venue and line is a shade smaller than some SUVs of this segment and that does limit the space on offer especially for the rear occupants but these facts are made evident by its Dimensions but what isn't is just how well packaged this SUV is in terms of features although it misses on ventilated seats and a 360 degree camera everything else derives great thriving pleasure so is it worth 13 big ones with features like an 8 inch touchscreen with Apple carplay and Android auto connected card Tech ambient lighting powered driver's seat integrated air purifier and a digital instrument cluster over and above the upgrades that enhance its Driving Experience and looks even further well the venue inline in my books takes the crown of being the best all-rounder in this segment in fact it offers even more I don't know",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@AnuragPrashant",
            "text": "Worst vehicle framework from hyundai if you are sporty person and love to do high speeds on highways. I have seen 2 accidents on Highways and one on the city roads where venue got flipped upside down like a cockroach. Not sure about the build quality but it can get easily roll over on the curves.",
            "likeCount": 1,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@fitterniti",
            "text": "Do manufacturers really think that the general public of India is that fricking GULLIBLE? You niche reviewers should really start pointing out these shady marketing gimmicks as well. You have the platform to actually push change but naw. 🙄 They only use the N tag to make us think there's performance changes and better package while it's technically a paint job 😑 NOTHING to do with Nurburgring",
            "likeCount": 7,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "nsF3RUNM9Ns",
        "title": "The ₹7.89 Lakh Venue is Here!",
        "description": "Hyundai has given the 2025 Venue a BIG update. More space, more features and a more comprehensive powertrain lineup too. Karan Singh heads to Delhi to give you an in-depth look at everything that’s new on the new Venue, including looks, cabin space, features and the all-important exhaust note.\n\n#PowerDrift #PDArmy #HyundaiVenue #Venue2025 \n\nJoin the 3 Million strong #PDArmy: http://bit.ly/PDARMY\nMerch Drop: http://www.powerdrift.com/merch\nListen to the #PowerDriftPlaylist: https://spoti.fi/3Ny2uVr\n\nFollow us on: \nInstagram: https://www.instagram.com/powerdrift/\nFacebook: http://facebook.com/POWERDRIFTOFFICIAL/\nTwitter: https://twitter.com/powerdrift\nWhatsApp: https://whatsapp.com/channel/0029VamrxqfL7UVRtRwR9F3N\nThreads: https://www.threads.net/@powerdrift\nJosh: https://bit.ly/3O8Y6fJ",
        "channelTitle": "PowerDrift",
        "publishedAt": "2025-11-04T08:30:34Z",
        "viewCount": "51942",
        "transcript": "[Music] Ladies and gentlemen, welcome to Power Drift. Welcome to New Delhi. And while there might not be too much new about Delhi, there is a whole lot new on the new Hyundai Venue. It's bigger, it's taller, it's wider, it's got a whole lot more features on the inside, and we'll walk you through everything that's changed. Now, the variant we have with us today is the Nline, the sportier variant of the Venue, but a lot of the changes here are the same as the one on the standard Venue. So, it starts with a face where you have this massive light bar going all across the front. It's actually quite a thick cladding whereas the light bar is pretty slim and it makes this angle and comes down onto the new headlamps which are a big unit at the bottom. To me, this reminds me a bit of the XCV 9E more than a Hyundai brand language. Yeah, sure there's a little bit of the Creta in here, but it definitely looks a lot more imposing than the previous or the outgoing venue. On the endline, you have a sharper bumper. So, you have these slats going across here. Some red detailing in the front as well. These are functional air vents here. It's an air curtain to sort of smoothen out the air flow. And you have some sculpts on the bonnet as well, and a nice flat Hyundai logo. Overall, on the front, it's definitely got a lot more presence than the standard Venue. To me, it looks a bit overstyled in some places. But speaking of styling, let's move on to the side where you have these far more pronounced wheel arch hunches on the Venue. We had it on the previous gen Venue as well, but these are a lot more pronounced and do take some cues from the Tucson and the Xter as well. Now, on the standard car, this bit is plastic and is like cladding, but on the Nline, it's body colored. You have this silver garnish here, and you have your red striping going all across the side as well. and some sportier skirts as well. I like the inline rims. They look really nice. Again, at the back here, very pronounced hunches all across here. Especially from the rear 34, you can really get a sense of how much they've flared these arches. Up to you whether you like it or not. I'm personally not a big fan of it. But again, on the standard car, you get all of this in plastic. So, there's a lot of plastic cladding happening on the standard car. And this brings us onto the rear, which is actually my favorite part of the new Venue. It looks really very very nice. You have a single light bar going all across the back and your brake lights and your, you know, your parking lights are here. I think it looks very, very nice. On this endline here, mimicking the stuff on the front, you have these slats on the bumper and nice dual exhaust tips. I think it looks very, very nice. We've seen this on inline cars before. I think it looks fantastic. And if you're getting a Venue, I would definitely suggest getting the Nline. You also have this new panel here with the Venue lettering here. and a new rear quarter glass as well because yes, this is a little bit longer than the outgoing Venue. The extension in the wheelbase is 20 mm and that's the important bit. This remains a sub for me SUV, but extension in the wheelbase gives you more space on the interior and that's exactly where we'll head next. So, we'll start with the rear seat and there is a decent amount of space here. Thigh support is good. It's definitely not up to the mark of something like a Kia Siros, which is what you might think. So, when I first heard that the Venue is getting bigger, I thought they'll go straight up with the SIOS size. It's not the Siros size if you're wondering, but it's still fairly comfortable. The front seats are scooped out a little bit as well. You get AC vents in the back here and two type-C ports. You also have an armrest here with cup holders. It's actually a really comfortable place to be. You also have sun shades that you can put up really nice quality sun shades. And this rear seat also has a twostep recline. So right now it's in the most reclined position, but you can uh if I could figure it out. Yeah. Okay. This is the less reclined position. So this, as you can see, it's not a huge difference, but it definitely adds to the comfort. So this is normal position, and I lift it up and put it back. And now it's in the reclined position. Really nice. Uh you also have a headrest in the middle. No, you don't have a headrest in the middle. So only two headrests in the back. But of course, threepoint seat belts and all of that good stuff. And now we can move on to the front seat. Okay. So now the interior is again a big step up for Hyundai in terms of the Venue N9. Firstly, you have two 12.3 in displays. These are actually bigger than the ones on the Greta. So really very very impressive. And the UI is super super smooth. Like it's very very fluid and very easy and nice to use. As you can see, like the main screen has all these nice large buttons for all the stuff you're going to use very often. I really like the way they've done the UI. I also like the fact that they've given you physical controls. Big screens does not mean you take away physical controls. You have physical controls for your air conditioning, for pretty much everything else that you would want physical controls for. And then you have your steering wheel, which is different on this endline. I think it looks really nice this stuff. So, you have your drive modes here and your traction modes here and it's very AMG Porsche like steering wheel. I think it's very very nice and very sporty and nice and chunky to hold with the inline. We've always like the steerings they've done and I think this is one of the best. I it look it looks and feels really very very nice. Again, lots of physical controls here. None of that touch sensitive stuff happening. So, this is for your cruise control and this is for your media controls and you have paddle shifters at the back as well. Okay. Now, Nline versus the normal car. The Nline has a black interior with a bit of red going on, uh, red piping here as well, and a Nline specific gear selector. On the standard car, you have a blue and cream interior. So, I personally prefer this all black theme, but if you get the standard car, you will get a slightly more unique interior color. Down here, you have two type-C ports. You have a wireless charging pad as well. And you can also press this button to turn this port from just charging to connecting to USB. I think it's very convenient. You might be confused as to why they would give you that option, but if you're using wireless CarPlay and you just want to charge a few devices and not bother with having another device come in the middle of the way and connect, I think it's really nice. Uh very well done. New key as well, so it's eggshaped. Uh looks interesting for sure. uh lock, unlock, and your hold to start. Personally, not a big fan of this key. It's plasticky and very light, but looks interesting. Maybe a talking point for later. One more thing on the steering wheel. Right now, you have the N logo. On the standard car, you do not have a Hyundai logo. You have the four dots, which are the Hyundai H in Morse code. Speaking of the Hyundai H, they also say they've done these vertical slats of the AC and this center strip going across as an H pattern. Uh, sure. I guess I mean designers can say some stuff. Anyways, you have a sunroof here as well on the top. No panoramic sunroof, but you have a nice sunroof that you can have sun shade on top. And yeah, that's pretty much it. Plastic quality is okay. Pretty much similar to what we've had in the previous venue. On this car, it looks a bit black and maybe a little bit plain jane, but it's actually really nice quality. I like the way they finished this part as well. I'm just scared it might get scratched up. Uh but yeah, automatic parking brake, ventilated seats, and all of that good stuff. Now, let's just get out and speak about varants and pricing. Okay, so in terms of engine options on the standard venue, you have a regular naturally aspirated petrol, which makes about 80 horsepower, perfect for city driving. You also have a diesel engine, which is available with both a manual and an automatic now. And you also have the turbo petrol with 120 horsepower, which again gets a manual and a 7-speed DCT. On the endline, you only have the turbo petrol again with the option of a DCT or a manual transmission. So very comprehensive range of engine options. They've also rejig the names of their variants. So it goes from H2, H3, H4. It's basically H instead of having the sports and the ATA and stuff like that. So slightly easier to remember. The Nline variants are still the same. So N6, N8, and N10. And that's about it. It's uh right now 9:45 a.m. and we're going to get to know the prices at about 2:00 p.m. today, which is about when you're going to be watching this video. We'll put the prices in the comment section, but expect it to be pretty similar in terms of pricing to the outgoing venue. It's a very competitive segment. They can't really outpric or you know go up on price in terms of in in comparison to their rivals. So expect it to be similar in terms of pricing. Maybe the top end variants will be about 50, 60, 70,000, maybe a lack of rupees more expensive, but that's about it. And before we end, let me show you what the Nline sounds like. [Music]",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@tejasprasadrao9975",
            "text": "Yo these auto journalists need to get a hold of themselves. Unless you pay close to 14 lakhs for the HX8 variant, you're really not getting any good features with the car. Any variant under HX8 has a sub par feature set and not worth the price at all. Better to get a Sonet or even a Seltos at 18lakhs if you're considering getting the top variant of Venue.",
            "likeCount": 2,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "sHlHRRl3H7I",
        "title": "New Hyundai Venue Facelift - What’s NEW? | First Look | PowerDrift",
        "description": "The new Hyundai Venue facelift gets a whole lot of exterior and interior styling updates. However, the engine options are the same as before. Now it gets a new fascia, a new rear, new cabin colours, some new bells and whistles, and then some more. But all of that has brought in a price bump. The 2022 Hyundai Venue facelift is now priced from Rs 7.53 lakh (ex-showroom). Here's Cyrus Dhabhar with a first look walkaround of the new Venue.\n\n#PowerDrift \nMerch Drop : HTTP://www.powerdrift.com/merch\nJoin the 2 Million strong #PDArmy : http://bit.ly/PDARMY\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/powerdrift",
        "channelTitle": "PowerDrift",
        "publishedAt": "2022-06-17T05:59:31Z",
        "viewCount": "333879",
        "transcript": "[Music] welcome ladies and gentlemen to a new video on powerdrift and with us a new suv a new car well it's not really new new it's face lifted new this is of course the new facelift hyundai venue but this video is also the start of what i'm going to call the june jumble because if you're a car person and you like your car content on the powerdrift channel there is just so much stuff coming at you this of course is the first look video there's going to be a drive video soon and then there'll be more cars scorpio the new brezza which is going to be arrival to the facelift menu they've just about launched it before the brezza a few days before the brezza good timing yoondae and then of course it's gonna be the toyota suv but today we're gonna talk about the face lifted venue [Music] now they've done it so really well and that's what yoon day really does well face lifts that's something like a speciality for young guy what they done basically made the car a lot more muscular a lot more sort of squared off and people are going to like this design a lot more than the previous one because the previous design was a little bit of a love it or hate it sort of thing some people didn't like it some people did i thought it was quite a nice looking car this one though i think is more generally palatable what have they done obvious changes of course are the big is the big grill which is a little bit chunky a little bit more chrome a little bit well better embellishments on it and of course it's got that dark chrome treatment that we've seen on the alcazar as well but if you like your bright chrome stuff you can always go to your neighborhood accessories charger and put that big grill on this or change the wheel don't do that though this does look nice and premium you also have a lot of um squared off pits that actually remind me of the ionic 5 for some reason which is the ev that's going to be coming later this year and then of course you've got a different set of wheels but the big change the one that i really like is actually at the rear [Music] okay now before you guys go to the comment section and say that you and i has copied vw with their design language yes even the united guys made a bit of a joke about it okay the tygon and the venue have sort of this similar brake light thing that's happening here all the tail lighting that's happening it's like connected tail light and i in fact really like the way this looks we saw this about six or seven years ago on a lot of american cars and i really really dig that design language i think a lot more light at the back of course is a nicer safer thing as well because the car becomes a little bit more visible but in general from what the older venue used to be which is a very plain gene design in the back as compared to the sort of nicely designed front i think this is a lot better designed at the back now it's not just the fact that the daylight itself is so large and extended there's also these little elements these little reflectors all the reverse lamp for the fog lamp down below or even these little elements in the taillight itself i think the undy design team has put in a lot more thought into making the venue a lot nicer incidentally with all these changes i think it also looks just a slight bit more muscular and slightly bigger than what it actually is that's the kind of stuff all the kind of tricks the design plays on your eyes [Music] [Applause] okay so we've seen the exterior changes and they are a little bit more substantial than what you get on the inside but the big change on the inside is actually this very light color palette that in fact a lot of manufacturers are quickly adopting we went from beige everywhere to a lot of black and now we've seen these sort of whitish stones and ivory tones everywhere and it makes the cabin look a lot airier which of course a couple raised these sunroofs really does help making a small car like this just a little bit more bearable just a little bit more airy less claustrophobic now of the big things are still the same so you still have the same screen already slightly better user interface etc but you do get this new all digital instrument cluster which is a big welcome change in the venue because that's something that the venue did lack and that's something a lot of people were actually asking about because after all people do just like their gimmicks and like their tech and like all these little bits and pieces that make it look all glitzy and glamoury in their normal family cars it makes people just feel a little bit more special [Music] other features include the fact that there's a new drive mode knob on the bottom here instead of the coin slot that used to be there on the earlier car and that's pretty much about it but there is a big change on the rear seat that i think we should definitely be talking about join me in the back now obviously there isn't going to be a lot more space in the back of these or any more space in the back of these as compared to the pre-facelift car because the car is inherently still the same but hyundai has added a feature one single feature that i think is my absolute favorite of everything that's been added to the updated venue and that is the fact the rear seats now recline well there are two slots so you can recline it in this is the most reclined or the most comfortable slot which means i can have a better nap in the back of one as compared to the preface lift car and then one can put up a picture on his instagram and laugh about it i think we're really milking this joke to death but honestly this is a lot more comfortable than what the pre-face lift venue was or even the normal seating position is which means people are just going to be more comfortable in the back of this of course we do have a little bit more headroom as well if you are recline a little bit back i think that's a good thing because at the end of the day even though this is a small soft 4 meter suv a lot of people do get chauffeur driven in one of these and having that slightly more comfortable back seat does help a lot of people now let's talk about the engines very briefly [Music] okay so in terms of engines there aren't really any changes you still get the 1.2 petrol which is the naturally aspirated version with the manual gearbox and then you get a 1.5 turbo diesel with again the manual gearbox no automatic there even now and there isn't one coming anytime soon and then you get the turbo petrol one liter with the imt or the clutchless manual gearbox which a lot of people seem to be buying actually strangely we didn't think the penetration of that gearbox would be as much as it is and then you get the dct or the automatic now the dct is a slightly updated version because the older dct the pre-facelift dct did have some issues with overheating and some gearboxes did seem to fail but mainly that was because of the people driving it because a lot of these buyers were first-time automatic buyers and they didn't really know the mannerisms of driving an automatic gearbox a lot of people did keep the car in drive mode when they came to halt in traffic with their foot on the brake that was a big no-no under has made some software and hardware changes and the gearbox is also now a little bit faster which makes it a big change because that gearbox was just a little tad bit slower as compared to what a dct should have been so there you have it all bunch of changes on the outside not too much under the skin some nice changes on the instrument cluster and just the interior as well but this is a much nicer looking car and that is something that people are going to appreciate right there you have it first look at the new hyundai venue kick starting a crazy month for us drive review coming very very soon sadly i'm not gonna be driving and i'm really upset that i'm not gonna be driving it because i'm really looking forward to driving this one whipple though is so stay tuned for that [Music] [Applause] [Music] you",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@pranavjs",
            "text": "I think tata should see these cars and should get an idea how to update things like infotainment system,meter consoles etc....blind tata fans will say that ha ha still 2 stars,no safety blah blah blah,but in this price point,if hyundai can do these,tata also can....if you and your friend buy similar priced cars,and from two brands,when urs look like aged years ago,you will feel the same....i am also a tata fan,who want to see their cars becoming better....",
            "likeCount": 1,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "2yQoROfQS2s",
        "title": "Kia Sonet X-Line vs Hyundai Venue N-Line: Which is Worth Your Money? | PowerDrift",
        "description": "Join us as we pit two Korean siblings -- the Kia Sonet X-Line and the Hyundai Venue N-Line. \n\nIn this comprehensive comparison, we dive deep into:\n- Exterior design and styling updates\n- Interior comfort and features\n- Performance and driving dynamics\n- Value for money and equipment levels\n\nWhich line comes out on top? The stealthy and sexy Sonet X-Line or the Matrix-inspired  Venue N-Line? We break down the pros and cons of each to help you decide which suits your style and needs better.\n\nWhether you're Team X-Line or Team N-Line, this comparison will give you all the information you need to make an informed decision.\n\n#PowerDrift #PDArmy #KiaSonet #HundaiVenueNLine \n\nVisit Now: https://shop.apollotyres.com/apterra-cross\n\nJoin the 2.8 Million strong #PDArmy: http://bit.ly/PDARMY\nMerch Drop: http://www.powerdrift.com/merch\nListen to the #PowerDriftPlaylist: https://spoti.fi/3Ny2uVr\n\nFollow us on: \nInstagram: https://www.instagram.com/powerdrift/\nFacebook: http://facebook.com/POWERDRIFTOFFICIAL/\nTwitter: https://twitter.com/powerdrift\nThreads: https://www.threads.net/@powerdrift\nJosh: https://bit.ly/3O8Y6fJ",
        "channelTitle": "PowerDrift",
        "publishedAt": "2024-08-27T14:21:02Z",
        "viewCount": "317021",
        "transcript": "tired. [Music] A line, a straight path between two points. However, not all lines are the same. For example, this is the end line, the Hyundai Venue end line. [Music] Spot sporty and loud. And this is the Xline, the Kia Sonnet Xline. Stealthy and sexy. But which one of these is better? Let's find out. [Music] Well, let's pretend this is a beauty pageant and start with looks. The Nline and Hyundai's lineup signifies cars that are slightly sportier versions of their already existing cars. Unlike the full fat N cars internationally, Nline, at least till now, don't get serious with mechanical changes over the regular cars. There's been three of them till now. the i20, this, the Creta most recently. What's common between those is that they're all very good-looking. There's exclusive colors on offer, including this bright blue paint, red accents, more aggressive spoilers and bumpers, different wheels, and that shotgun barreled muffler. The Sonnet might miss out on pedigree, but in the looks department, it surely gets a 10. It gets this nice black paint scheme, blacked out accents, and since this is based on the GT line of the Sonet, we get to see larger wheels, a tiny spoiler at the back, and a lot of standard equipment. [Music] The venue might scream go fast, but the sonnet looks way cooler. You see, the sonnet also got an update very recently, whereas the venue's last update was back in 2022. Yes, it got its fair share of updates recently. However, the has more or less remained the same and hence I say the Sonnet is a clear winner in the looks department. On the inside, the venue feels sporty. Black seats, red accents, ambient lighting, and the ends in the back rest does make the cabin look very premium. But these displays, even though all digital, feel kind of underwhelming. And then there's comfort. Front seats good, but here cramped and barely any leg room. [Music] But this feels top class. Black and green. This is the theme for the X. And then there's the quilting. I've already told you how premium this feels last time around. Oh, you haven't seen that? Click on that link up here and you'll know what I mean. The sonnet's interior is a great place to be in. Yes, it's not as sporty as the endline, but long hours in this will never be a problem for sure. And now that we told you all about both of them inside out, let's get to the good part, shall we? Do what you got to do when you got to do it. You know it's you and you got to prove it. Prove it to yourself. And while SUVs like these are great to drive while offering a lot more, a good pair of tires is crucial for them to enhance your drive experience. The Apollo Aera Cross offers great ride comfort, handling, braking, and superior mileage and durability. [Music] The inline stiffer suspension, better weighted steering surely make the driving experience a lot more involving. However, power is unchanged at 120 horsepower and 172 Newton m of torque. Well, it never needed more anyway. [Music] And the DCD updated, quick, and a lot of fun. Of course, both the cars are similar underneath the skin, and that means they're very similar to drive as well, but the X-line does not get the sporty suspension the Nline has to offer, and that means the ride is soft and plush. No, none of these cars are uncomfortable, but your passengers are going to be far more comfortable in this one. And even though both the cars share the same exact powertrain, the 1 liter turbo petrol powertrain with the same exact tune, the venue feels quicker. Yes, both cars come from the same extended family living out of South Korea. However, the premium sibling just feels like a superb package. The Venuan line, while it looks fast, gets a cool looking exhaust tread calipers and sporty insides. What it misses out on is ventilated seats and a 360° camera. [Music] The Sonnet comes in with all of this alongside a Ko of a diesel automatic. And even though the Sonnet is the more expensive one of this lot, it is a better package overall and would definitely be my pick. However, if you're an Enthu 2 and a half family who's okay with a petrol only, the Venue end line should be your pick. So, which team are you on? Team Xline or team Nline? Let me know in the comments because until next time, here's Glen Turn signing off. Cheers. [Music] [Music]",
        "transcriptKeyMoments": [],
        "comments": []
      },
      {
        "videoId": "PbgQLKk4HF4",
        "title": "2025 Hyundai Venue review - More is more | First Drive | Autocar India",
        "description": "The second-generation Hyundai Venue is a significant step up from its predecessor, but does it have what it takes to rule the crowded compact SUV segment? Gavin D’Souza drives it in Goa to find out.\n\nCameraperson - Harshad Panchal\nEditor - Sanil Sawardekar\n\nChapters - \n0:00 - Introduction  \n1:38 - Design styling\n5:30 - What's different on the N Line?\n7:34 - Boot space\n8:16 - Platform\n8:30 - Interior quality\n9:48 - Front seats\n10:40 - Storage spaces\n10:53 - Steering and buttons\n11:41 - Key\n12:00 - Digital dials and touchscreen \n13:35 - Features list\n13:53 - Safety, ADAS and crash test rating  \n14:41 - Rear seat space\n16:51 - Venue diesel-automatic review\n19:39 - Ride comfort\n20:20 - Handling\n20:47 - Brakes \n21:23 - N Line interior design\n22:27 - N line Turbo-DCT performance and exhaust note \n23:01 - Handling (N line)\n24:25 - 2025 Hyundai Venue price \n24:40 - Verdict \n\nSUBSCRIBE to Autocar India for the hottest automotive news and the most comprehensive reviews ► http://bit.ly/AutocarInd\n\nAutocar India is your one-stop source for test drive reviews & comparison tests of every new car and motorcycle launched in India. We also offer a great mix of other automotive content, including weekly news, motor show reports, travelogues and other special features. \n\nWebsite: http://www.autocarindia.com \nFacebook: http://www.facebook.com/autocarindiamag\nInstagram: https://www.instagram.com/autocar_india/\nTwitter: http://www.twitter.com/autocarindiamag\n\nNew car reviews ►http://bit.ly/ACI-NewCarReviews\n\nComparison tests ►http://bit.ly/ACI-Comparison\n\nNew bike reviews ►http://bit.ly/ACI-BikeReviews\n\nFeatures ►http://bit.ly/ACI-Features",
        "channelTitle": "Autocar India",
        "publishedAt": "2025-11-11T05:30:19Z",
        "viewCount": "294617",
        "transcript": "You know, it's not easy being a compact SUV. And all of them, this whole segment, has my deepest sympathies. I mean, everyone makes fun of them in the comments for just being hatchbacks on stilts. But that's not their fault. They want to be big, tough, spacious SUVs, but they're forced to live in this sub-4m length restriction. And as we'll see a little bit later, that really shows. And it's a similar story under the hood where they want to have big engines with loads of power and many cylinders, but they're forced by regulations to have tiny overboosted turbo-petrol engines or anaemic 1.2s. But more than anything else, it's the fact that they have to live in the shadow of their bigger, more desirable, more capable siblings, midsize SUVs. SUVs that are not restricted by length or by engine size. And worst of all, these days there's quite a bit of price overlap. So yeah, life isn't easy for a compact SUV, but it's harder still for the Hyundai Venue, because its bigger sibling is none other than the Hyundai Creta, one of the most prolific midsize SUVs out there. So yeah, it's got its work cut out for it, but against all odds, the Hyundai Venue has come back for a second generation, and it isn't pulling any punches. Now, tell me down in the comments what you think about the design and styling of the Hyundai Venue. And while you're down there, like, share, subscribe; you know the drill. Because, for me personally, I think I admire it, but I haven't got quite round to loving it just yet. The reason I admire it is because they've done a lot to get all this design and styling into this sub-4m package. And you can see that they've really, really tried to make it look big and tough. For instance, there's a lot of the bigger Hyundais you can see up here at the front. This light bar like the Creta and the Alcazar. Even these DRLs, and that's where the indicators are over there, similar to the bigger SUVs. This prominent slatted grille down here that looks very premium in this dark chrome glossy finish over there, and the brushed metal lower bumper area which does give it a lot of volume, especially with these vertical design elements down there. You come over to the side you'll see these two light elements. Those are the headlamps and this big L-shaped DRL which I think is a little bit overdone. And you see more of that as you go over to the side, because here is where it starts reminding me of the smaller sibling, the Exter. Yep, these pronounced wheel arches; they're really bulging, bursting at the seams. And it shows that this car is trying to break out of its sub-4m restriction. It's growing as wide as possible because it can't grow long. It's also got this prominent black cladding around the wheel arches and 16-inch diamond-cut alloy wheels on the standard Venue and they remind me a bit of the ones on the Creta Electric. I think they look very, very nice. Compared to the previous Venue, there's a lot more sculpture this time on the side of the bodywork. There's a familiar profile, a familiar window line as with all Hyundai SUVs. A very prominent roof rail that pops quite a bit high above the height of the car, but so much sculpture in the doors and this cladding down here that sort of cuts in lower down. It is muscular and yeah, it does make this car look nice and butch. Similarly blistered wheel arches over at the rear. But what's new is this quarter glass which we'll see does have a great effect on the inside. And this little contrast coloured applique over here with Venue written on it. It all adds up, it all looks very nice and it contributes to this car looking bigger than it actually is. It is actually bigger than the previous car and although the length remains the same, it is 30mm wider at 1,800mm, 48mm taller at 1,665mm and crucially, the wheelbase has grown by 20mm to 2520mm. Now, here at the rear, if you see a resemblance to the new Range Rover Sport, you're not wrong. But that just goes to show how much effort they've put into the rear end of this, a compact SUV, let me just remind you. Again, because of that length restriction, they're forced to have a very upright and square boot on these compact SUVs, but they've used a lot of effort and a lot of trickery to make this feel upmarket. Like this sort of 3D glass treatment over here. You see Venue, it's written behind the glass in three-dimensional lettering. And there's also full LED lighting that wraps around the car and runs across this band over here. Even the tailgate, it could have just been a flat piece of metal, but they sculpted it nicely over here, so it looks far more upmarket and premium. But my favorite detail is this bulky little diffuser-like area down here finished in brushed silver. It again has these vertical appliques in the design that give it a lot more volume. And you'll see down here - that's where the reverse lights are. Aur agar aap iss video ko Hindi mein dekhna pasand karoge, tune in to WhatCar? India. And now before we go ahead, a quick interlude to tell you a little bit about the Venue N Line and how its design differs from the standard Venue. And it's actually quite a lot. For a start, the grille has only two rows of slats rather than three. And they're of a slightly different design. There is of course an N Line badge down there. And the front bumper is entirely different. Gone is the big, bright, silver insert and in it a more organic and angular looking bumper. In fact, wherever you would have seen bright silver on the standard car, it's been replaced by a sort of dark silver colour. It's here on the bumpers. It's on the roof rails and in other places around the car. This being the N Line, of course, there is the little red striping and these gloss black inserts down here. Moving over to the side, the changes are even bigger. For one, this car rides on 17-inch wheels, not 16-inch wheels. And that's also made the car ride a little bit higher by about an inch. You'll notice that all the black cladding is gone, replaced instead by this dark grey strip. And I think that looks just a little bit classier. Down here, the black cladding has been taken off from the base of the car as well, replaced by body colour for the most part, and the black and red N Line treatment. And finally, you get body-coloured door handles as opposed to the black ones you get on the standard car. And here once again, the bright coloured silver applique has been replaced by a dark silver one. The similar treatment with the roof rails. And there's a nice red colored accent in the back of them as well. And finally, round the back where once again there are some key differences compared to the standard car. You get once again a more organic looking bumper down there with those dark gray inserts and gloss black. You also get these cool triangular striped reflectors in the bumper which I like quite a bit. And more than anything else, you get this amazing looking spoiler. I mean, just look at that. It looks like a rally car. And you're not going to mistake this for anything else if you come up behind it. Finally, the N Line badge over there and a pair of big exposed dual exhausts. Now, back to the standard car, and I'll tell you a little bit about the boot. At 375 litres, it's nothing to write home about and about standard for the class. It's got a pretty high loading lip, but that's necessary for crash protection and rigidity. And underneath here, you will luckily find a fulls-size spare tyre. This is a pretty standard size carry-on bag. And just for reference, that's what it looks like in the boot. You get an idea of how much more you can fit. And of course, if you need more room, the seats split fold 60:40. In case you're wondering, the new Venue is not based on the same platform as the outgoing car, but rather on the Hyundai Group's global 'K1 Enhanced' platform, which is also used by the Kia Syros. And the biggest benefits of that can be found when you step inside. Hyundai used to be the high water mark when it came to interior design and quality in pretty much every segment it was in, but of late, it hasn't been quite up there. And even something as recent as the latest Creta facelift has disappointed in terms of its design and its plastic quality and even some of its ergonomics, if I'm being completely honest. But now with the new venue, Hyundai is so back, I got to say. And where do I start? I mean, just look at this dashboard for a start. It's got this what Hyundai says is shaped like an H. That's a bit of a stretch, but it does look nice; motif down the centre. It's finished in what they call terrazzo texture. It's not a texture really. It's quite flat, but it looks like terrazzo, the sort of tile or flooring finish you might find in some old classy houses. There's more of that on the doors, which is nice. It's not textured over here either, but it does feel rich at least. But I wish they hadn't used it on the door handles and on the window switches because that's where you're going to make a lot of contact and that's going to get dirty really, really fast. You'll also notice on the outside AC vents, there's this nice anodised finish. It's not quite silver. It's not quite blue. It's a little bit bronze even. It changes colour with the light. And it just looks and feels so very rich. What else can we talk about? How about these seats? I really like the design of them. They look like modern, classy lounge chairs. I like the way they finished white on top and black below. Well, it's actually not black. Look very closely; you'll see it's a very, very dark dull blue. And that's again a nice bold choice. Well, back to the design. It looks like a nice armchair. It's got this neat Venue lettering on one side, just offset. Looks so classy. But I will say that lumbar support is a little bit excessive for me. And although I'm all right and fits me really well, I've seen larger passengers find this a little bit too small. Nikhil, who's just under 6 feet tall, his shoulder comes up to the headrest, which doesn't seem ideal. But anyway, they're comfy seats. They are ventilated, of course. And I think they're quite good on a long drive. There's plenty of storage spaces. There's a nice shelf here, a decent size glove box, big cup holders, a little cubby down here, a wireless charging tray down there, and even a very small cubby hole down here underneath the armrest. This steering wheel design also; I really, really like it. It's square, it's new. It's got the four dot Hyundai signature. That's H in morse code. It's a nicely designed steering, quite a thick rimmed steering wheel and lots of nice clickety physical controls on the steering wheel which I like. Speaking of which, physical controls galore here on the centre console for the AC and the basic shortcut keys for the infotainment system are also hard keys and I absolutely love it. There are illuminated USB-C ports lower down and around the new gear lever, you'll find the electronic parking brake switch, ventilated seat controls, and rotary dial for drive and traction modes, which have been lifted straight out of the Creta. In every aspect, it really seems Hyundai is learning from its past and in some cases even looking to the past. Even this key fob, I mean, turn it sideways and you'll see it is the Hyundai logo. And it does look a little bit 2003, but that's what I love about it. It's cool and quirky, it's innovative and we haven't seen this sort of stuff from Hyundai in a long time. So, I'm happy to see it's back. But design, quality, and ergonomics are one thing. The biggest promise of this new K1 Enhanced platform is something much bigger. Now, you know what the main event is. It is, of course, these two screens. A pair of 12.3-inch screens - touchscreen over there, and a digital driver's display in front of me. But the main deal here is that they are brand new hardware and brand new software, powered by Nvidia. Apart from being one of the biggest tech companies on the planet, it is also the company that makes the chips and the graphics card that power high-end PCs. And really, it truly shows the graphics here are just incredible. So slick, so responsive, so high resolution, and you really do feel like you're in a car from a segment above while you're sitting in front here. Now, Hyundai also tells us that the new Venue is its first SDV or software-defined vehicle. Now, what does that mean? Well, a whole lot more than you might think because what it means is that all the controllers of the car are software-defined. They can be updated over the air. So later on, this car can be future proofed to get more features and more capabilities further down the line, and it's not reliant on changing every bit of hardware every time and that's quite smart. And the biggest thing for a lot of people will be yes it's compatible with wireless Apple CarPlay and Android Auto this time around so you don't have to carry a cable around everywhere you go. And with that let's, take a quick look at some of the features and feature highlights on this new Venue. The Venue, like all Hyundais, was always well equipped, so there was very little to do with this new version, but that hasn't stopped them from trying. And new to the Venue are, of course, those dual 12.3-inch screens, which are even bigger than what you get in the Creta and Alcazar. New features borrowed from the Creta are rear window blinds, an 8-speaker Bose sound system, ventilated front seats, and a 360° camera system. And while the old Venue did get ADAS, it was only Level 1 autonomous and only camera based. This new version gets camera and radar based ADAS features allowing for Level 2 autonomy. And this brings new features like forward collision avoidance, adaptive cruise control, blind spot camera, and exclusive to the N Line version, rear cross traffic assist, and blind spot assist. And while the new Venue hasn't been crash tested yet, Hyundai says it uses a lot more high strength and ultra high strength steel in crucial places this time around. And of course, gets all that safety kit. Plus, its platform sibling, the Kia Syros, did score a five-star Bharat NCAP crash test rating. So, the signs are positive. And the improvements don't stop there. The back seat was always a Venue weakness, and I'm glad that they have gone to town to address it with this second generation. I mean, first things first, the space. This car is 20mm longer in the wheelbase than the previous car. It doesn't sound like a whole lot, but it really has worked wonders. I'm just under 5'8\", that's set to my driving position, and just have a look at how much knee room I have. You can also take a gander as to how much you will have if you're a little bit taller than I am. There's also plenty of space to tuck your entire feet under the front seat, so you're not short of foot room over there. And it's even scooped out down here to give you more knee room. When you lean back, you'll notice that there's quite a bit of headroom. This is a compact SUV, remember. And they've really alleviated a greater sense of space by giving you this quarter glass back here that lets in a whole lot of light. It's made a big difference. Of course, another difference is that this car now has lighter upholstery. It's not quite the same in the N Line, which is all black, but it all comes together just a little bit to give you that greater sense of space. As for seat comfort, it is very, very generously cushioned. In fact, like in the front, there seems to be a bit of an excess of lumbar support, but if that's something you like, then that works out well for you. Thigh support is not great. I wish this squab was just a touch longer, but you also do get a two-stage recline function that could sort out comfort for a lot of people. There are adjustable headrests here, but not one in the centre. And there's a flip- down armrest with cup holders in it. You also get AC vents, although in my usage today, they didn't blow a very strong current of air out the back and really it's not as effective as the front AC. And there are a pair of USB type-C ports down there. Now, a lot of people will complain that it doesn't have a panoramic sunroof like some of its rivals now do, but I personally think that's okay in a compact SUV. Once you go to a larger SUV, that starts to be a requirement or an expectation. But in this car, I think it's okay. And I think it's helped scoop out this bit of the rear roof to give you that little bit more headroom. Time to head out onto the road with the new venue. And the first order of the day is to try out the new addition to its powertrain lineup, the 1.5 diesel with the 6-speed automatic gearbox. This 6-speed automatic is really the best gearbox for this diesel engine. Don't get me wrong, the manual is good. We've experienced it in a number of Hyundais, including the last Venue before, but this is not the most exciting engine. It is nice and relaxed with lazy torque, and it's perfectly suited to a torque converter automatic like this. The numbers are good for a compact SUV and the same as what you'll find in the Creta and a number of Kias. 116 horsepower and 250Nm of torque But don't let those figures fool you into thinking this is a punchy powertrain. Smooth is the name of the game over here. And sure enough, when you're cruising in Normal mode or even in Eco mode, this is where it feels at its absolute best. You'll want to use Sport mode if you're in a little bit of a hurry because that's the only time where the responses feel really, really responsive and at certain times even Normal won't suffice. You will get frustrated by the amount of time it takes to get going. Now, speaking of which that sort of lazy, drone-like feel at low revs that you get in Normal mode that also exposes you to a lot of the noise this engine makes. This is a diesel after all. You're going to have to put up with that. That's one of the downsides of a diesel in general. An",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@ashwinkumar2244",
            "text": "I've a venue petrol AT since 2019. TURBO Charged, cruise control, driving experience, service support are all great. \n\nOnly 2 cons:\nI hear a bit of cracking kind of engine noise while driving at v low speed around 10 kmph which i don't like. And the suspensions are a bit stiff, throws you up everytime you cross a step road hump.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@debajyotidev3312",
            "text": "What 95% Middle class people want, who love to drive.  \r\n1. Moderate Engine. (Turbo/1.5 NA)\r\n2. Moderate/Good Milage.\r\n3. Manual/Auto smooth gear box\r\n4. 4+ star safety.\r\n5. Good Suspension. \r\n6. 16+ Alloy wheel. \r\n7. Telescope steering \r\n===\r\n1. Good Entertainment and Instrument cluster \r\n2. Rear wiper\r\n3. Agronomic seat, Rear Hand rest\r\n4. Hill assist.\r\n5. Good Ac, \r\n6. Tire pressure. \r\n7. Connected light (trending)\r\n==\r\n1. After sell, Hospitality not harassment.  \r\n\r\nMore than anything is burden, complicated Motherboard cost u 40K. Moonroof good for Finland not India. ADAS good who have 1 one hand. Auto stop ruin Battery. Smartphone connected car can hack ur car. electronic seat adjust, peaople dont do everyday, \r\n\r\nin that way only HX8 is acceptable, But 1T engine, with 5 people u need to drive at 4000Rpm. that give 10kmph. \r\n@Hyundai India should listen to Public. And this time defiantly NOT competitive Pricing,",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@bakuljavadekar6767",
            "text": "Like Syros, with which it shares its platform, this car is bigger and therefore would be heavier. 1.2 litre petrol might feel underpowered while both 1.2 and 1.0 litre turbo will be less fuel efficient just like Syros. \n   Secondly I am not sure I like the design of the front. The bumper/scruff plate assembly looks too big for the size of the car. \n   Thirdly interior is fantastic but the turbo version is available only with N line which has all black interior which robs it of its charm somewhat.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@hyperion07e",
            "text": "I just went and saw the Venue today. If you have multiple 6 footers in ur family(there are 3 in mine😬), skip this car. Set to my driving position, I had maybe an inch of knee room at the rear. But I couldn't extend my leg at all. You can't tuck in your leg under the front passenger seat if you're tall",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          },
          {
            "author": "@user-pm4pl5hh9m",
            "text": "My peeve: to make them look like SUVs, OEMs are giving the front a boxy, bulky, design which I don't much care for. I can accept a tall boy boxy look in the mid-section (eg: Syros) but not the boxy front. Honda used to make very sleek fronts for their cars but, sadly, have started imitating the others.",
            "likeCount": 0,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      },
      {
        "videoId": "5Wo0pBSa0mg",
        "title": "Ahead of its official debut, the Hyundai Venue facelift has been spotted testing. Your expectations?",
        "description": "",
        "channelTitle": "PowerDrift",
        "publishedAt": "2025-08-18T09:23:32Z",
        "viewCount": "217329",
        "transcript": null,
        "transcriptKeyMoments": [],
        "comments": []
      },
      {
        "videoId": "dNtLRmUtYHU",
        "title": "2026 Hyundai Venue Review – 1.0 Turbo Manual: Everything You Asked For, And More!",
        "description": "The new-gen Hyundai Venue is finally here, and we have driven it. It looks great, feels bigger, and offers a host of new features & tech as well. But does it still offer the best value as well? Watch this video to find out.\n\nTIMESTAMPS\n00:00 - Introduction \n00:14 - Engine & Performance \n03:47 - Ride & Handling \n05:32 - Safety & ADAS\n06:46 - Design & Size\n09:39 - Cabin & Features \n14:34 - Price & Verdict\n\n\nMORE FROM C&B:\n\nFor more from the world of auto, visit our WEBSITES: \nENGLISH: www.carandbike.com\nHINDI: www.hindi.carandbike.com\n\nSubscribe to car&bike YOUTUBE Channels for your daily dose of Auto: \nENGLISH - www.youtube.com/@carandbike\nHINDI - www.youtube.com/@carandbikeHindi\n\nFollow car&bike on INSTAGRAM:\nENGLISH - www.instagram.com/carandbike\nHINDI - www.instagram.com/cnbraftaar\n\nFollow car&bike on FACEBOOK: \nENGLISH: www.facebook.com/carandbike\nHINDI: www.facebook.com/carandbikeHindi\n \nFollow car&bike on TWITTER: \nwww.twitter.com/carandbike",
        "channelTitle": "carandbike",
        "publishedAt": "2025-11-11T05:30:32Z",
        "viewCount": "14368",
        "transcript": "[Music] Hello viewers welcome to car&amp;bike. I am Seshan Vijayraghvan and today I am in Goa to drive one of your favorite cars. Because even when everyone knew that a new-generation model was coming this month, last month the company sold 10,000 units... close to 10,000 units of this vehicle. Yes, I am talking about the new Hyundai Venue. Now you must have seen our first look video of the new Venue and if you haven't, do check it out on car&amp;bike's YouTube channel and in this video, I will be covering everything about this SUV in more detail be it the features, be it how is it to drive, and more specifically how is the performance. But before I do that if you are new to the channel do subscribe to car&amp;bike, and while you are at it hit that bell notification as well so you never miss an update from us. [Music] Now I would like to start with how the car is behind the wheel because that is one of the big USBs of the Venue and today I am driving the one-litre turbo petrol version with a six-speed manual gearbox. Now yes you had this combination with the Venue always and in fact the other two engines are also same, which is the 1.2-litre naturally aspirated petrol which comes with the manual gearbox as standard, and then you have the diesel option which is one of the most frugal options you will get in this segment the 1.5-litre diesel and along with the six-speed manual, now Hyundai is also offering a six-speed automatic variant. Now yes we couldn't get our hands on the car today but we will try to do a proper review of that later on, so stick on to the channel keep following us let's get on to how this car performs. Now this is a very familiar engine. In fact, we have seen this motor in a lot of other subcompact vehicles from Hyundai and Kia families including the Sonet, the Syros. And talking about Syros that is the highlight over here because now the new Venue is based on the same K1 platform as the Syros so yes, there are platform level changes. There is more to it, but we'll get on to that later. As for the engine itself, no change in performance or figures. You still get about 118 bhp and 172* Nm of peak torque. There is a six-speed manual gearbox on offer there's also a seven-speed DCT but I feel that if you are looking for a driver's car, and you are considering the Venue, the six-speed manual is the best option because it is slick the shifts are nice and smooth and it offers you a lot of fun while you are driving. Now we are familiar with this three-cylinder engine it is peppy it is punchy and it offers a lot of fun while you're driving. There is a lot of torque in the low end and which is why there's not much of a turbo lag when you're driving it and that is one of the big highlights of this motor and also the power delivery is good. The ratios are nicely set so I have never had a complaint with this engine and transmission setup and that continues to remain unchanged and that is a big plus for me. Now coming to the Venue's on-road mannerisms I was looking forward to drive this SUV mainly because it is based on the new K1 platform and the other car that we have in this segment that uses the same architecture is the Kia Syros, and the ride comfort and ride quality was one of its big weaknesses. But I cannot say the same for the Venue over here because Hyundai has done a better job at tuning the suspension. The ride feels a bit more planted over here, it feels stable. One of the problems that I had with the Syros was, at lower speeds the suspension was a bit stiff, whereas at higher speeds it was bouncy but Venue at low speeds, it feels quite plush you do not feel much of discomfort inside the car and even at higher speeds, it feels a bit more stable, it feels a bit more planted and that is something that imparts more confidence especially when you're doing triple digits speeds on the highway you want that little bit of confidence from your car, and the Venue offers that. Now the handling too feels like it has improved. It has a nice stability to it while you're doing high speeds or while you're taking a corner. And that is a good thing, and I also like how the steering feel is. Unlike previous Hyundai cars which had a light steering wheel this has a nice heft to it. It feels more sturdy, it feels more confident and that is something I like. That has made the cars feel even sportier and especially with that turbo petrol engine and the gearbox and the steering feel, I this is quite a nice package if you are looking for a proper driver's car. And now we come to the safety aspect of the car. With the new generation the Venue gets Level 2 ADAS functions, and with that a bunch of additional features which prominently includes the forward collision avoidance assist and rear cross traffic avoidance assist both these are very important. You get them now, with that you have 360 degree view camera as well on the top of the line model and a bunch of additional features that you will see on your screen right now. However Level 2 ADAS is only for the top end HX10 and N10 variants the one with me is the HX8 a step below but still packs a serious safety kit including a rear camera. Standard offerings include six airbags ABS with EBD, front disc brakes, ESC with vehicle stability management, and hill start assist. Hyundai also offers three point seat belts for all with front pretensioners, ISOFIX child sheet mounts, and an emergency stop signal speed sensing door locks, impact sensing door unlock, and rear parking sensors are also standard. Now visually, the venue does appear to be bigger and in fact the numbers do support this claim because it is now taller, it is wider, it has a longer wheelbase as well that translates to better cabin space but I'll get to that in a minute. So overall length hasn't changed because it is still a sub 4m but that huge big look that you get over here is thanks to its styling which is now similar to the Creta and in fact, you will see the face is very much identical to the bigger sibling that includes this connected LED DRL that has this nice sharp ending towards both end, and you have these horizontal LED headlamps and as well which has a nice futuristic design. The lower variants will get project headlamps but I feel these have a better premium look. The grille also looks nice. This gets this dark chrome treatment, on the lower models you will get black treatment and the bumper is chunky you have this nice silver treatment and this black insert on either end. The N-line gets a different design. Overall new venue is more robust it looks chunky, it looks quite muscular, and that adds a bunch of extra muscle to the SUV. Now towards the sides you'll notice that you have 16-inch alloy wheels end line gets 17-inch, yes you now have a bigger size on the N-Line but as for the design I'm not a big fan of it. It has that aero design which we have essentially seen in electric vehicles you could have gone with a different design. The N-Line wheels are much nicer and you have this new colour as well. This is called Hazel Blue which is a new addition both for the Venue, as well as the venue N-Line, and here with this HX8 variant, we have this dual-tone treatment as well with roof rails, you get more dark chrome treatment for the door handles as well. Here on the D pillar there is a new insert which has the Venue lettering over here and as for the rear badging, this gets this 3D element which is under this glass surface that adds a bit of premiumness to it. We have seen this design in a lot of international models and we now have it on the venue as well and of course the connected led taillamps. The led tail lamps itself is standard across the range and then you have a rear wiper washer, this nice sporty looking spoiler as well. On the N-Line you get this two part design that looks much sportier and here on the bumper we have more chunky inserts with a faux skid plate and you have the reversing lights. Over here you have two lights and both of them light up, but I'm not too sure about the position of it I feel it is a bit too low and people might not see it while you're reversing. But what do you think about it let us know in the comments. As for the cabin, you get an all-new look over here and from the exterior if you had any inclination that this is the Venue, one look at the cabin and you'd know that this is not the old Venue at all. In fact, you get an all-new layout new dashboard with this multi-layer design and you have this nice H motive that has been made by this central insert and you have this nice stone effect that has been given to this, of course this is plastic, but you have this nice stone effect with the Venue Embossed over here and that looks much more premium in fact I would go as far as to say that the regular Venue's design is better compared to the N-Line. It looks much more premium and hides those imperfections much better like the plastic quality. This of course, you can hear, that it has this rattling sound> 'It's not solid,' that kind of feel is what you get but this design hides all those imperfections. Of course this is just the quality of the plastic that I'm talking about not the fit and finish, because that seems to be solid. You also have a nice set of storage spaces here, you have the wireless phone charger and you have another storage area over here with two type c USB ports there is another storage area right over here and a nice glove box which gets cooling function there is a central armrest as well with storage compartment and nice deep cup holders as well the interior itself gets this dual tone treatment which I think is one of the nicest interiors I've seen in this segment. You have this Venue lettering over here with perforation because you get ventilation function both for the driver as well as the co-driver then you have this nice wide dual screen display in fact one good thing is that the dual screen setup is standard across the variant lineup. Only that the top of the line model gets 12.3-inch displays, whereas the lower variants get a 10.25-inch display. Wireless Android Auto and Apple CarPlay is also standard. Yes you now have a Hyundai car which gets wireless connectivity even in the top of the line model so that is because of the new platform of course. You have this new steering wheel as well I particularly like this is one of my favorite bits of the new Venue it has a nice feel to it I spoke about it while I was driving the car and even the buttons the tactile buttons the toggle buttons they have a nice tactile feel to them. They have this nice premium plastic effect and the the leatherette material that is the wrapping is good and premium it feels solid and you do not have the Hyundai logo in fact you have the morse code for the lighter H, which is something that we have seen in Hyundai's electric and premium vehicles that has now been brought down to the Venue as well, and finally you do have a sunroof as well - no panoramic sunroof - but a proper regular size electric sunroof which is supported by voice command. Now this is something that you viewers had a lot of questions about. That is how has the rear seat experience of the Venue gotten better, and I finally have an answer. That extra bit of width and that longer wheelbase has given you better space at the rear. You can have three people sitting here abreast in slightly more convenience. You of course have that central armrest now with cup holders, you add that in the previous Venue as well, but this feels a bit more better in terms of usability and then you have rear ac vents, which of course are standard across the variant lineup so that's a good thing. You have two additional Type C USB ports over here so there are no Type A USB ports so, Hyundai has gone for this modern look and feature package. Underneath that you have the storage space to keep your device and this front seats back too has been scooped out so you have better room over here. In fact, now, I am 5.9 feet tall, and this seat is set to my driving position so you can see that I have enough room over here I am very comfortable and one more thing that adds to the comfort is now you get two-step recline function for this rear seat as well so you have this one section and then you can further push it down to get a more comfortable position of course that adds to the overall comfort level of the SUV now you also have this sun blind which has been one of my favorite features in Hyundai and Kia cars, in fact you finally get it from the mid-spec and above variants on the Venue and it's a very good feature I think that Hyundai could have offered it as standard fitment. Now prices for the new Hyundai Venue start from Rs. 7,90,000 and go up to Rs. 15,51,000 and when you consider all the updates that are on offer and the feature list for each of these variants, right from the base trim till the top of the line variant, the Venue has improved at all levels you get a familiar set of engines that everyone likes, and along with that Hyundai has added the convenience of a six-speed automatic for the diesel, which has opened up the Venue as an option for a lot more buyers overall I think that Hyundai has identified the shortcomings of the Venue and worked upon them to improve and give customers what they want and that is what we want brands to do, so yes if you are considering getting a subcompact SUV then the Venue is a solid choice and, I would definitely recommend you to consider it. Yes there are some misses as well mainly you do not get a panoramic sunfoor which is something that a lot of other cars in this segment are offering and that might deter a few buyers but I do not see that as a deal breaker and if you are looking for a solid subcompact SUV which is feature loaded, modern and full of tech then the Venue should definitely be at the top of your list. If you like this video, do give it a thumbs up and share it with your friends and we will be putting out more content on the Venue once we have it for a longer duration so keep watching this space for more and until then this is Seshan Vijayraghvan, signing off.",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@SujjuBabu",
            "text": "Is the hazel blue on n line same as this hazel blue? The dealer I talked to says it's different. Even in this video or feels different somehow. But the name is same. It's a bit confusing and not easily available to see at dealerships as well somehow...",
            "likeCount": 2,
            "publishedAt": "2026-01-15T09:49:08.901Z"
          }
        ]
      }
    ],
    "total_videos": 12,
    "total_comments": 33
  },
  "metadata": {
    "vehicle": "Hyundai Venue",
    "scrapedAt": "2026-01-15T09:49:08.952Z",
    "totalPosts": 12,
    "totalComments": 33,
    "sourcesUsed": [
      "YouTube"
    ]
  }
}