{
  "youtube": {
    "vehicle": "Maruti Swift",
    "videos": [
      {
        "videoId": "4YdT9KgbQKc",
        "title": "Maruti Suzuki Swift : Love at First Sight? : PowerDrift",
        "description": "If you were to see your high school crush again after 13 long years, would you fall in love once again? Ten Hut finds out! \n#PowerDrift  \nJoin the 1 Million strong #PDArmy : http://bit.ly/PDARMY\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nTee Shirts, Badges & More official merchandise : http://bit.do/PDMerch\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/PD_Official\nFollow us on Google+: https://plus.google.com/+powerdriftofficial",
        "channelTitle": "PowerDrift",
        "publishedAt": "2018-02-02T11:43:54Z",
        "viewCount": "646346",
        "transcript": "what's up folks before we begin let me tell you that we are here to declare the winner name of the second Apache ara 310 at the end of this video let's not forget the first winner of the patch there are three tents and the second winner is going to be at the end of the video now a lot of a feedback and suggestions in form of your soul talk videos was immensely helpful and it's gonna help us shape our content for 2018 for example a few of you said you wanted some more stories some more backstory to our reviews so the team did is put in some effort and created a dark depressing love story with the all new Maruti Suzuki Swift check the video out and at the end of it we shall see you with the winner announcement brace yourselves your high school crush always carefree when I first saw her I don't know what she was wearing favorite headphones listening to music Walkman in the hand that's seen you can never forget I can don't forget love at first sight that was long ago now times have changed and after all that has happened so have I the question that still stands though is if it would be love at first sight if I were to see her again today [Music] after 13 long years I don't necessarily fall in love with girls [Music] after 13 years he now looks like she loves wearing a lot of mascara around her headlamps tree all the jimang that she was at seems to avoid she's lost around 90 kilos for sure and honestly she hasn't looked this beautiful [Music] and then there are these expensive diamond-cut alloy [Music] so is the new Swift love at first sight there was once a time when I did that one time when she had agreed to sit by my side for a short drive buckle up your seat belt Dorothy got cancer [Music] I'm waiting on her [Music] when a few telling me hey we were young back then 18 years old Alton and scrawny boys didn't really need much space at the back to fit in the 13 years of gluttony beer and three belt holes later we the new Swift fitting the guys just like it did back in those old days come on guys for old times sake nobody home and unlike us the car had gained proportions at all the right places now longer wider and more species on the inside it made a perfect tools for a sort of car body which we are some become I say identity Nikita for the SCB as a community now I know she never showed up [Music] she speaks softly now it's just a quieter place to heal she's more matured has a better sense of safety clearly with the dual airbags ABS an EBD standard and after all these years perhaps because of the flat-bottom steering it just feels so nice to hold her in your hands again it's lost a bit of a playfulness age does that to ographers electronic power steering automatic transmission these are not old school terms but then it is in high school in all said and done today she is more responsible and even manages to save some money [Music] we now tell that she dates dancing lessons for the driver fair now is composed ride quality supple and high speed stability the new Swift is more fun it will be it's faster it's quieter it won't fool you it now takes two iPhone and city life even better now is perhaps then to ask the question and even answer it with love at first sight after everything that has happened many things have changed and so have I I don't necessarily fall in love with cars every day but here she is [Music] all right we really hope you liked what you saw it mounts the time for the winner's name announcement of these second appacha are our 310 and the good name of the winner is yes you're the man Venus does not bring this motorcycle because jazzier it's on the so top video but rather for its top that comes straight from the heart and because we raise you have been finding the time out to engage with our channel for years and years now you always make sure to drop a comment or a feedback on pretty much everything that we do and we really really appreciate that a big note of thank you to all you guys who participated in the contest but remember we go and better giveaways in the year 2018 so make sure you stay subscribe to our Channel make sure you give a thumbs up to the videos that you like and make sure you stay notified thanks a lot congratulations pH good for that good",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@Octane_Karnage",
            "text": "This video was an emotional rollercoaster for me. The Swift entered my family 6 years ago and to this day she never fails on her promises, unlike the high school crushes with bitter sweet memories! The front seat is occupied now, and its an amazing feeling going out for a cruise!",
            "likeCount": 0,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@vivekvardhan5",
            "text": "Since I don't like Maruti cars that much, specially swift2018, so I always skipped to see this video. Right now at this time when I had my best moment( France won its second world cup ) I was left to watch this video and had nothing to do with it, also i was watching all my best videos of tenhut reviews( ,ike Tata hexa, toyota fortuner, ford freestyle, and volkswagen Tiguan), so when I fished with my all tenhut review video I was left with this review alone, so finally I clicked this to watch.......and...BAMM..... I was speechless for a moment and freezed to think that what the f*#$% was that. Honestly speaking,  I have never seen this type of approach to review a car. Grand salute to Rohan. I genuinely believe that this man is a Tolstoy of car reviewer in every way. This is completely insane. Love you Tenhut. You are the man.",
            "likeCount": 1,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@sohamsensharma749",
            "text": "I've lost count of how many times I've watched this video just to relate Rohan sir's expressions and my very own feelings. This video is undoubtedly THE BEST AUTOMOTIVE REVIEW EVER! ♥️ Just makes me fall for the Swift all over again each time I watch this. Thank you #PowerDrift. ♥️",
            "likeCount": 13,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@adheipkarkal8840",
            "text": "Every time I hear there's a new car or bike release I always wait till you guys make a first impression/ comprehensive review of it..... cuz the work y'all do is just amazing and there's a reason for this being the best automotive channel in India !!!",
            "likeCount": 30,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@shutter_ninjaa",
            "text": "Oh my god!!!!! I can't believe! the other day Veeresh bhai and I was talking about his Himalayan upgrade (Because there was a crack on his mudguard; probably sound silly 😁) and see fate has this for him, a new bike! So happy for him and I came to know him for a quiet long now through a post of powerdrift! \n\nAnd about the video- I don't know is it the winter or the voice of Ten Hut that gave me goosebumps throughout the video 😀",
            "likeCount": 6,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@ravendraeflu",
            "text": "Watching this in 2020.. During quarantine! My goodness.. You guys are the rightful blend of engineering and humanities.. I just can't believe the level of conceptualization that went it to the making of this video.. Congrats to every mind that was behind it. A proud subscriber since 2016 :)",
            "likeCount": 4,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@riteshpandey8381",
            "text": "Can i ask you 1 thing, we love your work we big fan of pd, i don't wish to win anything bcoz m happy with the content but why no winner of anything is from North or from east india, every winner of your giveaway is from south india, why?  Although we are lacking in employment rates and every but this is something we support you by our heart. Why?",
            "likeCount": 6,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          }
        ]
      },
      {
        "videoId": "5Ma_U_jAWHI",
        "title": "New Maruti Swift Review - Still a REAL Maruti Suzuki Swift? | First Drive | PowerDrift",
        "description": "In this first drive review we answer questions like, does the new 2024 Maruti Suzuki Swift have what it takes to live up to the Swift name? Does Maruti Suzuki have another winner up its sleeve with the new 4th Gen Swift? We tell you all you need to know about the new Maruti Suzuki Swift facelift with prices starting from ₹6.49 lakh (ex-showroom). We talk about the Swift’s interiors, Swift’s exteriors, Swift’s design, the Swift’s engine, fuel economy, and a lot more. But mainly, we talk about if it still has that Swift soul!\n\n#PowerDrift #PDArmy #MarutiSuzukiSwift  \n\nJoin the 2.7 Million strong #PDArmy: http://bit.ly/PDARMY\nMerch Drop: http://www.powerdrift.com/merch\nListen to the #PowerDriftPlaylist: https://spoti.fi/3Ny2uVr\n\nFollow us on: \nInstagram: https://www.instagram.com/powerdrift/\nFacebook: http://facebook.com/POWERDRIFTOFFICIAL/\nTwitter: https://twitter.com/powerdrift\nThreads: https://www.threads.net/@powerdrift\nJosh: https://bit.ly/3O8Y6fJ",
        "channelTitle": "PowerDrift",
        "publishedAt": "2024-05-16T05:30:02Z",
        "viewCount": "192418",
        "transcript": "yeah there has never been a bad Swift that is a brave statement to make but think about it the first generation as Rohan very very famously once said it was love at first sight I still remember the first time I saw a picture of one I believe it was a newspaper or a magazine and I thought to myself that is a maruti I mean it had integrated infotainment it had climate control in a marui and it had that g13b engine which has Motorsport peligre what an absolute Revolution then the second generation it was swoopy it was curvy people loved it and I particularly remember driving the Swift zdi for the first time manual and I remember telling myself this is all the car I will ever need it drove absolutely brilliantly it blew my mind every time I drove one it made a massive smile on my face and gave me a massive you know what but again an evolution of that then you have the third generation and this this is a fan favorite because this democratized a lot of things it still looked like a swift shoot but it looked better better than ever before still having little bit of an Omar to the first gen but it had the best interior of the lot and it still drove fantastically and the automatics now finally were democratized they were cheaper they were more affordable and they were in various trims too again a massive Revolution so wait wait Revolution Evolution Revolution Evolution this is the fourth gen car and on the look of it it looks like the third generation car because sort of underneath it actually is but it is 15 mm longer and 10 mm lower than that but Underneath It All it sort of is but it does have a lot of updated design cues it's got a more distinct belt line now the rear doors have traditional handles once again and it now gets a clamshell Bonnet now all of this I am okay with in fact I'll go out on a Lim and say I actually like the way it looks and it looks much better in real life than it looks in pictures or look in this video but there is something that grinds my gears there's something that makes my blood boil there something which when I show you you will never ever unseen for the rest of your life this little bit here it doesn't line up the design is weird it doesn't line up with the rest of the design you will never unsee this ever it even has the same Wheel and Tire combination 15 in and 18565 R15 tires that's small small they should have at least given a set of 16 it would have just looked so much better do you guys want to know what it looks like on a set of 17s though do you do you watch this you see you see how much better it looks with big 17in wheels on it it just looks so much nicer and plus black and black it matches so much nicer but of course we can't really run the car with these wheels on a review so sadly back to stock and we're back to 15 but okay what you guys really want to know is how it drives right it drives like a whip team so clean g o d anything you it's got that Swift Soul every single Swift has it and very very few cars have that Soul it's a it's an intangible thing I can't explain it it's something something that makes you just drive it more and more you can't be a passenger in a swift you have to have to drive it every single Swift has had that property and this Swift has that property look at this look at the smile on my face I'm not even going downhill I'm going uphill some cars have this property the polo had this property this car has it oh yes the Swift Soul it's still there it's still there and that's a little shocking as we did not expect it that that's because 1.2 L has lost a cylinder it is now a three cylinder it is no longer a K12 but a z12 and three cylinders means fuzziness which it has it also means more engine noise which it also has but it also means that it Reves slower due to larger Pistons which it also does no no no no no no no this car should not be driving as well as it is it's got 10% less h SP it's got less St it's 20 kg heavier and it's tuned for fuel economy and yet with this engine both Peak power and Peak torque coming a little lower in the RAR range too it might D slower but it is still enjoyable especially when you really have fun with it Suzuki sure does know how to make a damn good internal combustion engine you know what it is it's the magic underneath it's that chassis it's still just so playful this platform is just so good even with those small wheels and puny tires this thing just is so much fun remember it's always always more fun to drive a slow car fast than to drive a fast car slow now this is notorious as a platform in terms of safety but they have promised improvements have been made and it does get six airbags of standard it as though is Miss as with every single maroti Suzuki designed and manufactured car you know it's such a breath of fresh air once in a while to drive something which isn't overwhelming you with a million features and million screens it's just concentrating on how good it is to drive this is that car look it handles well but it's still comfortable it's it's a Swift and that's never a bad thing it is however a bad thing if driving is not the only thing that you care about because at this price point there are how do we put it a few emissions there is no 360° camera or cool seats or sunroof or heads up display there is no digital instrument cluster either the 9in screen is great but the bezel is too big and looks old in an age where Sleek is in there is however this absolute familiarity though I mean the steering wheel feels exactly like I would expect to have in a Swift and there is a analog instrument cluster no digital there but there is no bezel on the right side on the speedometer and there is one on the left side on the rev counter what they ran out of bezels while they were assembling this it's driving my OCD up absolutely up the wall but that's not my biggest problem my biggest concern and problem in the Swift interior is while this does everything it can to please the masses and it does that really well when you're talking about a name plate as storied and as fun as the Swift the interior has to be interesting and this is nowhere near as interesting as what the last generation Swift got it's all grown up now you know it's about this time in the video where I could pull over to the side of the road and tell you how the leg space in the rear seats is decent what you would expect and how the boot is now 3 l smaller than before but it doesn't really matter whatever I say whatever we say whatever we put out in this video this review maybe doesn't really matter because a swift is a Swift and it's going to sell irrespective of how it is you know I'm feeling just a little bit philosophical right now because maruti has sold 3.2 million Swifts in India that's 32 lakh that's one in every four people in Mumbai could have one those numbers are staggering and I'm not even talking about the desire if you combine the two of those that's then it becomes the highest selling car in the country currently it's the second highest sold car in India and that is important important for maruti because the Swift it doesn't value value at the highest level for the Swift a little bit of fun is more important it doesn't take itself seriously it's almost like it's a car that everybody likes yes you might not like the way it looks now but just like with some other cars in recent times this too will grow on you and trust me when I say this it looks a million bucks literally in real real life it might not be rohan's love at first sight but it sure still has the DNA of a Swift",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@jararacain",
            "text": "Fantastic review, Cyrus! I must admit as a Gen 2 owner, initially I was disappointed when I read the specs. But we don't really drive the specs do we. \n\nI know the Gen 3 got similar hate when it was launched and I recently drove one and felt it wasn't bad at all! And if this one is still a Swift, it's going to be a hoot too. \n\nI don't think any other car in the Indian market democratised the joy of driving like the Swift. Sure there are, and will be better cars, but as an all round hatchback (driving experience, budget, low maintenance, mileage), few come close.",
            "likeCount": 6,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@kushalkuber3383",
            "text": "For the price that it is being offered at... It is expensive...the price hike doesn't seem justified when the engine has actually been downgraded interms of number of cylinders, power and refinement. 3 cylinder engines are generally more noisy as compared to 4 cylinders...so the price bracket in which it is offered seems absurd...it should have been atleast 70k cheaper for the base version. One more point i would like to bring up is the previous generation swifts brakes lacked byte and feedback...hope they have fixed it. Also i think if any person needs 360 degree camera for such a small sized car then their driving skills are a big question... But i agree with cyrus that at this price these features should have been offered. I think they should have introduced the 1 litre booster jet in this.. Then it would have been a different animal altogether.",
            "likeCount": 10,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          },
          {
            "author": "@Candid_square11",
            "text": "I don't believe PD didn't even able to arrange a good-looking 2nd gen swift.. I would hav never used such bad conditioned car when all other looks better.. PD  Cyrus is always great but you need to atleast Run a adv online for review unit.. anyone can give u there car for review.. So.many loves you !! Plz PD.",
            "likeCount": 11,
            "publishedAt": "2026-01-16T04:56:47.719Z"
          }
        ]
      },
      {
        "videoId": "QKW5LTciKJI",
        "title": "2021 Maruti Swift | First Drive Review | PowerDrift",
        "description": "It’s not every other day that India’s best selling car gets updated, so when the 2021 Maruti Suzuki Swift came along, we decided to take a look at its top 5 improvements, ranging from a refreshed front grille to a slightly massaged engine that now makes more power. As Rohan talks about these important updates, Ayan tries hard to make a compelling argument, but he always seems to be in a hurry, which isn’t surprising because he’s driving the new Volkswagen Polo GT TSI.\n\nYou can choose IDBI Bank Car Loans to buy a more premium car. Get a car loan for a longer tenure and return it with easy EMIs.\n\nApply for Auto Loan: https://www.idbibank.in/digitaladvcampleads/AutoLoanCamp.aspx\n\nApply for Fastag: https://etcidbi.ventureinfotek.com/IDBIFastTagApplication/fastTagApplication\n\n#AbChalnaNahiChalanaHai​​ #IDBIBank\n\n#PowerDrift \nJoin the 2 Million strong #PDArmy : http://bit.ly/PDARMY\nStay updated with News, Behind the Scenes here : https://www.instagram.com/powerdrift/\nT-shirts, Badges & More official merchandise : http://www.powerdrift.com/merchandise\nFind us on Facebook: http://facebook.com/POWERDRIFTOFFICIAL/\nFollow us on Twitter for Launch updates & more : https://twitter.com/powerdrift",
        "channelTitle": "PowerDrift",
        "publishedAt": "2021-03-31T10:27:37Z",
        "viewCount": "334879",
        "transcript": "[Music] wow what a car hello and welcome to powerdrift folks my name is ten hut and this car standing here behind me it needs no introduction because quite simply it is the most sold car of our country and that for our country is no small feat and that makes this maruti suzuki swift as iconic as a maruti 800 in its latest iteration of course it's seen some improvements what are those improvements and what should you know before you place your bet on this car but we're going to look at five such things let's get started [Music] the first thing that we should start with is the way the swift looks and what are the improvements to its exterior well the swift was always a good looking car by the way the headlamps well they are not changed they still have a lot of mascara but what is changed is this chrome strip that runs across the length of the grill and then what is also changed is the very grill itself it's now a mesh grill earlier i don't quite remember what it was earlier but overall i think very few changes to the exterior to the front but let's come on to the side to talk more over to the side you see the same shoe still which is 15 inch wheels the spare is a 14 inch one but that is no change or no improvement what can be said to be a change is the dual tone roof which means the car is red here as you see the roof is black the roof can also be had white in color i think that pretty much sums up all the changes done to the exterior there are no changes at the back whatsoever so i think we should move on to the next point point number three improvements done in terms of features inside [Music] okay so moving on to other things that are new in the model year update of this new facelift ted swift cruise control that you now have on the steering here so when you're on the highway and if you wanted to cruise without any inputs you couldn't do that earlier now you can do it in this swift then you have engine start stop functionality so if you're stuck at a traffic jam or if you were idling at a signal well the engine is going to be shut off by the car all by itself i think that's a nice addition makes for a good experience if every vehicle around me were to switch the engines off when at a standstill we would be saving a whole lot of environment and fuel so please be doing that well the swift here does that for you you also have a color display between the two dials they are very much like what is seen in ballino and of course this color display is a host for all sorts of graphics out there there are no other new changes to this swift but it still retains all the characteristics uh of the swift that made the nation fall in love with the swift for example the gear shift very short shifty gear lever here and the shifts are very slick braking is very confidence inspiring there is no worries there clutch action is so so light that of course driving it around in the city is going to be no challenge at all i try to blip and downshift right now a little bit on the brakes and you can feel the front loaded the rear gets light so that's the playful nature that i'm talking about of the chassis and you can have fun in the swift a whole lot in fact and if you feel like you're running wide well then step slightly on the brakes and tighten that line of yours because the rear is ready to step out anytime you want now the other bit that has been changed is of course engine now gets dual jets where dual jets mean there are two fuel injectors for every cylinder one is a primary fuel injector the other one is a secondary fuel injector both these injectors together would mean that you have increased pull or drive over the band so let's say the low end the mid range and the top end should have increased because the horsepower overall has increased by seven horses the fuel efficiency because of this is also increased maruti claims to have increased it by a big number which is two kilometers extra to the liter in a sense the changes to the car are incremental but they only go on to make the package an even more palatable one all in all it's a great car to have fun with if you are looking at spirited driving and of course it's a great city car as we all already know they could have done one more change not to the engine but in and around the engine right made the car a lot more fun than what it is right now don't get me wrong the swift uh always was and still is a very playful car you do end up having a whole lot of fun but with that one change that i mean to talk to you about for which we will have to open the bonnet this car would have become even more fun let's pull over and find out what is it that i'm talking about so can you guess what component it is which when put in and around the engine here would make a whole world of difference to the way this swift drives you see ladies and gentlemen there aren't very many hatchbacks flying on indian roads that are fun the swift definitely is one and that could be another hey would you buy the swift does the swift get a turbo now do you need one hell yeah i'm always in a hurry [Music] and if you're always in a hurry the volkswagen polo gt tsi with its turbocharged petrol engine is never going to let you down the engine it might be tiny and sound a little thrashy but when that boost kicks the clock stops ticking cars like the volkswagen polo are a reminder that the swift could do with a little more power under the hood [Music] i think it's time we talk about the next point of improvement which is not an improvement to the car but i want to talk about the price which is now 15 to 20 000 rupees more than what the swift was which by the way is not a whole lot but that had to be this way because you see there are quite a few inexpensive suvs and many other hatchbacks that are breathing down the neck for swift and so it's quite important to have this car priced well because there aren't that many hatchbacks flying on indian roads that are fun and so would you buy the polo there uh but it does not cost the same as the swift does it cost the same no i don't think so the roads are calling in all literal and figurative meaning it's time to embrace 2021 with idbi bank gary pasandai to go ahead and buy it make your dream a reality finance go ahead and buy with idbi bank auto loans and enjoy several other benefits what was that that was idbi bank auto loans for you that's how they're all oh so i get it go buy the car you want spread dmis across months and just yeah go out there and drive wow what an offer yeah i must hurry wait hang on even i could rush to buy a polo now i think we all should rush and you know where so let's sum it up thanks a lot for watching powerdrift we spoke about the improvements done to the car of course that one point that is left undiscussed but i'm in a hurry is about safety uh there still is no traction control on the new swift and there is no esp the swift still got what it takes uh to be holding its own candle uh against everyone out there for maybe a couple more years but post that let's get ready uh to witness a new swift altogether thanks a lot once again goodbye",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@saitejashokeen3171",
            "text": "The polo entry in the new swift video is blistering, because we gotta see polo Review on powerdrift 7 years ago and I was eagerly waiting for the new Polo GT TSI 1.0L Review but short span comparison makes me feel good. Thanks powerdrift really looking forward for the new polo Review in the future",
            "likeCount": 4,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@kondrasumeet",
            "text": "Team Powerdrift should cover each aspect of the car which also includes safety.. I love your videos, cinematography, sounds, but i know every time you could not cover the negatives....\n\nBut from the house of Powerdrift this should be address as you arr one the best guys in motoring industry.",
            "likeCount": 1,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          }
        ]
      },
      {
        "videoId": "wMm284mKwNA",
        "title": "Maruti Suzuki Swift 10,000km Long-Term Review: Performance, Mileage & Reliability | Autocar India",
        "description": "Saumil Shah has been living with the Maruti Swift for the past couple of months. Here are his findings of life with this hatchback.\n\nCameraperson: Harshad Panchal\nEditor: Deven Bhalla, Sanil Savardekar\n\n0:00 - Intro\n0:42 - Design\n1:10 - Interior \n2:19 - Ergonomics\n2:56 - Space & Comfort \n3:32 - Cabin lamp\n3:46 - Storage & Practicality\n4:28 - Visibility\n4:50 - Drivability\n5:43 - Performance\n6:36 - Gearbox & Clutch\n7:03 - Fuel Efficiency\n7:23 - Ride & Handling\n8:24 - Headlamp Performance\n8:37 - Service cost\n8:58 - Verdict\n\nSUBSCRIBE to Autocar India for the hottest automotive news and the most comprehensive reviews ► http://bit.ly/AutocarInd\n\nAutocar India is your one-stop source for test drive reviews & comparison tests of every new car and motorcycle launched in India. We also offer a great mix of other automotive content, including weekly news, motor show reports, travelogues and other special features. \n\nWebsite: http://www.autocarindia.com \nFacebook: http://www.facebook.com/autocarindiamag\nInstagram: https://www.instagram.com/autocar_india/\nTwitter: http://www.twitter.com/autocarindiamag\n\nNew car reviews ►http://bit.ly/ACI-NewCarReviews\n\nComparison tests ►http://bit.ly/ACI-Comparison\n\nNew bike reviews ►http://bit.ly/ACI-BikeReviews\n\nFeatures ►http://bit.ly/ACI-Features",
        "channelTitle": "Autocar India",
        "publishedAt": "2025-05-30T13:01:41Z",
        "viewCount": "82368",
        "transcript": "Did you know that the Marauti Suzuki Swift consistently ranks in the top 10 selling cars in the country, finding over 14,000 new homes month after month? So, what is driving this demand? Is it the allnew petrol engine with its tall fuel efficiency claims, the modern features, or is it simply the enduring appeal of the Swift name plate? Well, we've lived with the car for a few months now to find out. [Music] What? The Swift carries forward its unmistakable silhouette, but now it gets softer, rounder design elements. Now, personally, I quite like its styling, and this red metallic paint shade really complements its youthful character. Here's a fun fact. Despite being significantly larger than the first gen Swift, this one is 90 kg lighter, tipping the scales at 920 kg. The all black interior with hard plastics and a lack of soft touch materials gives a very basic budget feel. Even the freestanding touchscreen is a bit of a letdown. Not only does it lack flare, but it also hampers frontal visibility in certain situations. While the screen covers all the basics and also supports wireless Android Auto, the sound system leaves a lot to be desired. A richer sounding audio experience would have really elevated the drive experience, something that Tata offers with its hatchbacks. The analog dials are clear and very easy to read with premium looking needles. However, the previous version's hooded dials with vertical needles and red accents added a more special and a sportier touch. What you also get is a colored multi-information display, which also features Google Maps prompts. This feature, however, cannot be turned off, and that could be an annoyance to some users. The front seats are sporty and supportive with great side bolstering. As is a typical Japanese car, ergonomics are spot-on with everything falling to hand very naturally. I really like the flat bottom steering wheel. It feels great to hold and even the pedals are well spaced out. And the best thing is you get a proper dead pedal which is very useful on those long drives. And speaking of long drives, the absence of an armrest is noticeable and missed. There's sufficient space for two sixfooters to sit one behind the other, and the rear bench itself is quite comfortable. The repositioned door handles have enabled a wider glass area, including a larger quarter glass, which enhances the sense of space inside. However, the rear bench isn't as wide as, let's say, a Tata Altra. There's no adjustable headrest for the middle passenger, and the rear AC console juts out a bit, which makes this area best for two adults rather than [Music] three. Another miss is the absence of rear cabin lights, which makes it a bit inconvenient to look for missing items, especially in the dark. Storage areas are well thought of all across the cabin. You get a wireless charging pad. You have dual cup holders in the front. You have reasonably sized door pockets with a bottle holder and then room for some more stuff. And you also get multiple charging provisions, two in the front and two at the rear. The 265 L boot is pretty standard for this segment. And you also get the flexibility of a 60/40 split rear seat. One thing that is a bit of a issue is that the boot lip is quite high, which makes loading and unloading heavy items a bit tricky. The redesigned C-pillar does reduce the blind spot compared to the previous generation. However, you will still have to rely on the camera and the sensors as real world visibility isn't great. And speaking of which, the camera quality leaves a lot to be desired. The 82 horsepower output of this 1.2 L 3-cylinder engine might seem a bit modest on paper, but in the real world, it does a reasonable job. In fact, throttle response is crisp. Power delivery is smooth and there's more than enough grunt below 3,000 RPM to keep up with traffic and for daily commuting whether on the city or on the highway. And usually it's the,000 to 3,000 RPM band where most users generally limit India driving to. So yes, when it comes to a commuter engine, this does a reasonable job. One interesting factoid is that the rolling acceleration or the India acceleration types of this Swift are far better than all the generations of the Swift which means drivability is among the best something that users will appreciate. However, for people who value outright acceleration more, that is 0 to 100 km/h, this generation of the Swift is the slowest compared to all the generations, including the first generation Swift. So, yes, enthusiasts looking for the outright punch and that free revving nature from the Swift will be left a bit disappointed. And even the revs max out at 6,000 RPM, that is 300 RPM lower than the previous version, which feels a bit restrictive. But those who want thrilling acceleration from signal to signal, the Swift's engine feels quite peppy up to speeds of 60 km/h, as demonstrated in our drag race, where its slick controls and strong bottom end give it an edge compared to a much more powerful hatchback. And speaking of which, a manual gearbox is not something that I'd usually recommend someone looking for a city commuter, especially if you live in one of the congested metro cities. However, the Swift's 5-speed unit is an exception. The shifts are sleek and buttery smooth in their operation. In fact, even the clutch is very light, which really takes away the effort of rowing through the gears manually. We've consistently recorded fuel efficiency figures of 14 km per liter in the city and up to 19 km per liter on the highway. And while these numbers are impressive, they are nowhere close to Mary's claims of 24.8 km per liter. The steering is smooth and fluid in its operation and a huge improvement compared to the lifeless unit in the third generation. What also adds to the driving ease and the driver confidence is the fact that after you make a U-turn, the steering returns to its center position very naturally. Its ride is slightly on the stiffer side and while it does reasonably well in the city at low speeds, however, at high speeds, body movements can be felt in the car quite sharply. Sure, it might not be as chuckable or as go-kartike as the first gen Swift. However, mechanical grip is commendable, body roll is well contained, and you can have a lot of fun pushing this car around your favorite winding section of road. In fact, this car can easily be categorized as a fun to drive car only if the engine had a bit more zing. Its LED headlamps offer a good throw. However, they aren't spread too wide. So, on a winding road, you could find illumination a bit lacking. Since our long-termer has done only 10,000 km, the service cost is estimated to be rupees 1,600 for changing the oil and oil filter. Marauti provides three free services in the first year. Hence, there won't be any labor cost for this 10,000 km service. The Maruti Swift remains a practical fuelefficient hatchback that retains its fun to drive character. Yes, its engine feels a bit out of place on the highway, but in the city it feels reasonably peppy. After spending so many months with the car, we've really grown fond of it. And quite honestly, I think it's one of the most charming Maruti hatchbacks on sale today. [Music]",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@alileevil",
            "text": "I have this car and I recommend it to anyone interested in roadtrips. On the expressway at 80-90 kmph, it gives a mileage of 30 kmph. The Swift is a driver's car. It might not have av sunroof, arm rest, and 360 degree cameras, but its a joy to drive. But if you have a family, I'd suggest the Baleno or the dzire for the back seat space.",
            "likeCount": 26,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@anandkpradeep612",
            "text": "Having owned Gen 1 Swift with K12M which is the best version of K12 launched, also  having recently bought this 4th gen Swift with Z12e, i would say Z12e feels way better in city speeds, midrange torque is really good which is handy in quick overtakes, apart from that the worst FE I got in city is 13kmpl which is fantastic. What I have felt is that K12 lost it's charm in it's BS6 dual vvt version, it no longer has that punch of older K12. So to conclude please don't judge this Z12e based on paper specs, please test drive to get hands-on experience",
            "likeCount": 13,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@gowherulislam5480",
            "text": "Great review, this is called review, other prominent car reviewers must watch this especially from the fact that they exaggerate mileage figures of maruti cars in their reviews, I have also driven a maruti car for 22000kms and I believe maruti mileage claims r a bit higher",
            "likeCount": 7,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@theacechip",
            "text": "After a year of using the new Swift in its AGS avatar, I must disagree on the following 1) that the touchscreen creates a bit of a hindrance in forward visibility 2) The sound system is not up to the mark. In my view, sound quality and feel is a subjective matter, but if it is properly tuned, the OEM system is a decent bang for the buck. Dont expect Burmester like sound in a conventional budget car. It is a good cheerful hatchback with excellent fuel economy and \"adequate\" performance. Two 6 footers can sit behind each other without any issue. The boot can accommodate a couple of large bags and a rucksack. 6 airbags and ESP as standard. Cant complain much !!",
            "likeCount": 7,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@mohammedhashid",
            "text": "Honestly, people judging the Z12 engine too quickly should drive it for at least 100 km. It’s not as good as the K12, but definitely better than most 3-cylinders out there. Steering and high-speed stability are impressive, suspension is decent, and 6 airbags are a big plus! The only downsides are the weak LED headlamps and average interior plastics. Still, a great-looking and practical family car for Indian roads.",
            "likeCount": 22,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@suhagpatel7765",
            "text": "I don’t like the interior of the new Swift. It feels cheap and boring. My elder brother bought the new Swift VXI AGS for city use. Overall, it’s a better car than the last generation, except for the Z12 engine. The K12 engine is better suited for the new Swift. I have a Swift VDi, bought in 2014, and driving it feels amazing.",
            "likeCount": 3,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@siddharthscreationsandgami9908",
            "text": "Maruti nailed it this time with good safety features and the looks of the vehicle …. Yes the engine is not like before but buttery smooth engine tho and Maruti knows exactly what they are doing for people in India , because this swift still sells like hotcakes 😊",
            "likeCount": 2,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@user5346",
            "text": "He says this gen is the slowest of all generations and the very next slide shows 2011 model has a timing off 14.24 compared to 13.03seconds for the 2024 model.. you basically kidding your own data as its just writing by someone and read by another and edited with stats by the next person.. 😂",
            "likeCount": 5,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          }
        ]
      },
      {
        "videoId": "3AoZq0vdSZ8",
        "title": "Suzuki Swift GLX: One Year Ownership Review - Worth Buying in 2026?",
        "description": "00:00 - Suzuki Swift GLX Price in Pakistan\n00:30 - Why I moved from Toyota Yaris 1.3 CVT ATIV\n00:57 - Purpose of this Review\n01:31 - Fuel Average\n04:22 - Features\n05:29 - AC Performance\n07:12 - Android Screen\n09:12 - Camera and Parking Sensors\n09:43 - CVT Gearbox and Sports Mode\n11:03 - Hill Hold\n11:40 - Arm Rest\n13:05 - Auto Headlights\n13:31 - Keyless Entry\n14:09 - Poor Assembly\n14:40 - Who should consider this car\n15:36 - Safety Features\n16:16 - Rear Legroom\n16:41 - Speakers\n17:06 - Tyre and Rim Size \n17:37 - Cultus Price vs Swift Price\n18:08 - Running Cost\n19:18 - Comfort and Stability\n21:00 - Minor Facelift Features\n21:34 - Tyre Bubble Issue\n23:00 - Old vs New Swift\n23:39 - Comfort of Yaris vs Swift\n24:39 - Ground Clearance\n25:29 - Plastic Quality\n26:07 - Interior Light\n26:55 - Verifying Fuel Average\n\nShop Car Accessories on TEMU: https://temu.to/k/e2xhiakybcv\nLink to buy Swift Arm Rest: https://temu.to/k/eaczm35t03e\nLink to buy Silicon Tray: https://temu.to/k/ehq0tu19y0c\n\nFollow me on Instagram: https://www.instagram.com/syedowaisali",
        "channelTitle": "Syed Owais Ali",
        "publishedAt": "2025-12-25T06:05:24Z",
        "viewCount": "63126",
        "transcript": "My Suzuki Swift is giving an average of about 20 km per liter, and a lot of people are not talking about this feature of this car. So I am here to share my one-year Suzuki Swift review. So let's get started. I have been driving this car since February 2025, and it's December now. So, I've been driving it for about 10-11 months. I bought this car for approximately Rs 50 lakh, including taxes and everything. Before this, I had a Toyota Yaris 1.3 ATIV. I really loved that car, but I was quite upset with its fuel economy. I had heard a lot about its fuel efficiency and many other features. So I decided to change my car from Yaris to Swift, and personally, I am very happy about it. But people don't know as much about this car as they should. Yes, because everything is about hybrids these days, plug-in hybrids. So this poor thing is overlooked by many people. So I want you to make this video happen: if you are thinking of buying a car in the budget of Rs 50 lakh, then do not disregard this. You probably have a lot of preconceived notions about this car because the previous model was notorious for its poor fuel efficiency. People think it doesn't have enough luggage space. I thought so too, but this car has surprised me in many ways. So, this is my in-depth user experience review. Of course, this car isn't perfect; it's from Park Suzuki, so we'll discuss those flaws as well. But this is genuinely honest.\n\nLet's start with the fuel average, which is where we began this video. People will come in with a lot of comments saying this is a fake fuel average and how is this possible and everything. So those who own a Suzuki Swift can tell me this. You can see that I have shown you its average fuel displayed. Well, for one, it has a push start. I like this feature, which is something you rarely find in the competition. So many people might be thinking that it is very easy to fake the Suzuki Swift. But as you can see, it's almost here on my MT. I've just had a go at it, and I've done about 560 km in it. If I want to reset the average fuel economy display via the info button, no matter how long you hold it down, it won't reset. It automatically resets when you refuel your vehicle; it goes to zero and resets. Anyone who drives a Suzuki Swift will attest to this. So, what you're looking for now is this fuel average; it is almost on a full tank, and we have just covered 560 km. I've done it, and there's still a little bit left in the fuel tank. So, this is the fuel average I got in the city without AC these days, given the weather in Islamabad. During October, November, and December, you generally get good fuel efficiency for every vehicle because the heat is not that much. If the AC is not running, then I will say Suzuki is also not trying to set the wrong expectation by referring to the Swift as giving 20 km/l or 21 km/l. But this is really good compared to what I was getting in the Yaris during the same time. I would have gotten 13 or 14 this season. I don't think I ever got 15. And during the summers, I got 11. I used to get 12. I have driven it in summers as well. I get 16 comfortably. If I put it on idling mode, keep the AC on, it gets very bad. When I used to use it, I would get 14, which means I used it very badly. Well, even now, you still get this. I have shown the average; I have just increased my tire pressure, so its tire pressure was unbalanced because the front tires were at 23 and the rear ones were at 27. The tire pressure was correct, and yet you got such a good fuel average, so that's really very surprising, and I think now that the tire pressure has become equal, you can get even better than this.\n\nSo, if we talk about tire pressure, this car is a little different. People load 30 in it. It actually holds 36. These front tires should be filled, and the rear ones should be 32 if one person is carrying more load, and 40 or 42 if you have a heavy load at the back. This is from Suzuki; this is the recommended tire pressure, and it's listed here. So, make sure you're using it. Keep your tire pressure appropriate.\n\nNow, let's talk about the interior. Let's move on to the exterior. The interior is more fun to drive. Let's discuss that first. As I told you, it has a push start and traction control. Its headlights are adjustable, and these are LED headlights. So the results are quite impressive compared to what I had in the past. The Yaris, which is the older model, offers rear parking sensors. The sensor is quite impressive. It has cruise control. It also has Bluetooth controls. Yes, I need to receive a call. From here, you can adjust the volume, skip tracks, etc. And its overall driving position, large cockpit style, has a driving position. I love the display. I love the quality of its indicators. I really like the rest of its autometer. It's really nice. It gives a very premium feel. It has different modes that you can change, and you can go to settings and make different settings depending on how bright your headlight is. It stays on for a long time, and there are many other features like that. To be honest, I mostly checked it out at the beginning; I didn't explore it after that. Another one is something which is not needed so much these days, but I made a note of it during summers, and its AC is phenomenal. I mean, it's so good; it's hot. What happens in summer is that one's hands become cold, and one starts feeling cold. It starts with \"To Be Honest.\" So it's a really good AC. And if you compare it to the Yaris 1.3, there was often a status there; it also has a good AC, but the rear passengers would become quite uncomfortable when it was too hot; the air wouldn't travel as far.\n\nOkay, one more thing. Let us talk about AC only: it has climate control, and you can also do that in it. You can set the exact temperature. That's what it means. The other Yaris has it, or in the 1.3 that I will talk about, you have this manual for it, which you can guess. You need to determine the temperature at which you are currently storing your vehicle. The dial and its IC controls are very good, and auto climate control. So, one thing that did bother me a little bit was that its fan speed is on this side and its temperature gauge is on a little bit here. It took some time getting used to it. But now I'm getting used to it. It was done, but it took me a while to adjust it. I pressed it usefully. I used to rotate it. This one is solid, and the temperature is right here. Although, I think its fan speed should have been here, and the temperature gauge should have been there. I don't know, maybe in left-hand drive, or they used it for that. I'm not sure if in left-hand drive these are the other way around, but I would have liked the fan speed to be in charge here, and the temperature to be in charge there.\n\nNow, let's talk about this. Right? This is one of my favorite features about this car. It's a complete Android system, right? It's not Android Auto or CarPlay, but it would look much better because it has a SIM card slot. It's plugged in. I've inserted an Onic SIM card here. I'm using data on it. It's installed. You've got LTE here, and I'm here to comfortably watch YouTube. I should put it on. YouTube Music. Whatever I do here, like Maps keeps running. It's like you have a small phone of your own or a small tablet of your own. This is amazing. I mean, I'm very happy with it. So, that's often the case. I don't get much time after work to do some study. You need a little bit of listening to podcasts to learn or even listening to the Quran from I would get time. So, during your commute or on your way somewhere, if you have Google Maps, you can install it here. There's no need to put up maps, and you can just turn on YouTube and listen to podcasts, listen to the Quran, and you can turn off the screen as well or even multitask. You can have the map on and YouTube playing in the background, and I've also purchased Premium, so I don't have to worry about ads. So, Onik's data comes for ₹1500, and in that, you get approximately 30 GB, and I have taken it. It's amazing. It's so much fun. It's really good. You can also plug in two USB ports, and you also have these controls here. You can also use the phone. You can also pick it up if your phone is connected. But I'm not connected to this phone. Not done. I use it as an independent tablet. So my favorite feature is the tablet; it's the screen. I know you can also install it on aftermarket vehicles, but it comes with this. So that's a really good thing. I'll also show you the reverse camera. Look at the camera quality; it's really good. Furthermore, its parking sensors are... You go to the back, Abdullah, and I would have shown you the sound of the parking sensor too. Yes, come in front of the camera for a bit. So you can hear the sound of its parking sensors. The further away you are, the smaller it will be, and the closer you get to the object, the larger it will be. Its beeping will become more frequent.\n\nOkay, now about its gearbox. Let's talk. The gearbox is a CVT, and I really like it. It's pretty good. There's a little issue with it. There's a sports button right here. Okay? I pressed this. So you see the \"S\" here. So many people who are new to this app or are using it for the first time press \"S\" and start it like this: they're doing it on the back. Although there are buttons on the front as well. So this is the wrong positioning. The Sport mode button on this \"S\" could have been a little better. When the car is in sports mode, your RPMs will be at three or two and a half; they don't go down. That's the only difference. The rest isn't that significant. The response can be improved a little bit, but overall, it's quite responsive. This car is good. One more piece of feedback I can give regarding the gearbox is that accidentally you go all the way, and it goes on \"L,\" and there is only one lower gear. You can't choose your gear preference. It's either \"D\" or it's a lower gear. So, it happens accidentally in the beginning because I wasn't used to it. You used to take it comfortably on the \"L.\" Many people who took my car Boro's kept running the \"L\" on it all day long. So it's a little thing; it gets tech sometimes getting used to it.\n\nOther things I like about it are one of its features is hill start assist, which helps if you're on a slope. You press the brake, put the gear on, and when you release the brake, the car doesn't immediately go back. It stays in place, and when you press the accelerator again, it will propel you forward. This feature is also available on the Yaris, but I think it's not available in the City; I'm talking about the 1.3-litre variant. You can look back at the video to see what time it was at that time. So, it was quite late. I've been idling for 20 seconds and still averaging 19.6. That's another proof of this. This is the real fuel economy average. There are no fake gimmicks.\n\nSo, let's talk about this car. A few negatives. One big negative of this car is that it doesn't give you much room to drive. The handrest isn't available. So I ordered it from Teemu. You can easily get it from Teemu. You can order it from AliExpress or Daraz. This is what's in the cup holder. It fits comfortably in the cup holder here. Handrest. It also has a cup holder. There's even a small mobile phone holder. So, it has two storage options: one for card cards on top and a slightly deeper bottom storage. Here's another item I ordered from Teams. It's a removable silicone tray, so if there's any dirt in it, this silicone material is used on this thing, and the main thing is plastic, which is not used on the body of the car. You can easily wash it all. Furthermore, these cup holders are almost useless, to be honest, because they're such small cups. I have not seen any such bottle or any such cup till now which I could fit in here. So maybe just a small cup of tea could fit in here. It's not ideal that he has access to that cup. Why I end up using this cup holder a lot more. It's also smaller than most of the stuff, like the bottles that I use. So this one is almost useless. But the one in the door, you're getting a cup holder or a bottle holder; that's pretty cool, and that's quite useful.\n\nWell, another feature I think is very underrated is this: the key difference is that it offers auto headlights. This is a common feature of the vehicles in this segment. I am not sure about Alcin, but Yaris and City do not have this option at all. So these are its auto headlights. When it's dark, these lights turn on, and they turn off automatically when it's sunny, so that's a pretty big premium feature you get in this car. In addition, there's keyless entry, a lifesaver. So, Suzuki hasn't cut any corners here either. You'll find a button here too. Keyless entry is available on the passenger side and in the trunk as well. The boot, or rather the trunk, also has a keyless entry system. So Suzuki could have removed that, but it's very nice to see because this button means the car gets parked, and you can easily unlock it from here when you are about to put your luggage in the trunk. You don't have to go there and unlock it and then come here and open it again.\n\nOf course, now we're talking about Park Suzuki, so Park Suzuki's somewhere, somewhere the signs that should be visible. So you can see here, it's very, very bad here. They've done the welding. This is where you start to get a little bit of a sense of it that this is a Park Suzuki car. And surprisingly, there haven't been many corners cut, in my opinion. The spare tire didn't come with a spare tire. Now, in the facelift they've done, they've included a spare tire. They've also started providing a spare tire. Now, many people are using it as a boot. Let's compare. I think it's an unfair comparison. That category is different. The hot hatch category falls into this category. So, those looking to buy a hatchback should consider the Yaris. Those who want it should consider it. But also the one with the boot, because I personally own a Yaris. I'm coming from. You'd think there would be very little space. Not that much difference. Yes. Why? Because there were a lot of things I couldn't fit in the Yaris. I've been able to fit that in, and I'm genuinely surprised; it was quite a big history stand. I've fitted this car once. How I was able to do it? Because you can fold these two seats flat. Okay? Look at this. How much space have you got? So you have a huge amount of space to put a lot of things which you can't fit in a trunk anyway. But I'm not saying it's more than that; it's spacious. I'm not saying that. But I had no idea how spacious it was. There will be space. It has pleasantly surprised me. Besides, I also have a young child. Another thing I really love about it is that these six airbags ensure safety, meaning there is no compromise at all. Six airbags is the highest in the Rs 50 lakh category. In Pakistan, the Stonic probably offers six airbags, and that's even more expensive. Yes. But you also get ISOFIX anchoring, meaning there's no safety issue. There's no compromise. Let me show you. You also get top-notch tethering here, and here you will find very easy ways to fix ISO. I'm also getting two access anchors. Okay? And my son's car seat is mounted on ISO anchoring.\n\nNow let's talk about rear legroom. This is very good, meaning comfortable position. Two adults can comfortably seat; it seats a small child comfortably, and in the middle, it seats three adults. It's a bit cramped. The rear cup holders are completely useless. It would have been better if they had existed, but they exist for some reason. Well, here's another thing I've noticed. When I saw the speakers, I remembered that its sound system is also very good. It has been used from the ground to the sky, meaning a lot better than the Yaris. So, you get the Yaris and the City in this price bracket. But remember? They've cut corners in many places. Let's see these for you. Speakers are done. Then you get 16-inch tires, Bridgestone. That's where you get local tires in 15 inches, six airbags, keyless entry, traction control, which you don't get in the City at all. I am not saying that City and Friends are bad cars or they should not buy them; I am just saying this. I am saying that when you think about it, when you just compare it on the price, just don't think about that, okay? I am getting a car with a trunk for Rs 50 lakh, and I also want this Swift. This is the top-of-the-line variant available for Rs 50 lakh, and one more thing is big for me. Interesting, those who want to take CS, sorry. Yes, those who want to take CS, AGS, there is only a difference of ₹ lakh between the top-of-the-line CS model and this top-of-the-line Swift. It baffles me that there is so little difference between these two cars because it is like heaven and earth. There's a difference in the quality and features of these vehicles. So I don't know why anyone would buy the CTS AGS. Let me know in the comments who that car is for? Because I don't understand who is going to take the cult over this, right? You get so much more for 2 lakhs more. Speaking of comparison between Yaris and City, again, it is not a fair comparison, but what I want to tell you is that its oil change is the right oil change. You also have to pay 7500 km for this, whereas in the case of those vehicles, you will have to pay 5000 km. Tax is charged per kilometer, so its running costs are low. Fuel average is higher or lower. You don't have to change its oil as frequently. Changes are minimal; its quantity is small. In those ways, this vehicle will save you a lot. So yes, the cost might be similar to those sedans, but theirs is much cheaper. The running costs are lower than that. It's the G engine. Right? And if your income is 120",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@asimsalman3948",
            "text": "You can reset the \"Average Fuel Economy\" number by long pressing the knob on the right. Similarly, you can reset the mileage by long pressing the knob on the left side. I also have Swift GLX CVT since a year and I get 13 to 14 average (with AC) in city (Isb). I love my car and it has pretty good mileage, but it won't give you much if you live wherever the roads are steep or have lots of speed-bumps. It gives me 18-19 on long roads like motorway but otherwise, getting 19 in a traffic prone + bumpy place is physically not possible for this car. The MiD will always show better mileage than reality.",
            "likeCount": 3,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@fuelforfulfillment",
            "text": "Swift is a really good car if you are looking for a compact car for a small family or single person use. I was in the same situation but I ended up buying yaris 1.3 as I already owned a hatchback before and I needed more space so it made good sense for me but yes I considered swift even took a test drive of it and it is superb especially the acceleration of it. Many people in the market do not  recommend it in this budget as you can get a sedan from better brands than suzuki but swift in my opinion is a very good car if your preference is not buying a sedan. Also it is alot better then the imported yaris hatchback which is 1000cc. Tyre problem in swift is because of its profile just increase the height of the tyre a bit the issue will be resolved.",
            "likeCount": 0,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@mohidfurqan7193",
            "text": "21:06 It’s not a reflector; it’s a proper light.\nTo activate it, first turn on the fog lamps. After that, rotate the fog lamp switch again to the last position (the position where the fog lamps remain ON and do not turn off).\nOnce you do this, the rear light will turn on. You can also confirm this by checking the yellow indicator symbol on the meter screen.\nIf you’re successful in doing this, please let me know.",
            "likeCount": 1,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@mathariqbal",
            "text": "Always loved your reviews, and the best thing is that you are doing the videos for the common public, not for the high end consumer, just recalled the way you start your life after repatriation, your reviews are reference for me to share with my friends circle",
            "likeCount": 0,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@Giant_Dwarff",
            "text": "21:45 brother get the tyre replaced ASAP, that is a sidewall damage and it cannot or rather should not ever be attempted to repair as it poses a serious risk of tyre bursting at any moment risking not only your car but life as well. Please get it replaced ASAP its not worth the risk saving few rupees to risk your life, if you don't want to buy at least a pair of front tyres, just get the one tyre replaced by the same model or even a different one of the same size (although it might not be ideal for ride quality, but anything would be an upgrade on the current condition as it would be safe atleast)",
            "likeCount": 2,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@akhtarkh",
            "text": "Car panels are spot welded. What you are pointing out is flexible seam sealer. AI says : The material put between spot-welded panels of cars is called automotive seam sealer or weldable seam sealer. Its primary purpose is to seal the seams and joints to prevent the intrusion of water, air, and dust, which helps protect against rust and corrosion.",
            "likeCount": 0,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          },
          {
            "author": "@UmairAli-ly3mo",
            "text": "main apko ride ka explain kr deta ho, swift is a little bit stiffer then  yaris, that's it. Ap aik axio chala kr check kry, 2ndly, mujhy ye laga ky isme sound insulation ziada hy yaris say, aik or cheez ap japanese sedan use krky check kry, like axio",
            "likeCount": 0,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          }
        ]
      },
      {
        "videoId": "uLVbIIaWZyk",
        "title": "18 साल में Swift की 3 Generation चला चुके Swift Owner ने बताया, ये क्यूँ है लोगों की पहली पसंद🔥✅",
        "description": "Has the King of Hatchbacks lost its crown? 👑 In today’s video on Power on Wheel, we have a very special guest. He has been owning and driving Maruti Swifts for the last 18 YEARS—from the original G13B engine to the K-Series, and now the new 2026 Z-Series 3-Cylinder model.\n\nWe’ve driven this new Swift for 20,000 KM in just one year. We test everything: City traffic, Highway stability, that controversial 3-cylinder vibration, and the actual \"Kitna Deti Hai\" (Mileage).\n\nIf you are planning to buy the new Swift 2026, DO NOT miss this long-term ownership report!\n\nIf you want to share your ownership Experience, Email us : poweronwheel1@gmail.com\nSocial\nInstagram - https://www.instagram.com/poweronwheel\n#PowerOnWheel #MarutiSwift2026 #SwiftReview",
        "channelTitle": "Power On Wheel",
        "publishedAt": "2026-01-10T13:39:44Z",
        "viewCount": "25577",
        "transcript": "The only complaint about this vehicle is that if Maruti had perhaps kept a four-cylinder engine, it would have had slightly better pickup. When I drive it, I get around 17-18 km/l. If my wife drives it, she gets around 12 km/l. Why didn’t they think about CNG? Who wants to stand in lines for CNG, brother? I'm 45, and I've spent almost one-third of my life in this car. Why does the Swift sell so well in the Indian market? If I were to answer that, you might not find it convincing, but let me introduce you to someone. This is Gaurav Chaudhary. How are you, Gaurav Chaudhary? Welcome to our channel. Happy 26! Thank you so much! So, you've been driving the Swift since 2009, and this is the latest Swift. How many times have you changed your Swift since 2009? This is the third one. So, what’s the reason for your love for the Swift? Of course, it’s Maruti's trust, which is constant. That’s the biggest thing. Also, in the city we live in, Ghaziabad, the traffic volume is increasing a lot. So, for local commuting in traffic, this is the best option. We didn’t upgrade to the model that came in between because I personally didn’t like the rear handle that moved to the quarter panel. As soon as they changed it, I bought this one. Have you ever driven it in diesel? I have always driven the diesel version; this is my first petrol car with a three-cylinder engine. So, which variant did you choose? I took the LXI variant because I wanted it, but I have converted it completely. I have updated all the best accessories in it. So, you took the base model and made it top-spec? Almost around 2 lakh has been invested in it. Oh, you’re saying 2 lakh as an investment? Why do you call it an investment? An investment means, of course, that when I liquidate it, I will get better value for it. It sells for around the same value as the top model. So, how much did you buy it for? It cost around 7.25 lakhs. And how much have you driven it so far? It has run around 27,000-28,000 km in 19 months. So, in 19 months, Gaurav has driven around 27,000-28,000 km, and today in our customer review, we will tell you why people like the Swift and why Gaurav is so crazy about it. Does he drive any other car? No, he doesn’t. How much mileage is he getting? Let’s talk about comfort; how satisfied is he? Also, when he goes for servicing, how happy does he feel? He will also tell us why you should buy the Swift. You will find the answer to that in this video. So, let’s get started and give you a detailed customer review of the Swift because after the three-cylinder engine, people have been talking a lot about this car. They feel that it won’t be justified with a three-cylinder engine. But I have the right person who will answer that correctly. So, let’s begin, and we will tell you all about this car in detail, and through a great customer review, all your doubts will be cleared. So, Gaurav, let’s start with your engine. When we talk about performance, it has a three-cylinder engine. Yes, it has insulation plates, etc. But I had many doubts about the three-cylinder engine because, of course, a three-cylinder cannot match the pickup of what the diesel used to give. But if I talk about petrol, it’s a very smooth and silent kind of car. So, when we talk about performance on the highway, when you overtake, it’s fine. There’s no issue. I drive it hard because I also drive a Duster. I don’t drive slowly at all. I’m not a rash driver, but I don’t drive slow. I have pushed it up to 100-120 km/h. At 120, it creates a bit of a problem, but generally, for a city ride at 90-100, it’s okay because I’m expecting some of my new cars. That’s why I drive it regularly. I take it to Gurgaon and Vadgaon quite often. It gives me a good driving pleasure. When it comes to servicing, how is it? How many services have you done? The difference is that when my other cars have any problems, I drop everything and go for servicing first. In this, it costs around ₹2500-5000 for servicing. Yes, yes. So, it runs almost like a free car. It has a three-cylinder engine. Yes, they did this to increase mileage. Do you think the mileage has improved? What’s your overall mileage? The company claims 25 km/l, but I think 25 is a very idealistic scenario that I have never achieved. Generally, I get a mileage of 16-17-18 km/l. If I drive, it gives me 17-18. If my wife drives, she gets around 12. Her driving capacity is such that she gets single-digit mileage in every car. But generally, from a female to a male driver, when I’m driving, I try to drive it smoothly, and it gives me 16-17 km/l. Safety is a big concern. Let’s stop it. It feels alright. When it comes to safety, how safe do you feel in this car? Safety matters, but let me tell you, it’s not solving any specific purpose for me that I need to take long drives in it. It runs around 40-50 km per day. Every day, it goes around 40-50 km. It drops my kids at the bus stop and picks them up. My daughter goes to her class, and my son goes to his academy. This is what it does for 40-50 km. I haven’t taken it on any long trips. The longest trip has been 70 km. I haven’t gone 100 km in one shot. But it has done many trips to Gurgaon. There’s no hidden challenge regarding safety or maintenance because of the three-cylinder engine. If we talk about the headlamp throw, how is it? Every headlamp costs around ₹12,000, which I have replaced. It has high beam headlamps. Where you live in Ghaziabad, potholes are common, but the situation has improved a lot. Still, when bad roads come, do you think the approach angle is fine? There hasn’t been any issue where it got stuck or anything happened because the ground clearance is quite good. We have sorted all those things. If we talk about the side, you have upgraded the tire size a bit. Yes, it’s not too much. You’ve been driving the same format since 2009. The tire size is 195/60 R15. It has 15-inch alloys. Only the patterns change a bit, but the tire size and everything remain the same. So, I haven’t faced any distraction in mileage, nor have I compromised on anything. It has the same pickup and mileage as before. The base model has defoggers. You haven’t done much at the rear. I haven’t done much at the rear. I have replaced the tires, the interior, and the lamps, and I have installed a shark fin antenna. Did you install a camera? Yes, it has a rear parking camera and everything. If we talk about the boot, do you think it’s convenient for storing stuff? Because my main purpose was to fit my son’s cricket kit in it. It fits his kit and a couple of his friends’ kits when he goes to the academy. So, it can accommodate basic bags and stuff. I think it has around 250 liters of boot space. It’s not too little. There’s no issue with that. I can’t comment much on it because my agenda to buy this car was never about carrying stuff. It was more for city travel, which is giving me 10 out of 10 marks. It’s a car that works like a bike for you. It’s perfect for local use. But I have a different passion for cars, so I have modified it in an amazing way. Let’s go check out the interior. So, Gaurav, I want to know how comfortable the rear seat is. I know you’ve spent a lot of time in the rear seat. By chance, through your channel, I’m sitting in the back for the first time. I haven’t sat in it until now. But it’s quite comfortable with four people sitting in it, and both of us are around 6 feet tall, so there’s no problem. There’s enough space for a bottle holder. A big bottle fits in the front seat, but a small one, like a 1-liter bottle, fits in the middle compartment holder along with the gear. The AC works well; there’s no issue with it. Fortunately, we live in a climate where temperatures go up to 52°C. So, there’s no problem with the AC performance. From a performance perspective, there’s nothing wrong. If we talk about interior modifications, what have you done? The interior modifications are quite simple. If you see, I have moved the bucket seats. The cabin light was yellow, and I changed it to white. The music system that comes with it doesn’t come standard, but I installed an 11-inch aftermarket music system. I have tried to install the best within my capacity. Let’s take a look at your car from the front. It doesn’t look like a base model Swift at all. There are many changes you’ve made. The music system shows Android Auto, Apple CarPlay, and everything. The reverse parking camera offers decent quality too. The bucket seats you installed look great. One thing I want to ask is why did you choose manual? I chose manual because at that time, I had a finite budget. My purpose for this car was more for local city use. When I was going for the automatic, my budget was getting overshot. So, I thought about it, and when I saw this, the manual was running very smoothly. Plus, my daughter is in class 12, so I wanted her to learn to drive on a manual for some time before moving to an automatic. Those were my specific reasons. If we talk about utility space in this car, it has enough space for small items. You can see the bottle in front. In fact, I think it has better space for keeping mobile phones than the Thar. You also have space in the glove box. So, there are no complaints about that. If there’s any complaint about this car, it’s just that if Maruti had ideally kept a four-cylinder engine, it would have had better pickup. And Maruti shouldn’t have discontinued the diesel engine so quickly because that was their hot-selling cake from a diesel engine perspective. But specifically from the car perspective, it’s absolutely fine. Why didn’t they think about CNG? Who wants to stand in lines for CNG, brother? It wouldn’t feel good. There’s no need for it. There’s not enough of a problem that I would go for it because it’s giving good mileage. If you had to choose another car instead of this one, what would it be? Was there anything else in mind, or was it just this? I didn’t consider anything else. We were very clear. We didn’t look at many options. Tata’s PCh or if I talk about the segment under 10 lakhs, there were multiple options, but we never considered them because it was very clear that if I wanted an option under 10 lakhs, it had to be only Maruti Swift. That’s it. Especially my concern was that the rear handle on the quarter panel that moved to the rear door was absolutely fine, so there was no question of looking at something else. When I talk about my car selection, I took the Tata Harrier because it offers better space than any other. What about the value you got for the cars you sold? I want to understand the resale because Maruti’s resale is still considered the best. When I actually sold my Swift, I got a very good resale value. I think I sold it around 5-6 years ago. In comparison, if I talk about the two cars I liquidated, which are my Duster and my other car, I am very disappointed. I will use that right terminology; I am very disappointed because both cars cost me approximately ₹32 lakhs new, and now they are worth around 10 lakhs together. So, in six years, if I had invested ₹32 lakhs in the market or real estate, it would have multiplied three to four times, and technically, I lost 20% on that ₹32 lakhs. Whereas if it were Maruti or Hyundai Creta, it might have given me better resale value. Tata and Renault need to work strongly on why their market value is poor despite having such good products. Regarding resale, it’s important to keep in mind that when you go to buy a car, you should also think about what resale value you will get. Because one day you might want to change your car, and if it doesn’t hold value, it’s very disappointing. You can imagine that against ₹32 lakhs, if someone gets 10 lakhs, that’s a loss of 67%. You should think about whether you would want to lose ₹67 out of every ₹100. I have lived that moment. It’s very risky. Whenever you buy a car, you should always go for a product whose market value and resale liquidation are better compared to whatever is out there in the market. Keep in mind that Maruti Suzuki has a market share of over 42% in India. All other car companies operate in the remaining share. You can gauge from that. So, let’s wrap up this conversation with Gaurav. Gaurav chose to buy a base model car for ₹7 lakhs, which would have cost ₹7.5 lakhs if he went for the top variant. But he invested in this and you have already seen the investment on our channel. I think it’s a good thing if you don’t make unethical modifications. He upgraded the tire size by one inch. If you look at the other changes, they are quite justified. It’s not that there has been any wire cutting or anything. I always consider such modifications bad, and he hasn’t tampered with the structure either. So, what he has experienced with this car, I have shared with you. Before we finish, Gaurav, why would you suggest buying the Swift? Look, if you are looking for a mid-segment car under ₹10 lakhs, there’s no better option than this. Because it gives very good mileage. It gives around 16-17 km/l. It’s easy to maintain. The best part is that it’s easy to handle. I already have other cars too. The reason was very specific because we needed it for local city commuting, for which it’s perfect, 10 out of 10. I have been driving it since 2009, and in 2025, it will be almost 16 years, which is a significant part of my life. I’m 45, so I’ve spent almost one-third of my life in this car. It’s a complete value for money. Even with minor modifications, it provides very good comfort. That’s why it gets 10 out of 10 marks in my life because my other cars, if I may take the names, are the Renault Duster and the Tata Harrier, which I am very fond of. But they have caused me a lot of loss when I liquidated them, which makes my affection for this car grow even more. The resale value of this car, commercially, is more effective compared to other brands like Tata and Renault. So, it’s even closer to my heart. Modifications can also be an investment if done correctly. And why does the Swift sell so much? I think Gaurav has clarified all these points. Why is Gaurav happy? Why does he trust it so much? Why is it a boon for city commuting? He has explained everything in this video. Let us know how you found this video, and if you drive a Swift, why do you like it? Please share your thoughts in the comments. And if you want to meet me, just send a message on our Instagram, Power On Wheels. We will come to meet you and share your story on our channel.",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@himanshutripathi7441",
            "text": "3 cyl high compression engines are good for this e20 , e27 and e50 natak. \nThese high compression engines will be better for future resale and will have less problems while getting better fuel economy even on e50 blends.\nThis Z series engine has compression ratio of  13 - 13.9, while older engines had compressin of 12.",
            "likeCount": 10,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          }
        ]
      },
      {
        "videoId": "OvFkJRQeIJ0",
        "title": "Updated✅ Maruti Swift 2026 | Swift 2026 New Model | Swift Vxi Optional 2026 | Swift Facelift 2026",
        "description": "Updated✅ Maruti Swift 2026 | Swift 2026 New Model | Swift Vxi Optional 2026 | Swift Facelift 2026\n\nEs Video Mein Aap Sabhi All New Updated Maruti Suzuki Swift Vxi Optional Mid Variant 2026 New Model Kaa Detail Review Dekhoge Jismain Maine New Year Price New GST Price Ke Sath Sath New Updates New Features New On Road Price Mileage Exterior Or Interior Ke Bare Mein Batya Hu I Hope Apko Video Accha Lagega So Video Ko Like Or Share Karen.\n\n\n● FOLLOW ME ON :-\n📷 Instagram :- https://www.instagram.com/amanautohub/\n\n\nupdated maruti swift 2026\nswift 2026 new model\nswift vxi optional 2026\nnew price maruti swift 2026\nmaruti swift 2026 new model\nswift 2026 new model price\nswift vxi 2026 model\nswift vxi 2026 price\nswift new model 2026 price\nswift new model 2026 top model price\nswift new model 2026 on road price\nswift new model 2026\nswift vxi optional 2026 model\nmaruti swift 2025 new model\nmaruti swift vxi 2025 model\nmaruti swift 2026 model\nswift 2025 new model price\namanautohub\n\n\nThanks\nKeep Support.\n#swift2026 #marutisuzukiswift #swiftvxioptional #swiftfacelift #swift2024 #amanautohub #carreview #automotive #swiftvxi #swiftzxiplus\n\nnew maruti swift zxi\nnew maruti swift vxi 2025\nnew maruti swift vxi\nnew maruti suzuki swift zxi plus\nnew maruti suzuki swift zxi\nnew maruti suzuki dzire zxi\nnew maruti suzuki dzire zxi plus\nnew maruti suzuki swift vxi\nNew Maruti Suzuki Swift zxi\nnew maruti suzuki swift zxi plus\nnew maruti suzuki swift zxi\nmaruti suzuki swift dzire zxi 2024 new model\nmaruti suzuki swift dzire zxi plus\n2024 new model\nmaruti suzuki new swift dzire zxi\nmaruti suzuki swift zxi new model\nmaruti suzuki swift dzire zxi plus\namt 2024 new model\nswift zxi model 2026\nMaruti Swift zxi 2026\nmaruti suzuki swift vxi 2026\nmaruti suzuki swift vxi 2026 model\nmaruti swift zxi 2018\nmaruti swift zxi review\nmaruti swift zxi model\nmaruti swift zxi\nmaruti swift zxi 2025\nmaruti swift zxi plus 2025\nmaruti swift zxi cng 2025\nmaruti swift zxi cng\nmaruti swift zxi on road price\nmaruti swift zxi amt 2025\nmaruti swift zxi plus dual tone amt\nmaruti swift zxi plus amt dt",
        "channelTitle": "Aman Auto Hub",
        "publishedAt": "2026-01-09T07:26:25Z",
        "viewCount": "27105",
        "transcript": "Hello, I am Main. In today's video, we will discuss in detail the most value-for-money variant of the Maruti Suzuki Swift, which comes under the name VXI Optional. The Swift has a total of five variants: LXI, VXI, VXI Optional, ZXI, and finally ZXI Plus. Right now, we have the mid variant, which is the VXI Optional. This variant is just above the VXI and offers significantly better features. Logically speaking, if you switch from VXI to VXI Optional, you will need to pay approximately ₹35,000 to ₹40,000 extra. This means that the VXI Optional is ₹400 more expensive than the VXI. For that ₹400, you will get a lot of new features. Additionally, this variant also offers the option of Suzuki Connect. In this video, we will discuss the features you get, the price, and how it has changed with the new GST rates this year, along with any offers available. Let's clarify everything in this video. \n\nFirst, let's start with the key. The VXI Optional comes with a smart key, which is quite nice. The back has the Suzuki logo. At the front, you get two buttons for locking and unlocking, complete with sound. From the front, the Swift looks quite appealing. You will find a ground clearance of 163 mm. The front features a gloss-finish grille. You can attach the number plate here. The Suzuki logo is now placed here. The headlights are projector-based, producing both high and low beams. You will find a yellow light setup here for your parking lights, and the side indicators are also present. There are no DRLs available, just some chrome accents. Fog lights are also not included in this variant, but you can add them as accessories. The bonnet looks like this, with two washers provided. The windshield is quite large. \n\nNow, regarding the price, this particular variant is priced at approximately ₹6,84,900. Currently, I am at Hindustan Auto Agency, which is available in Hazaribagh, Jharkhand. Here, the on-road cost is approximately ₹7,76,000. The prices I am mentioning are the latest. Previously, there was a price difference of about ₹10,000 this year. This means that the car has become more expensive than before, and regarding offers, you can expect a cash discount of up to ₹20,000 on this car. \n\nNow, if we talk about the side profile, the Swift looks quite premium. The tires in this variant come with black steel rims from MRF. The profile is 165/80 R14 inches. You get tubeless tires here, with disc brakes at the front and drum brakes at the rear. The side mirrors are fully body-colored with side turn indicators. The B-pillar is in matte black. From the back, the Swift looks quite attractive with its tail lights. The main parking light is LED, and you also get an LED main brake light. The reverse light comes with a bulb unit, along with the side indicator light. The reverse section only has parking sensors provided; you do not get a camera, but you can install it as an accessory. Inside, you can see that you get a touchscreen music system. The camera can also be added as an accessory. Here, you will find the Suzuki logo and branding for Swift. You only get a defogger here, and there is no washer. The good thing is that you have a high-speed shop lamp and a regular antenna. You can fill fuel from the left side, which has a capacity of 37 liters and supports petrol A20. \n\nLet's open the boot. To open the boot, you have a magnetic button and a request sensor. Here, you get a boot space of 265 liters, which is quite good. You also have five trays available. You will not find any boot light here, but there is space to install one as an accessory. The spare tire is a steel rim with the same profile as the tires outside, so there is no cost-cutting in that regard. \n\nNow that we have covered the exterior features and price differences, let's move on to the interior and see what features are available there. Starting with the passenger side door handle, you will find a body-colored door handle. The interior trim is in matte black, which looks quite good. There is a little space available here. You get power windows at the back, and the door lock button and speaker are chrome-finished. The seat color is all black, providing good comfort. You will find a bench-type seat in this variant, and there are no 60:40 split seats available. Integrated headrests are provided. For safety purposes, fabric seats are provided everywhere, which are quite comfortable. The seat length is also decent. You will find ISOFIX points in both seats. \n\nMoving inside, you will find decent legroom and thigh support. The driver’s seat does not have a pocket behind it, but the co-driver's seat has a small pocket. In the center, you have a bottle holder. There is a slight hump, but three people can sit comfortably here due to the good seat length. The dashboard looks quite attractive from the back. You will find front lights here, but no lights in the back. You only get a single regular bulb light. You have three grab handles, and you will also find curtain airbags on the sides. All variants of the Swift come standard with six airbags, ABS, EBD, traction control, etc. \n\nNow, let's check out the front row and see what features are available there. Starting with the driver side door handle, you will find a body-colored door handle with a request sensor. You can also unlock the car using the key. You have three request sensors available: one on the driver side, one on the co-driver side, and one in the boot. The interior trim is similar to the passenger side door, in matte black. The good thing is that you get fabric soft touch here, which is also available on both the driver and co-driver sides. You will find the door handle here, and you have controls for all four power windows. The good thing is that you get one-touch down and up for the mirrors. The lock/unlock button is available here. The side door mirrors are electrically adjustable and foldable. You also have chrome accents for the door opener, lock button, speaker, and bottle holder. \n\nThe dashboard looks quite attractive. The driver’s seat only has back adjustment. The front seats are quite comfortable, providing good shoulder support. If you sit in this seat, it will hold you well, offering great comfort. The texture is quite nice. The front seats also have adjustable headrests and airbags. You will find the engine start/stop button here, along with the traction control on/off button and the idle start/stop on/off button. You can adjust the headlights from here. Below, you have the fuel opener and front bonnet opener. The three pedals are also present, including a dead pedal. \n\nAfter entering, the dashboard looks quite good. Starting with the steering, you will find a flat bottom steering wheel that can only be adjusted up and down. You cannot adjust it forward and backward. The steering has the Suzuki logo in the center, and you will find one airbag here. On the left side of the steering, you have controls for telephony, and on the right side, you have controls for the headlights and wipers. This is the semi-digital meter console. On the left side, you have the tachometer, and on the right side, you have the speedometer. You will find a display showing the rear seat belt reminder and which door is open. You also have the time, odometer, and fuel gauge displayed. There are two buttons; with the right button, you can check the average range, and with the left button, you can check trip A, trip B, and the odometer. \n\nThis is the music system, which supports wireless Android Auto and Apple CarPlay. It comes with Bluetooth, FM, radio, USB, etc. You will find a great music system here with good touch response, and it is feature-loaded. This variant also offers the option of Suzuki Connect, through which you can track any issues with the car or monitor it. Additionally, you can view vehicle alerts and main warning alerts through this music system. It also supports Bluetooth voice commands. If you install a back camera, you can do so as an accessory. You will find matte finishing on the sides, and the hazard switch is available here. You have four AC vents in the front, and this variant comes with manual climate control. The good thing is that you have a max AC button here for quickly cooling the cabin. Below, you have a 12-volt charging socket and a USB socket, along with a little space. You have two cup holders here. This is the gear knob, a five-speed gear with one reverse. You will find a good gear knob here, along with a handbrake. \n\nRegarding glove box space, you will find decent space there as well. One airbag is also provided here. In the center, you have a day-night manual rearview mirror. Regular bulb lights are available here. On the driver side sun visor, you will find a mirror, and on the driver side, you also get a ticket holder. \n\nSo that was the exterior and interior features of the Swift's most value-for-money variant, the VXI Optional. What do you think of all these features? Please comment below. Now, let's talk about the engine section of this car. After opening the front bonnet, it looks like this. You will find engine insulation here, along with an engine guard. The battery is from Exide. \n\nRegarding the engine, it comes with a 1.2L Jet Series three-cylinder petrol engine that generates 80 bhp of power and 111 Nm of torque. You will find a good power figure here. Although the power figure might seem a bit low, the mileage is quite good. Speaking of mileage, it will give you between 20 and 25 km/l combined in the city and on the highway. \n\nWhat do you think of this car and this video? Please comment below. If you are also planning to check out a value-for-money variant of the Swift, do consider the VXI Optional, as it is the king in its segment. You get so many features in it. If you are new to the channel, please subscribe before you leave. See you in the next video. Until then, keep watching and stay safe.",
        "transcriptKeyMoments": [],
        "comments": [
          {
            "author": "@Humsafar--v1z",
            "text": "bhai swift LXi petrol 5.80 ex showroom price h aur on road 7.20 ki bta rhe showroom Wale 2026 model with extended warranty and assoeries ,kal he pta karke aaya hu mai ,rate badh gye kya, December to logo ne 6 Lakh se kam me bhi Lxi petrol wali liya h😢😢😢",
            "likeCount": 0,
            "publishedAt": "2026-01-16T04:56:47.720Z"
          }
        ]
      },
      {
        "videoId": "vlhDvO2EK54",
        "title": "New Maruti Swift - Should you buy?",
        "description": "In this video, we check out the all new Maruti Swift in detail! Dive in.\n\nWish to increase your car's mileage without compromise on performance? \nGet the TotalEnergies Quartz Engine Oil here: https://cutt.ly/GeeZanFN\n\n00:00 - INTRO\n00:35 - EXTERIOR\n04:05 - INTERIOR\n07:40 - SECOND ROW\n09:33 - DRIVE\n15:14 - VERDICT\n\nCar Consultancy Form: https://motoroctane.com/car-consultancy\n\nWant us to review your car/bike? Share your details -https://forms.gle/BAr48SScVUz9igkZ9\n\nTOP 5 Car Accessories for Your CAR:\n1. Dashcam: https://amzn.to/3G1beyC \nOR https://amzn.to/49EX1VY\n2. Tyre inflator https://www.amazon.in/dp/B074DDJFTH/ref=cm_sw_r_as_gl_api_gl_i_VXM7AZYFBF6W9F6WTAX7?linkCode=ml1&tag=motoroccom-21\n3. Vacuum cleaner: https://www.amazon.in/dp/B0BZ7YZ72D/ref=cm_sw_r_as_gl_api_gl_i_dl_WJ96449WCJM35RM3R2AD?linkCode=ml2&tag=motoroccom-21\n4. Torch: https://amzn.to/3QZOPIv\n5. Jumper cable: https://amzn.to/47aYDot\n\n\nFollow us on \nSubscribe us @ YouTube : http://bit.ly/MotorOctane\nFacebook: http://www.facebook.com/motoroctane\nTwitter: http://www.twitter.com/motoroctane\nInstagram: http://www.instagram.com/motoroctane\nYouTube: https://www.youtube.com/user/MotorOctane\n\nWebsite: https://motoroctane.com",
        "channelTitle": "MotorOctane",
        "publishedAt": "2024-05-16T05:30:29Z",
        "viewCount": "590077",
        "transcript": "Hey guys! Welcome to MotorOctane. How are you all today? Today I am very excited because I have brought a car review for you which we have thought that this is my dream car. Right? At some point of time, many of us thought that we should buy or drive a Swift once in our life. So today Maruti has launched a new generation Swift here. We have already brought its walkaround for you. Today we will talk about its review. Now let's see this car. This is a 4th generation Swift. Many changes have been made to it overall. Although, not much has been changed in its platform. But still, the weight of this car has increased by 20-25 kgs Depending on which variant you are looking at. If I tell you simply, if you look at its styling from the front, there is not much change in the car. There are small changes but the idea is that if you look at the first Swift, the first Swift of 2005 and today's Swift of 2024, then there should not be much change in the design. It should look like yes, it is a Swift family. So somewhere the styling of the headlamps is the same. But now it comes with projector LEDs, with daytime running LEDs. Your fog lamps are given LEDs. So overall, all the white lights come on the top model. Small changes have been made to its grille design. And along with that, the logo that used to come in the middle on the grille, has now been taken on top. Bonnet has been made a little smaller. So overall, small changes have been made to the design elements in the car. The biggest change on the car is the fact that now its engine has been shifted from 4-cylinder to 3-cylinder. I will tell you the details when I drive the car. But if I say in one line, Maruti says that we have done this to improve the fuel efficiency of this car. By the way, if you want to increase the mileage of your Car without compromising on its performance, then I recommend Total Energies Quartz 9000 Extra Engine Oil. Now this is a completely fully synthetic engine oil. And this comes with the latest eco-science technology, which increases the life of your engine. By the way, do you know that the start-stop system has become very common in cars these days? It also comes in Swift, right? So what does this do? It affects the life of your engine somewhere. In such a time, Quartz Engine Oil not only protects your engine, but also further enhances its life. In short, if I say, your expenses are reduced. By the way, to purchase this, I am leaving the Amazon link for you in the description. When we look at the side profile of this car, it looks like the existing Swift to a great extent. The ground clearance has not changed much, but our experience has been pretty good. The car has 15-inch wheels on the higher variants, and 14-inch wheels on the lower variants. And in the top-end model, you get alloy wheels. Okay, so you have disc brakes on the front, and drum brakes on the rear. Many people will criticize that disc brakes should be everywhere in this car, but it is not possible to do it at this price point. Maruti Should get Credit for not doing any Cost-cut For example, If I Talk about Passive door entry In this, you get both sides Left Right Both Sides you get Passive door entry which is a good thing about it. So overall, The rear styling is also similar to that of the car. LED tail lamps are present. One thing that I find off is that the big camera given by Suzuki to the people below, again, that could have been designed a little better. Now, Maruti has not cost-cut one more place, which is that it has four rear sensors. Mostly, what will the automakers do? They will give two in the front and two in the back, and will say that we have both types. Now, if we talk about its boot space, then the boot space of 265 litres is decent enough. It's not like really huge or very small. Maruti being smart, they have made the spare tyre a little thinner and smaller here, so that the boot space is also increased and their cost is also reduced overall. So the boot space is decent enough. There is also a light at the back. And to increase the boot space, a 60-40 split has also been made available. These are a lot of exterior things. Let's step into the car. Like the exterior of Swift, not a lot of changes have been made to the interior of the car. All the panels and everything must have been changed in the car, but you won't feel like this car is very different in look. We'll get into all of that. But first, let's understand, you get majorly hard plastics in this car. In this category, you get hard plastics in most cars. The fit and finish of the car is good. There is no shortage of touch and feel of materials. The materials are good. But if I talk about the design, then small changes have been made. Earlier, you used to get Swift in the touchscreen centre. Now, they have taken it up. They have given it a tablet-like look here. But we have experienced this screen in Maruti's other cars as well. The good thing is, for Swift, you get screens like this in the cars above this. Baleno, Ciaz, Brezza, Vitara, all of them have this screen. Which means, this screen is now available on the lower end as well, on a product like Swift. It's a 9-inch screen. There is no problem in usability. It's quite easy to operate. It has wireless Android Auto and Apple CarPlay. It also has reverse parking cameras, whose quality is decent enough overall. And you also get wireless mobile phone charging in this car. Now, Maruti's connected tech, it's called Suzuki Connect, has been offered in Swift as well. Which means, you get connected technology in the higher variant Swift. The instrument cluster is quite simple and basic. I feel, it should have been digital. And the middle elements, like torque and power, which we saw in Baleno in 2015, the car is completely black. Even then, the cabin doesn't feel tight or cramped. Because the roof area is completely light in colour. Apart from this, the steering wheel has leather wrap on the higher variant. You will even get leather wrap on the gear lever, on the manual version. Whereas, if I talk about the front seats, there is no major difference between the previous and current seats. The seats are soft and cushiony. The side support is also good. And overall, it's a very nice and comfortable seat to be on. I feel, the seats that Maruti upgraded in 2014-15, starting from the Baleno, the same type of seats are continuing today. Minor tweaking is done in Baleno and Brezza, but they are very nice and comfortable. So, this is a good thing. Swift has always been a feature-rich car. And the same is continuing in the current car as well. I share all the list of features with you. But, there are still a few things missing in this. So, for example, you don't get an auto day and night mirror here. Yes, the rear AC vents are now available. And you also get a USB and Type-C charging port in the back. So, there is a slight increase in features. But, if this car is coming at the price of Baleno, then it could have features like a 360 camera. In terms of safety features, there are a lot of new features in this car. The base variant has 6 airbags, which is ESC standard. Which means, the things that were missing in this car, for safety, entry-level variant, have now been introduced here. One thing that I find a little off in this car, is the door. See, if I open the door. Okay. So, if I do it a little slowly, it's not closing. There is a little effort in it. I still remember when the Baleno facelift came, Brezza facelift came, they improved its quality. And the sheet metal, even if I pressed it, it used to get stuck. Now, it's not getting stuck from the outside. Now, my height is 6 feet. And I'm adjusting the front seat, according to my driving seating position. I'm coming at the back now. The door opens wide for the car. So, getting in and out is quite comfortable. You can easily get in the car. You'll sit. But you'll notice that, overall, if a person like me sits in the back, they don't have a lot of knee room. So, tall passengers, if they sit in the front and back, it'll be a little tight for them. The seat is wide. The width of the car is good. So, there shouldn't be a problem for three people to sit in. Unless it's very tight. But, it's a nice and wide car. So, that's a good thing. Now, the car is wide. It's made for three people to sit in. So, there's a three-point seat belt for everyone. But, there's no headrest for the third passenger. I think, a lot of brands have a problem with visibility. But, at least, give a fixed headrest. At least, so that the third passenger can get some comfort if they sit in the middle. For those who sit in the middle, the problem is that, the AC vents are further back. Earlier, the AC vents didn't come. Now, the AC vents are further back. Overall, the centre tunnel is a little high. So, the person sitting in the middle won't enjoy sitting here. The recline of the seat is good. I don't have any complaints there. Overall, the headroom is good. But, the thigh support could've been better. Now, what Maruti has done is, the pockets behind the seat have been removed from here. But, they've given it on this side, on the left side. And, they've given it quite low. So, I'm not sure if there's anything other than the phone. Overall, the glass area in the car is quite good. Now, because it's a sporty car, there's not a lot of glass area in it. And, my only complaint is, where's the UV-cut glass? And, the passengers sitting in the back, they don't have any light in the cabin. It's only one light in the front. There's no light option in the back. So, I think that's a miss-out. But, like I said, the biggest change on the car is the engine. Now, it's time to drive it and I'm going to tell you, how good does it drive? So, let's go. So, now it's time to drive the Swift. I've started the car. Let's slow down the AC a bit. And, here we go. Let's rev the car a bit. The car goes up to 6000 RPM. Free flowing. Quite smooth. Okay, let's start talking about it. It has a 1.2 litre petrol engine Earlier it was a 4 cylinder, now it's a 3 cylinder So it's technically a brand new engine which Maruti has introduced I'll talk of everything here Right now, it only comes with petrol, 5-speed manual a 5 speed AMT There's no CNG on offer at the moment Eventually, CNG will be introduced In the future, they will introduce hybrid as well For better fuel efficiency Okay, so let's understand the engine It has a 1.2 litre engine If I go by the number, the power has reduced I'm not getting into that 10% power has been reduced It used to be 88 bhp, now it's around 80-82 bhp So 8-10% power has been reduced But does it affect the reality? No, it doesn't make a difference It's quite smooth to drive If you have power, if you want to overtake in the city or on the highway No problem, you can do that with a lot of ease So, what has been changed in the car? What has been changed in the engine? The first big change is that Earlier the engine was very free flowing I mean, press the accelerator And the engine was like waiting I want to go, I'm waiting, I'm waiting I want to go faster So, in that way, the engine was very free revving Now, that character has been reduced The free revving has been reduced somewhere Even now, the engine is free revving It is still one of the best 1.2 litre petrol engines in the category But the revving nature of a 4-cylinder engine It's shorter stroke, smaller in size, piston So, it revs well It's a bit technical for you But that is where the clear differentiation happened Now, is there a vibration in a 3-cylinder engine? Well, to a great extent, there isn't Because Maruti has already mastered it With the 1 litre Celerio, WagonR, Alto K10 So, they have already mastered the 3-cylinder technology to a great extent But when your car is static, not moving at all The engine is running And then, you will feel a slight vibration Yes, there are some vibrations in the car But when the door of the car is open That's when you start feeling a lot of vibration But apart from that, there is no such complaint You don't really hear a lot of noise The exhaust note has changed a bit If you listen to the exhaust Earlier, there was a sweet sound Now, there is a throaty noise So, that's what the Japanese engines used to be I don't feel that much in this It seems this has been made but not for real fun Sort-of a Drive Now, if I talk about this engine And I talk of the connection with the new buyers If a person is buying a Swift for the first time With the thought that I have heard about the Swift brand It's a good brand Let me buy this engine He or She will not miss the Older Engine They will not miss the engine Because they are getting all the power Now, if I talk about the other aspects of this car I have nothing to complain about The ride quality, the bad roads I drove I have no complaints There is no concern about handling The steering wheel is light You will drive in the city for a full day You won't get tired The feedback is recent enough There is no such complaint on the car If I put it up The important thing in the car is If you sit high, you won't see the edges of the bonnet The mirror size could have been a little bigger Which I feel is a miss out Fuel efficiency, according to my driving Since I have driven this car Since I have come on the highway I had reset the trip And I realised that let me push the car And I have been pushing I am driving 100, 120, 140 Now, when I am talking to you I am constantly driving between 70 and 90 So, overall I am still getting a mileage of 15 to 16 Which is fantastic Now, how does the AMT perform? So, AMT being AMT If you press the accelerator hard It will show you that the gear has shifted It has gone from 5th to 3rd But, actually it takes a little time Compared to a regular automatic gearbox So, AMT is much better than most of the other cars But, yes, AMT cannot be the best I mean, it's like AMT has the best gearbox But, just that In front of a normal automatic It feels a little weak And, its gear shifts in Tiptronic That is quite good And you get a good response in that So, if you really want to shift gears quickly You can rely on the Tiptronic technology Especially, if you want to shift 1 or 2 gears up and down Apart from that, just push it down It will change From 5th to 2nd gear Our car has come many times So, there is absolutely no problem with it Yes, its gear shifts are very fast Which will increase the overall fuel efficiency of the car And that's what this engine has been made for This gearbox has been made That we will shift gears quickly So, you will reach the 5th gear at a speed of 40-50 If you don't press the accelerator too much Now, I haven't completely tested the music system of this Car I have experienced it But, I can tell you It sounds really good I really like the audio quality of this It is not the best I mean, if you listen to it on high volumes It's not that good It's loud But, the depth is okay It's not like amazing when it comes to the depth in music But, if you want to listen to loud music You will like it So, if we talk about the safety Maruti has worked on it But, the Global NCAP score has not come yet Now, we won't get to see much of Global NCAP in the future Because, Bharat NCAP has come now By the way, this car Made in Japan car has been tested In Japan And, it got a 4-star rating In Japan NCAP But, in India Bharat NCAP has recently released a teaser Where they said that they are going to bring results of other cars And, there was a photo of this car in it So, because of this I feel There could be something coming up And, we will come to know very soon How much this car has scored According to me Maruti has worked very hard this time And, they are prepared Structural changes have been made in the car They have given 6 airbags They have given 3-point seatbelts So, it seems they are really preparing themselves That this time we will get a good score On the Swift But, all in all Till it doesn't come Let's wait and watch Okay Now, the question arises That you should not consider this car So, I will answer this in two parts If you look at its lower variants LXI, VXI Safety features have increased in the car Performance was always good There was no compromise in the mileage of the Swift In the car But, overall In these lower variants You have been focused more on safety In terms of extra safety features also Because of which A good choice is made there And, it's quite a value-driven option Whereas, if I talk about its higher variants ZXI, ZXI Plus There, I feel The value proposition Has become less somewhere Because, if I talk very straight up If you look at its top-end model And, Baleno's top-end model There is not much difference in their pricing There will be a maximum difference of 10,000 to 30,000 rupees And, there you have 16-inch tyres More space at the rear 360-degree camera And, you get some extra features Compared to the Swift Because of which It becomes a better value-driven proposition But, yes If you love the Swift brand Definitely, you should go ahead with this car This is a good improvement Over previous generations But, not if I talk about the features purely So, what are the major features in the features? Rear AC vents have been added A bigger screen has been added And, majorly, that's all about it So, this is what has changed in the car But, if Swift changes its formula Then, in that case Either, the price will increase Or, people won't like it So, this is what we had to share on the Swift And, we have got it for you If you are still confused Which car should you buy? Then, in that case You can join me or my team of experts On a phone call And, clarify all your doubts If you don't want to buy the wrong car And, you don't understand Who should I talk to? Then, in that case You can talk to us directly We will answer all your questions So, that you understand Which is the best car for me So, what do you have to do for that? Go to motoroc",
        "transcriptKeyMoments": [],
        "comments": []
      },
      {
        "videoId": "ZLEi1z3aVzc",
        "title": "Watch This Before You Buy the New Maruti Swift!",
        "description": "#marutisuzukiswift #history #cars24india\n\nTwo decades, four generations, and countless stories: in this episode of Past Forward, Utkarsh traces the evolution of the Maruti Suzuki Swift from the 2005 original cult to the 2024 new-gen Swift, and why it still nails that “small car, big joy” vibe. He covers design evolution, engines (G13BB, 1.3 DDiS Multijet, K12N DualJet, new Z12E), manual vs AMT (AGS), real-world mileage focus, features, safety additions (6 airbags, hill-hold), and the honest trade-offs (ride/handling feel vs comfort, and build quality concerns).\n---------------\nLoved the 2020 Maruti Suzuki Swift? Make it yours: https://bit.ly/4ovAhP5 \nExplore more Maruti Suzuki Swifts on the CARS24 website: https://bit.ly/4owbDxC \n---------------\n📽️ Chapters in this Video:\n0:00 – Introduction\n1:06 – 1st Gen Seift\n03:15 – 2nd Gen Swift\n04:50 – 3rd Gen Swift\n06:55 – 4th Gen Swift\n09:25 – Closing & Credits\n---------------\nWe Are Super Social ❤️\n• Facebook: https://www.facebook.com/cars24india/ \n• Twitter: https://twitter.com/cars24india \n• Instagram: https://www.instagram.com/cars24india/ \n• CARS24 Blog: https://www.cars24.com/blog/ \n• LinkedIn: https://www.linkedin.com/company/cars24/ \n---------------\nProducer, Writer, Host: Utkarsh Negi https://www.instagram.com/ut.cars.h \nDirector: Ashish Maan https://www.instagram.com/theashishmaan \nCamera: Harshit Maheshwari https://www.instagram.com/lenstreme & Jaswant Lamba https://www.instagram.com/itssmejassi \nEditor: Manish Kumar https://www.instagram.com/zapmanish  \n----------------\n🎥 Equipment & Gears\n• Camera 1: Sony A7Cii\n• Camera 2: Sony FX30\n• Lens: Sony G-Master 24mm f1.4, 50mm f1.4\n• K&F Concept Variable ND Filter\n• DJI RSC2 Gimbal\n• DJI Mic \n----------------\nMade With ❤️ By CARS24\n\n#marutisuzuki #swift #cars24 #cars24review\n----------------\n💡Related Searches\n• CARS24\n• CARS24 review\n• CARS24 buyer review\n• CARS24 buy used cars\n• CARS24 selling experience",
        "channelTitle": "CARS24",
        "publishedAt": "2025-11-09T15:31:12Z",
        "viewCount": "82383",
        "transcript": "Four generations, 20 years, and countless stories. This vehicle is not just a hatchback; it is India's default setting. [Music] [Music] [Music] Because some things never get old. Like a sip of hot tea, [Music] songs sung by Kishore Da, and the Maruti Suzuki Swift [Music] and today we will journey from its origin to its legacy in this episode of Past Forward. [Music] [Music] [Music] In 2005, Maruti Suzuki, which we will refer to simply as Maruti throughout the video, was painted with a sensible uncle image. But with the first-gen Swift, the attack happened suddenly. I mean, the uncle had pulled his shirt out and made a grand entry at the party. [Music] Low roof, chunky hips, airy design, and big [Music] uncomfortable seats. India saw for the first time that affordability and attitude can go [Music] hand in hand. The Swift was a project where [Music] engineers from India and Japan sat together from concept S to final completion. And the result was a global Suzuki but at heart [Music] an Indian Maruti. [Music] Initially, the Swift was offered only with [Music] a petrol engine. Its somewhat taut suspension and balanced handling earned it the title of a fun-to-drive car. And in 2007, when India was falling in love with diesel, the DDIS made its entry, the Fiat-sourced 1.3 L Multijet engine. Affectionately referred to as India's national engine. A bit of lag, a thump in the mid-range, and [Music] suddenly, the Swift became the people's budget hot hatch. From taxi drivers to [Music] enthusiasts, everyone was happy. Because fuel bills were low and smiles were wide. And this little god's 2010 update was compliant with BS4 emission norms. But here began a small conflict between feel versus comfort. Because some rawness from the steering was lost and the suspension became a bit softer. Hyundai was getting premium and refined but [Music] for some people, a little too sober. The Swift had the space but not the spark. And the promise of the Swift was simple. I’m fast. [Music] I’m fun and you can definitely take me home to your parents because they will love me. In 2011, the sequel arrived. Almost the same in appearance but everything under the skin was new. [Music] [Music] Better fuel efficiency with VVT, a tighter chassis, longer wheelbase, lighter body, and a nicer cabin. Maruti polished its cult and those who said it would just be a facelift were silenced by its drive. [Music] The petrol carried forward the 1.2K series now with [Music] VVT and the diesel also remained the same. The 1.3 DDIS. The 2014 facelift brought minor design updates and the company's confidence was high, and Maruti's product planning was maturing. [Music] Maruti touched up the core of the Swift [Music] not reinventing it. India wanted the same fun. Just improve NVH, give mileage, and make the interiors feel good. Rivals like the Brio came but the Swift stood tall with confidence [Music] and an engine lineup that just worked. [Music] In 2018, Maruti gave the third generation Swift a new diet with the new heart platform. [Music] [Music] Engine options remained the same with both petrol and diesel being offered with the same configuration and output as earlier. This particular 2020 LXI variant is petrol. So, to make this lovely rascal your own, call the number above. And with Cast 24's new 30-day return policy, we’ve got you covered for a hassle-free decision. And for the first time, Maruti introduced the AGS and AMT transmission in the Swift, meaning convenience for the masses, and there’s still a manual for enthusiasts. Maintain the balance. But 2020 came and BS6 emission norms said diesel would become expensive. So, Maruti closed the entire chapter on diesel. The mood of the story changed to Swift. Swift remained a petrol-only car. But it was about to get a lot smarter. Because the 2021 facelift brought a switch with a refreshed engine with dual jet and dual VVT. The third-gen Swift is the car where you don’t stop at the petrol pump while watching the stopwatch for joy. [Music] Tata was offering safety. Hyundai was offering premium-ness. And Maruti Swift stepped into the role of the cousin who is a bit mischievous but definitely listens to the elders. 2024 brings forth the fourth generation of the Swift, bidding farewell to four cylinders for even better fuel efficiency. Alliteration, I tell you. [Music] [Music] According to Maruti, the heart lineage has evolved. The whole car learns portion control without losing appetite because weight and emissions have been reduced. If the third gen was on a diet, then this one is on intermittent fasting. Maruti tried to inculcate a hint of grown-up vibe in this fourth-gen Swift which is nowhere close to luxury. But you can definitely call it smart simplicity. The manual love story is still alive because most buyers choose this trusted five-speed manual over the AMT. [Music] Because that is the core of the Swift. Small, shifty, nimble. The most fun is in driving the manual. Is it the fastest? No. Luxurious? No. But if a small car joy index were to be made, it would still score well. Because it still treats a U-turn like a dance move while putting up great fuel efficiency numbers. Am I happy about the three [Music] cylinders? No. This is definitely not something like the GRS. And honestly, Toyota has done madness with that car. But if you were expecting it to be like it, you have nobody else to blame but yourself. This is a fun, reliable, efficient, and fun-to-drive city car. Because Swift has proven that efficiency and fun [Music] can actually coexist. But it’s not a surprise that for it to happen, build quality has always had to take a back seat. [Music] 20 years ago, Swift taught India that sensible can be cool, and every generation has expressed this sentence in a different way. First swagger, then stamina, then diet, and now discipline. [Music] Is the Swift a perfect car? No, there are many ifs and buts. And the compromise in build quality is good for your pocket [Music] but enough to disturb your peace of mind. But every generation has given a lesson. Feel doesn’t just mean horsepower. Character doesn’t just mean badges [Music] and engineering doesn’t just mean specs. And if you can look at the bigger picture, you will see a truth that greatness is light. Sometimes in weight, sometimes in ego, and sometimes in fuel bills. Not all cars change big dreams. [Music] Some change small moments. Moments like an empty lane on the way to the office, a clean overtake, a late-night tea [Music] stop. And that’s the story of the Swift [Music]. Staying a little happy every day is the essence of this car. [Music] This was Past Forward with the Maruti Suzuki Swift. I am Utkarsh Negi. For more such videos, subscribe to Car 24. See you in the next one.",
        "transcriptKeyMoments": [],
        "comments": []
      },
      {
        "videoId": "yRxOWhDfXYI",
        "title": "🔥😱IGNIS FULL MODIFIED😍| NEXT LEVEL MODIFICATION🔥Mr. Bean Car☠️#shorts #ignis",
        "description": "",
        "channelTitle": "Rabbu vlogs",
        "publishedAt": "2024-08-02T16:55:00Z",
        "viewCount": "157151",
        "transcript": "The modification industry is ongoing, and this guy has installed twin exhausts and a spoiler in a way that you can see how far the spoiler extends. Along with that, you can also see the elements here.",
        "transcriptKeyMoments": [],
        "comments": []
      },
      {
        "videoId": "REpvfFtDrys",
        "title": "XBHP Gave Me 3 Super Bikes - Worth 60 Lakhs 🔥",
        "description": "Guys i have joined the Road Trip United 2022 for the leg Chennai to Hyderabad and XBHP Gave me 3 super bikes, so let the journey begin.\nAlso i met @ODIABIKER .\n\nSunny Bhaiya’s Channel - @MotoGrapherOfficial \n\nInstagram - https://instagram.com/fuelinjected918\nFacebook Page - https://m.facebook.com/fuelInjected918/\n\nEverything I Use - https://www.amazon.in/shop/fuelinjected\n\nPlease Like, and Comment.\n#roadtripunited2022\n#superbikes\n#FuelInjected",
        "channelTitle": "Fuel Injected",
        "publishedAt": "2022-11-30T04:30:03Z",
        "viewCount": "14396",
        "transcript": "[Music] Hello, I want to come back to the channel. So right now I’m in Chennai. What am I doing in Chennai? If you remember, in 2021 we had a ride with XBHPI. It was called the Road Nitted. In that ride, we went from Mumbai to Ahmedabad. During that ride, we had a blast riding the H2, meeting up with people, and it was a lot of fun. So, we are doing it again, and this time things are crazy and the superbike lineup has changed and grown. I will show you all the bikes, and this time it’s going to be even more fun. This time I’m doing Chennai to Hyderabad, so my route is different. I am very excited to join the road trip united 2020. First, let me show you the lineup of bikes. Let's go!\n\nThis is the Taj Club House in Chennai. Now I will show you the entire lineup. If you remember, last time we had two Thars; this time we have three Thars, so three Thars will be part of the lineup, which is great. Now, if I take you here, all the motorcycles are parked. So, the first thing we have here is the Tiger, next to which is the Hayabusa. Just look at its size; the Hayabusa is literally half the height and width of the Tiger. It’s crazy! This bike has so many features, and we will talk about all of this when we do a dedicated video on this motorcycle. \n\nNext, we have the third-generation Suzuki Hayabusa. This motorcycle is so special because no matter what motorcycle lover you are, you can't ignore this bike. This is an absolutely beautiful machine. The size of this motorcycle is absolutely crazy; it’s so wide and big. Just look at the size and presence of this thing, it’s absolutely insane. \n\nThen we have the TVS Apache RR310, which was also with us last time. It’s a very powerful motorcycle again coming from an Indian manufacturer. Then we have a new entrant, the Bajaj Pulsar F250. I recently made a video on this as well; it’s a very capable motorcycle. I rode it a lot during the last trip, so we will ride it again. \n\nThen we have the Triumph Speed Triple. This is literally a monster motorcycle with the amount of power it has and all the best components. You can see here, again, there are so many features. We will talk about it in detail when we ride it. \n\nHere we have a Kawasaki Ninja 1000. This is not from our group, but it belongs to a random person whose YouTube name is written here. So this is the whole lineup, and one bike is missing, which is the TVS and Talk, which has gone for servicing. So that’s the only thing missing; otherwise, here is our entire lineup: Tiger 1200, Hayabusa, Apache, Pulsar F250, Speed Triple. We are going to ride all these motorcycles, and it’s going to be a lot of fun. I’m really looking forward to it.\n\nSo guys, this was the entire lineup. I hope you are as excited as I am. We will ride these bikes and have a great time. Now, I haven't done much today. I left home at 5:00 AM, caught a flight, and came to Chennai, so I’m really tired. I will take a short nap now. \n\nTomorrow we have a meetup in Chennai at 8:00 AM, so we will leave around 7:00 AM to meet you all. It’s going to be fun as it always is. Right now, I’m with an Odia biker. I’ve noticed that people from Odisha are very friendly. It feels like I’ve known them for ages even though it’s our first conversation. \n\nWe are sharing a room, and tomorrow morning we will head out for the meetup. Nothing much else for now. You all should subscribe to Fuel Injector. I didn’t quite understand what he said, but it was nice interacting with him. \n\nI’ve seen that people from Odisha are very friendly. [Thank you, thank you, thank you!] What’s your channel name? I watch 94. Okay, thank you! Everything is good. \n\nI just got a call from a friend, and he was on a video call. He showed me his subscriber count, and I was really happy. It feels great to know that I have a large fan base. People from Odisha follow those who create detailed and informative videos, and they appreciate what I do. \n\nSo, I’m thinking of making a trip to Odisha someday. After this trip, I might announce a trip there. I’ve been invited by many people in the comment section. It’s amazing how people are so welcoming. I feel like I’m living in India, but I don’t know much about Odisha. The real secrets of India are so beautiful, and I want to explore them. \n\nNow, we are heading to the first meetup for me. There have been two other meetups, but this is my first. I will be riding the TVS and Talk. I rode it last time as well, and I’m excited to see how it performs with JK tires. \n\nLet’s go! The meetup location is only 800 meters away, so I thought we could ride there. The sound of these bikes starting up is amazing. It feels exhilarating. \n\nThe Speed Triple is running behind, and the sound is impressive. The JK tires are performing really well. I leaned into a turn, and the bike didn’t lose control at all; it held the grip nicely. Tires are very important because when you go on long trips, if your tires aren’t good, you won’t feel confident or enjoy the ride. \n\nThe Pulsar F250 is a very capable motorcycle, especially for touring. I recently made a video about it, so you can check that out too. The meetup was crazy; many superbikes showed up, and it was a lot of fun to see them all. \n\nNow we are going to refuel the bikes. Right now, I’m riding the Pulsar F250 again. It’s a very capable motorcycle, great for touring. I thought fewer people would know us in Chennai, but many came to meet us, which was nice. \n\nThere’s a bit of a language barrier, but it’s great to see that people understand and appreciate what we do. It was an amazing meetup. \n\nI think I’ll end this video here because tomorrow we will start riding towards Vijayawada, which is about 470 km away. I’ll be riding different bikes, so there will be separate videos for that where we will talk about each bike in detail. \n\nLet me know in the comments how you liked this video. Don’t forget to like, subscribe, and hit the bell icon. See you in the next video, and as always, ride hard, ride safe! Bye-bye!",
        "transcriptKeyMoments": [],
        "comments": []
      },
      {
        "videoId": "VUphoCgYBvU",
        "title": "2026 Maruti Suzuki Swift CNG Base Model Ownership Review 💯 | Pros & Cons Swift Cng | New Swift vxi ",
        "description": "2026 Maruti Swift CNG Base Model Ownership Review 💯 | Pros & Cons Swift CNG | Swift VXi CNG Owner Review | RNK AUTOS\n\nThe 2026 Maruti Swift CNG has arrived in a completely new avatar—with better mileage, a refined engine, and practical everyday usability! In this video, we bring you a Real Ownership Review in RNK AUTOS' 5P Breakdown Style—where each point will tell you whether the Swift CNG is the right car for you or not!\n\nIf you are looking for a budget-friendly, high-mileage, and low-maintenance hatchback, this video will provide you with a complete roadmap.\n\n⸻\n\n⭐ P1 – Purchase Experience\n\nIn this section, we cover:\n• 2025 Swift CNG Base Model on-road price details\n• Waiting period & delivery timeline\n• Real dealership behavior & discount possibilities\n• CNG kit quality, fit & finish, and warranty coverage\n• Why many buyers still prefer Swift CNG as their first choice\n\n⸻\n\n⭐ P2 – Performance (Engine + Mileage)\n\nHow does the Swift CNG's 1.2L DualJet Engine perform? In the video, you will find:\n• City + highway mileage figures (real owner reported)\n• Power dip in CNG mode – how noticeable is it?\n• Pickup, overtaking, and AC performance\n• Engine noise & vibration levels\n• Petrol vs CNG performance difference\n\nThis section will give you a clear idea of how the Swift performs in daily life with CNG.\n\n⸻\n\n⭐ P3 – Practicality (Space + Usability)\n\nThis part is the most important—can the Swift CNG become your daily family car?\n• Boot space with CNG cylinder\n• Rear seat comfort, cushioning & space\n• Suspension quality on bad roads\n• Ground clearance issues?\n• City traffic drivability\n• Running cost per km calculation\n\nThe practicality test is based on real-life situations—office commute, student use, family travel, everything is covered.\n\n⸻\n\n⭐ P4 – Pros & Cons (Honest Breakdown)\n\nRNK AUTOS' favorite part—no sugar coating, only reality!\n\n✔ Pros\n\n• Highest mileage in the segment\n• Low running cost\n• Smooth Maruti engine\n• Extremely affordable service cost\n• Easy to drive for beginners\n• Strong resale value\n\n✘ Cons\n\n• Power drop on CNG\n• Limited features in the base model\n• Very limited boot space\n• Highway overtakes require planning\n• Average interior quality\n\n⸻\n\n⭐ P5 – Personal Feedback (RNK AUTOS Verdict)\n\nOur personal recommendation from RNK AUTOS:\nThe Swift CNG is a perfect budget-friendly, practical hatchback for those who want:\n✔ Low running cost\n✔ Zero-nonsense reliability\n✔ Daily city commutes\n✔ Long-term peace of mind\n\nIf your priority is performance + features, you should also consider the petrol variant. But if your driving is daily and you want to save costs—Swift CNG is a top pick in 2025.\n\n⸻\n\n🔥 VIDEO CHAPTERS\n\n00:00 Previews (Swift CNG Ownership)  \n02:32 P1 Purchase (Why Swift)  \n05:54 P2 Performance (Engine, Gear, Mileage)  \n13:47 P3 Practicality (Features, Quality, Boot)  \n20:48 P4 Pros & Cons (Problems)  \n27:06 P5 Personal Feedback (Real Truth)  \n\n⸻\n\n📌 In This Video  \n2025 Maruti Swift CNG review, Swift CNG base model review, Swift CNG VXi 2025, Swift CNG ownership review, Swift CNG pros and cons, Maruti Swift CNG mileage test, Swift CNG real review, 2025 Swift CNG India, Swift CNG owner review RNK AUTOS, Maruti Suzuki Swift CNG 2025 review, Swift 2025 CNG performance, Swift VXi CNG review, 2025 Swift CNG walkaround, Swift CNG base model features, Swift CNG price 2025, Swift CNG practicality, Swift CNG range per kg, Swift CNG long-term review\n\n⸻\n\nIf you want to see more real ownership reviews, genuine buying advice, and the latest car launches—make sure to Like | Share | Subscribe to RNK AUTOS! 🚗💨\n\n#MarutiSuzukiArena #EpicNewSwift #Swifting #TimeToGoSwifting #MarutiSwiftOwnershipReview",
        "channelTitle": "RNK AUTOS",
        "publishedAt": "2025-11-28T12:01:09Z",
        "viewCount": "12417",
        "transcript": "As soon as we press the clutch, the car starts to feel heavy. It's always been my habit to lift the car a lot, but even then, the biggest issue is that the spare tire has stopped coming with the car. As soon as you reach 120, the steering starts to feel heavy. I'm going to file a complaint about this at the service center. How can there be so many issues right from the start? If you turn on the AC while driving in summer, the car struggles. Let me tell you about a scam where I was asked to scratch a coupon. Look at this seat cover; this is my original seat. And look at this, it's a joke. Hello team RNK, my name is Nitin. Friends, the car I have with me today is very special. It used to be India’s most favorite hatchback, the Swift. But since the new Swift came out, it hasn't received as much love as its previous version. What happened that the sales aren't as high as before? In today’s video, we will talk to the owner about their experience with this car, why they bought it, what has been good and bad, and whether their decision was right or wrong after driving it for a while. If you are thinking of buying a Swift and have any questions or queries, this video will answer all of them. Just make sure to watch it till the end, and before that, subscribe to the channel and like the video. This way, you won't waste your money and can buy a good car. Let's meet the lovely owner of this car. \n\nHello friends. Welcome to RK Autos. How are you? I'm doing great. How about you? I'm good too. So, you have bought India’s most favorite hatchback. It used to be loved a lot, but now it’s not getting as much attention. There’s a lot to discuss. We will learn everything about it. First, I would like to start the video with your introduction. So, tell our lovely audience about yourself. \n\nAs my brother mentioned, my name is Yash. I’m from Uttam Nagar, and I work in Gurgaon. My family is here, and I belong to Rajasthan. \n\nOkay, Yash. We will structure this video into five pieces of ownership so that everyone can know what they want. First, we will discuss the purchase experience. Second, we will talk about performance, engine, mileage, etc. Then we will look into practicality—whether the features provided by the company are genuinely useful or if they could have offered something better. In the fourth part, we will discuss the pros and cons. Every car has its shortcomings, and it's good to mention them. Lastly, we will have personal feedback about whether the experience has been good or bad after buying this car. \n\nSo, let’s start with the purchase story. Nowadays, SUVs are trending, both small and big. How did you decide to buy this car, and what was its competition? The main purpose was to go to work. \n\nOkay, so the distance to your office is quite a lot. It’s around 40 km one way. You must have heard of the Rapid Metro in Gurgaon, right? \n\nYes, I have. It’s around 7 to 8 km from there. \n\nSo, based on your daily budget, you found Swift to be a good option because of its average mileage. \n\nYes, I chose this car thinking about the mileage. Other options like the Tiago and Hyundai i10 also provide good mileage. But we were crazy about the previous Swift. \n\nSo, you thought you would get something good and new with this car. The interior and body have completely changed. The front and back are different. They have narrowed the space a bit inside. \n\nPeople say that Swift has always been inspired by the Mini Cooper. \n\nSo, for you, this is your Mini Cooper! [laughter] \n\nSo, how do people like it? \n\nIt has caught attention. \n\nHow is it in terms of looks? \n\nLooks-wise, it has become more attractive than before. \n\nOkay. We will discuss performance and pickup later. The average is still the same as before, and we will learn everything about that. \n\nSo, Yash, tell the audience which variant you have, what fuel it uses, and how much it cost you on-road? \n\nI took the VXI variant in CNG. \n\nOh, the VXI CNG, which is the base model of Swift in CNG. \n\nYes, it starts from the base. \n\nWhat was the overall price? \n\nIt cost me ₹8,58,952. \n\nYou calculated it exactly. \n\nYes, I made sure to mention every penny. The company gave some discounts, and now the GST has decreased. \n\nSo, the discounts might have increased? \n\nYes, they might have increased. \n\nDid you receive any coupons or anything? \n\nI received a scratch card coupon. I will tell you about it later. \n\nAccessories, etc.? \n\nOverall, it cost me around ₹45,000. \n\nYou will tell us later if there is any scam involved? \n\nYes, there was a small scam regarding the coupon. \n\nSo, now let’s move to the second part, performance. \n\nIt has cost me around ₹8,600. \n\nNow, regarding performance, because no matter what car it is, the engine is the heart and lungs of the vehicle. \n\nThe biggest issue people mentioned was that this car has a three-cylinder engine instead of the previous four-cylinder engine. \n\nYes, people criticized it a lot. Some even said they gave a plastic engine in this car. \n\nOn paper, the company claims it has 100 Nm of torque and 60 BHP of power. \n\nBut that’s not true. I have owned the previous Swift for two years and drove it a lot. \n\nIn three months, I have already driven 11,000 km. \n\nThat’s a lot! \n\nYes, I have regular trips to Rajasthan, and the long-distance commute is significant. \n\nThe previous Swift had a good braking system, but this one doesn’t have the same power. \n\nThe braking system is okay, but the power is lacking. \n\nIf you turn on the AC while driving in summer, the car struggles. \n\nIf you go uphill or on an overpass, the car struggles. \n\nIf four people sit together, the car will struggle. \n\nYou have to shift down to second gear to get it moving. \n\nPeople say that at low RPM, it feels like the car isn’t even moving. \n\nI have complained about this to the service center, as it’s a new car. \n\nThere shouldn’t be any issues in a new car, whether it’s electrical or wiring. \n\nThe mirror adjustment is smooth, but the other one has a ticking sound. \n\nI will file a complaint at the service center about this issue. \n\nNow, regarding the engine, you mentioned a lot of vibrations. \n\nLet’s check it live. \n\nYou opened the hood. \n\nLook at the vibrations; they are excessive. \n\nIs it running on petrol or CNG? \n\nIt’s on CNG right now. \n\nLet’s switch to petrol. \n\nOkay, let’s switch to petrol. \n\nNow, let’s see how it performs. \n\nOkay, now it’s on petrol. \n\nHow fast have you taken it? \n\nI touched 155 km/h on Dwarka Expressway. \n\nThe previous Swift didn’t take as long to accelerate. \n\nThis one feels like I’m pushing it hard. \n\nThe performance isn’t as enjoyable. \n\nYou need a car that feels good to drive. \n\nForget about the old Swift’s pickup; you won’t find that here. \n\nIn CNG, it feels like an e-rickshaw. \n\nSo, you bought this car mainly for mileage, right? \n\nYes, the company claims 20 to 22 km/kg on CNG and around 18 to 20 km/l on petrol. \n\nBut you feel it gives around 26 to 27 km/kg on CNG? \n\nYes, I have personally experienced it. \n\nI have to fill up in Rajasthan, and I still have fuel left. \n\nWhat about petrol mileage? \n\nI haven’t experienced it much, but I think it’s around 20+. \n\nIs there noise insulation in the cabin? \n\nThere is a slight noise at low speeds and high speeds. \n\nWhat about the CNG tank? \n\nIt’s a bit embarrassing; the design is odd. \n\nYou have to find the right side at the CNG pump. \n\nIt’s a strange design choice. \n\nHow much CNG can it hold? \n\nIt depends on the pressure, but I’ve filled it with a maximum of 7 kg. \n\nWhat about the ground clearance? \n\nIt’s 163 mm, which is quite low. \n\nDoes it give you confidence while driving? \n\nOnce you reach 120, the steering feels heavy, and you lose confidence. \n\nHow is the braking experience? \n\nThe braking is not good at all. \n\nIt doesn’t give confidence at low speeds, and at high speeds, it’s even worse. \n\nNow, let’s move to the third part, practicality. \n\nThe boot space is claimed to be 265 liters. \n\nWhat’s the reality? \n\nLet’s check it out. \n\nSafety hasn’t been prioritized at all. \n\nThe spare tire is no longer included. \n\nThere’s only a puncture kit, which is a one-time use. \n\nI can’t carry all the necessary equipment. \n\nThe spare tire space is gone, and they could have designed it better. \n\nHave you seen the Tata ICNG? \n\nYes, it has two cylinders and a spare tire. \n\nThe boot space is a waste. \n\nIt’s not sufficient for a family. \n\nThe CNG tank is placed awkwardly. \n\nLet’s check the back seat. \n\nIs it a proper three-seater or just two plus one? \n\nIt’s more like two plus one, as it’s not spacious. \n\nThe suspension is soft, but it’s not comfortable. \n\nNow, let’s talk about the features. \n\nWhat are your favorite features? \n\nThe AC controls are better than before. \n\nWhat feature do you wish it had? \n\nIf the interior was a bit bigger, it would have been better. \n\nHow is the gear shift and clutch performance? \n\nThe clutch performance is good, but it makes a noise. \n\nI’ve complained about it, but the problem persists. \n\nThe windows have a lot of vibrations. \n\nThis is a new car, and it shouldn’t be like this. \n\nWhen I turn on the AC, the car vibrates even more. \n\nIf I drive with my family, the car struggles even more. \n\nAfter driving 11,000 km, what’s your overall experience? \n\nI feel like I didn’t get my money’s worth. \n\nI should have gone for a Tata Altros instead. \n\nIf someone is looking for mileage, they can go for it. \n\nBut if they want performance, they should avoid it. \n\nThe Swift is good for daily commuting, but not for enthusiasts. \n\nThank you for sharing your honest feedback. \n\nIf you have any questions, feel free to ask in the comments. \n\nLet’s wrap up the video. Ride safe, drive safe. Thank you, Yash.",
        "transcriptKeyMoments": [],
        "comments": []
      }
    ],
    "total_videos": 12,
    "total_comments": 29
  },
  "webSearch": {
    "specs": {
      "query": "Maruti Swift specifications engine power torque mileage india 2026",
      "results": [
        {
          "title": "Maruti Swift Specifications - Dimensions, Configurations, ...",
          "url": "https://www.cardekho.com/maruti/swift/specs",
          "snippet": "Key specifications of Maruti Swift ; ARAI Mileage, 25.75 kmpl ; Fuel Type, Petrol ; Engine Displacement, 1197 cc ; No. of Cylinders, 3 ; Max Power, 80.46bhp@5700rpm.",
          "source": "www.cardekho.com"
        },
        {
          "title": "𝗠𝗮𝗿𝘂𝘁𝗶 𝗦𝘂𝘇𝘂𝗸𝗶 𝗦𝘄𝗶𝗳𝘁 - Price 2026, Mileage, Specs ...",
          "url": "https://www.autocarindia.com/cars/maruti-suzuki/swift",
          "snippet": "Maruti Suzuki Swift Features and specifications ; Mileage. 24.8 kmpl - 32.85 km/kg ; Engine. 1197 cc ; Fuel Type. CNG, Petrol ; Transmission. Manual, AMT Auto.",
          "source": "www.autocarindia.com"
        },
        {
          "title": "Maruti Swift Price - Images, Colours & Reviews",
          "url": "https://www.carwale.com/maruti-suzuki-cars/swift/",
          "snippet": "Maruti Suzuki Swift Key Specifications: ; Engine, 1197 cc ; Transmission, Manual & Automatic (AMT) ; Mileage (ARAI), 24.8 to 25.75 kmpl ; Power, 80 bhp ; Torque ...",
          "source": "www.carwale.com"
        },
        {
          "title": "Maruti Suzuki Swift Specifications 2026",
          "url": "https://www.91wheels.com/cars/maruti/swift/specifications",
          "snippet": "Swifts 3 cylinder, 1197 cc, Z12E with ISS 80.5 bhp @ 5700 rpm can generate power and 111.7 Nm @ 4300 rpm torque. It has a fuel tank capacity of 37 Litres.",
          "source": "www.91wheels.com"
        },
        {
          "title": "Maruti Swift Review 2026: Price, Mileage, Specs & Features",
          "url": "https://autogyandigital.in/maruti-swift-review-2026-price-mileage-specs-features/",
          "snippet": "Key Specifications of Maruti Swift ; Cylinders, 3 ; Max Power, 80.46 bhp @ 5700 rpm ; Max Torque, 111.7 Nm @ 4300 rpm ; Transmission, 5-Speed Manual ...",
          "source": "autogyandigital.in"
        },
        {
          "title": "Maruti New Swift 2026 Launch: 1.2L Petrol Engine & 33 ...",
          "url": "https://www.facebook.com/altaf.altafkhan.9862/posts/maruti-new-swift-2026-launch-12l-petrol-engine-33-kml-mileage-for-budget-buyers-/2031517237623391/",
          "snippet": "1.2L Petrol Engine with 89 bhp, offering a balance of power and fuel efficiency. 33 km/l Mileage, making it one of the most fuel- efficient cars ...",
          "source": "www.facebook.com"
        },
        {
          "title": "Maruti Swift 2026: New Hybrid Power, 38 km/l Mileage ...",
          "url": "https://siddharthaenterprises.in/maruti-swift-2026/",
          "snippet": "Explore Maruti Swift 2026 features, hybrid engine, 38 km/l mileage, premium interior and tech upgrades in a complete Indian hatchback guide.",
          "source": "siddharthaenterprises.in"
        },
        {
          "title": "Maruti Suzuki Swift 2026 New Model: 28km/l Mileage ...",
          "url": "https://expertsinqa.in/maruti-suzuki-swift-2026-new-model-28km-l-mileage-stylish-hatchback-and-full-specs/",
          "snippet": "Maruti Suzuki Swift 2026 New Model: 28km/l Mileage, Stylish Hatchback and Full Specs ; Power Output, 85–90 PS ; Torque, 110–115 Nm (expected).",
          "source": "expertsinqa.in"
        },
        {
          "title": "Maruti Swift Price (2026) - Images, Colours, Mileage & ...",
          "url": "https://auto.hindustantimes.com/new-cars/marutisuzuki/swift",
          "snippet": "Maruti Suzuki Swift Specifications and Features ; Max Torque, 101-117 Nm ; Transmission, Manual,Automatic ; Mileage, 24.8 kmpl ; Engine, 1197 cc ; Fuel Type, Petrol, ...",
          "source": "auto.hindustantimes.com"
        },
        {
          "title": "Maruti Swift Lxi Price, Features, Review - MyCarHelpline",
          "url": "https://www.mycarhelpline.com/index.php?option=com_newcar&view=product&Itemid=2&id=8&vid=187",
          "snippet": "All New Swift Lxi is powered by 1.2 Litre Z Series, 3 Cylinder Petrol Engine having peak power output of 82 PS with torque of 112 NM with claimed mileage of ...",
          "source": "www.mycarhelpline.com"
        }
      ],
      "searchedAt": "2026-01-16T04:54:38.323Z"
    },
    "variants": {
      "query": "Maruti Swift variants price list all models india 2026",
      "results": [
        {
          "title": "Maruti Swift Variants - Maruti Swift Base Model & Top ...",
          "url": "https://www.cardekho.com/maruti/swift/variants.htm",
          "snippet": "Maruti Swift variants price list ; Swift LXi(Base Model)1197 cc, Manual, Petrol, 24.8 kmpl1 Month waiting, ₹5.79 Lakh · Get On-Road Price. Key Features. Halogen ...",
          "source": "www.cardekho.com"
        },
        {
          "title": "Maruti Swift Price - Images, Colours & Reviews",
          "url": "https://www.carwale.com/maruti-suzuki-cars/swift/",
          "snippet": "Maruti Swift Variants ; Swift LXi. 24.8 kmpl, 80 bhp, Petrol, Manual, 1197 cc. Get Offers from Dealers. Rs. 5.79 Lakh. Compare ; Swift VXi. 24.8 kmpl, 80 bhp, ...",
          "source": "www.carwale.com"
        },
        {
          "title": "Swift Petrol and CNG Price in India - Maruti Suzuki",
          "url": "https://www.marutisuzuki.com/price-list/swift-price?srsltid=AfmBOoqi_HTeINort66Gt1Ob-coM8Fwnx78fOJcNVrF1AmYTutud5RsD",
          "snippet": "Maruti Suzuki Swift Price and Variants : Visit Maruti Suzuki Arena ... *Please check Swift price list as these features may vary across variants.",
          "source": "www.marutisuzuki.com"
        },
        {
          "title": "Maruti Suzuki Swift Variants & Price List in India 2026",
          "url": "https://www.team-bhp.com/new-cars/maruti-suzuki/swift/variants/",
          "snippet": "Base Variant. SwiftLxi. 1197cc. 24.8kmpl. 80.4bhp · SwiftVxi. 1197cc. 24.8kmpl. 80.4bhp. ₹6.59 Lakh · SwiftVxi (O). 1197cc. 24.8kmpl. 80.4bhp. ₹6.85 Lakh · Swift ...",
          "source": "www.team-bhp.com"
        },
        {
          "title": "Maruti Suzuki Swift 2026 - Latest Update, Price List & Specs",
          "url": "https://www.v3cars.com/maruti-arena-cars/swift",
          "snippet": "The ex-showroom prices of the 2026 Swift start from ₹5.79 lakh for the LXI variant (Base Model) with the 1.2L naturally aspirated petrol engine ...",
          "source": "www.v3cars.com"
        },
        {
          "title": "Maruti Suzuki Car Price in India - Nexa Models 2026",
          "url": "https://www.carwale.com/maruti-suzuki-cars/",
          "snippet": "Maruti Suzuki Cars Price List (January 2026) in India ; Maruti Suzuki Swift, Rs. 5.79 Lakh ; Maruti Suzuki Victoris, Rs. 10.50 Lakh ; Maruti Suzuki Dzire, Rs. 6.26 ...",
          "source": "www.carwale.com"
        },
        {
          "title": "Maruti Suzuki Swift Price 2026 - ACKO Drive",
          "url": "https://ackodrive.com/cars/maruti-suzuki-swift/",
          "snippet": "Top variantZXi Plus AMT · Automatic · 25 kmpl · ₹9,68,095 ; Base variantLXi · Manual · 24 kmpl · ₹6,37,892 ; VXi · Manual · 24 kmpl · ₹7,42,767.",
          "source": "ackodrive.com"
        },
        {
          "title": "𝗠𝗮𝗿𝘂𝘁𝗶 𝗦𝘂𝘇𝘂𝗸𝗶 𝗦𝘄𝗶𝗳𝘁 - Price 2026, Mileage, Specs ...",
          "url": "https://www.autocarindia.com/cars/maruti-suzuki/swift",
          "snippet": "Maruti Suzuki Swift price starts from ₹5.79 lakh (base model) and goes upto ₹8.65 lakh (top variant). Check Swift on road price for both petrol and CNG ...",
          "source": "www.autocarindia.com"
        },
        {
          "title": "Maruti Swift Price (2026) - Images, Colours, Mileage & ...",
          "url": "https://auto.hindustantimes.com/new-cars/marutisuzuki/swift",
          "snippet": "Maruti Suzuki Swift price starts at ₹ 5.79 Lakhs and goes up to ₹ 8.8 Lakhs (Ex-showroom). Maruti Suzuki Swift comes in 14 variants. Maruti Suzuki Swift's top ...",
          "source": "auto.hindustantimes.com"
        },
        {
          "title": "Maruti Suzuki Swift Price in India 2026",
          "url": "https://www.cars24.com/new-cars/maruti-suzuki/swift/",
          "snippet": "Swift variants : price & spec cards ; Lxi · ₹5.79 Lakh · Key features ; Vxi · ₹6.59 Lakh · Pay ₹80K moreto get these features ; Vxi (O) · ₹6.85 Lakh · Pay ₹26K moreto ...",
          "source": "www.cars24.com"
        }
      ],
      "searchedAt": "2026-01-16T04:54:39.014Z"
    },
    "pricing": {
      "query": "Maruti Swift on road price ex showroom delhi mumbai india 2026",
      "results": [
        {
          "title": "Maruti Swift On Road Price in Mumbai starts Rs.5.79 Lakh",
          "url": "https://www.cardekho.com/maruti/swift/price-in-mumbai",
          "snippet": "Maruti Swift Price in Mumbai ; VXi CNG (CNG) (Base Model) ; Ex-Showroom Price, Rs.7,44,900 ; RTO, Rs.52,143 ; InsuranceThe Insurance amount is calculated based the ...",
          "source": "www.cardekho.com"
        },
        {
          "title": "Maruti Swift Price in Mumbai",
          "url": "https://www.carwale.com/maruti-suzuki-cars/swift/price-in-mumbai/",
          "snippet": "The on road price of the Swift in Mumbai ranges from Rs. 6.83 Lakh to Rs. 10.30 Lakh. The ex-showroom price is between Rs. 5.79 Lakh and Rs. 8.80 Lakh.",
          "source": "www.carwale.com"
        },
        {
          "title": "Maruti Swift On Road Price in New Delhi starts Rs.5.79 Lakh",
          "url": "https://www.cardekho.com/maruti/swift/price-in-new-delhi",
          "snippet": "Maruti Swift Price in New Delhi ; Ex-Showroom Price, Rs.7,44,900 ; RTO, Rs.70,291 ; InsuranceThe Insurance amount is calculated based the engine size/battery size ...",
          "source": "www.cardekho.com"
        },
        {
          "title": "Maruti Swift Price - Images, Colours & Reviews",
          "url": "https://www.carwale.com/maruti-suzuki-cars/swift/",
          "snippet": "Maruti Swift gets a GST price revision of up to Rs. 84,600. Its new ex-showroom starting price is Rs. 5.79 lakh, down from Rs. 6.49 lakh earlier. 2:48 pm Sep 22.",
          "source": "www.carwale.com"
        },
        {
          "title": "Swift Petrol and CNG Price in India - Maruti Suzuki",
          "url": "https://www.marutisuzuki.com/price-list/swift-price?srsltid=AfmBOoqmHvfg558JXstQFV1pBk3LpVbYHWBPC3Dl20c5cPU-5j6kjNoP",
          "snippet": "Maruti Suzuki Swift Price · ₹ 5.79 Lacs* Onwards. *Ex-showroom price - Delhi · VARIANT · METALLIC ()* · NON-METALLIC ()* · Dual-Tone ()* · CHECK EMI.",
          "source": "www.marutisuzuki.com"
        },
        {
          "title": "Maruti Swift Price (2026) - Images, Colours, Mileage & ...",
          "url": "https://auto.hindustantimes.com/new-cars/marutisuzuki/swift",
          "snippet": "The price range for the Maruti Suzuki Swift is approximately ₹5.79 Lakh to ₹8.80 Lakh (ex-showroom). Engine Specifications and Class-Leading Mileage. The 2024 ...",
          "source": "auto.hindustantimes.com"
        },
        {
          "title": "Maruti Swift Price in Delhi",
          "url": "https://www.carwale.com/maruti-suzuki-cars/swift/price-in-delhi/",
          "snippet": "The on road price of the Swift in Delhi ranges from Rs. 6.47 Lakh to Rs. 10.00 Lakh. The ex-showroom price is between Rs. 5.79 Lakh and Rs. 8.80 Lakh.",
          "source": "www.carwale.com"
        },
        {
          "title": "Maruti Suzuki Swift On Road Price in Mumbai 2026",
          "url": "https://www.autox.com/new-cars/maruti-suzuki/swift/price-in-mumbai/",
          "snippet": "The latest Maruti Suzuki Swift on road price in Mumbai starts from ₹6.78 Lakh and goes up to ₹10.23 Lakh, depending upon the variant. The Swift base variant ...",
          "source": "www.autox.com"
        },
        {
          "title": "Maruti Suzuki Swift Price in India 2026",
          "url": "https://www.cars24.com/new-cars/maruti-suzuki/swift/",
          "snippet": "Base Variant. SwiftLxi. 1197cc. 24.8kmpl. ₹5.79 Lakh · SwiftVxi. 1197cc. 24.8kmpl. ₹6.59 Lakh. Price breakup · SwiftVxi (O). 1197cc. 24.8kmpl. ₹6.85 Lakh. Price ...",
          "source": "www.cars24.com"
        },
        {
          "title": "Maruti Suzuki Swift price in Delhi",
          "url": "https://www.autocarindia.com/cars/maruti-suzuki/swift/price-in-delhi",
          "snippet": "Maruti Suzuki Swift 1.2 Petrol LXI · ₹6.44 Lakh ; Maruti Suzuki Swift 1.2 Petrol VXI · ₹7.50 Lakh ; Maruti Suzuki Swift 1.2 Petrol VXI (O) · ₹7.79 Lakh ; Maruti ...",
          "source": "www.autocarindia.com"
        }
      ],
      "searchedAt": "2026-01-16T04:54:39.439Z"
    },
    "lifecycle": {
      "query": "Maruti Swift facelift launch date next generation update india",
      "results": [
        {
          "title": "Maruti New Gen Swift 2024 - Features, Specifications, ...",
          "url": "https://www.marutisuzuki.com/swift?srsltid=AfmBOoovNcG_nKFrXEHDwNhHghgXlRuocc2bQWj_isJikhEk8gMVTuez",
          "snippet": "Maruti New Gen Swift 2024 - Features, Specifications, Reviews, Colors & Interior.",
          "source": "www.marutisuzuki.com"
        },
        {
          "title": "New Maruti Swift Launch Date Confirmed",
          "url": "https://www.cardekho.com/india-car-news/new-maruti-swift-launch-date-confirmed-32432.htm",
          "snippet": "It's now confirmed! The fourth-generation Maruti Suzuki Swift will go on sale in India on May 9, 2024. The carmaker recently opened bookings ...",
          "source": "www.cardekho.com"
        },
        {
          "title": "New Maruti Swift India launch: Live Updates",
          "url": "https://www.carwale.com/news/live/new-maruti-suzuki-swift-india-launch-live-updates/",
          "snippet": "The all-new fourth-gen Maruti Suzuki Swift will be launched in India today. The bookings of the same were commenced on 1 May, 2024.",
          "source": "www.carwale.com"
        },
        {
          "title": "New Maruti Swift India launch in May 2024",
          "url": "https://www.autocarindia.com/car-news/new-maruti-swift-india-launch-on-may-9-2024-431252",
          "snippet": "New Maruti Swift India launch in May 2024 · New Maruti Swift: India-spec details · New Maruti Swift will debut new 1.2-litre Z Series engine.",
          "source": "www.autocarindia.com"
        },
        {
          "title": "Maruti Swift Price - Images, Colours & Reviews",
          "url": "https://www.carwale.com/maruti-suzuki-cars/swift/",
          "snippet": "Maruti Suzuki Swift Latest Updates. The Maruti Suzuki Swift retailed a total of 15,547 units in October 2025. 4:28 pm Nov 16. Maruti has achieved three crore ...",
          "source": "www.carwale.com"
        },
        {
          "title": "New Swift 2024 Revealed! Launch Date, Design, Features ...",
          "url": "https://www.youtube.com/watch?v=lMQU19Muotg",
          "snippet": "New Swift 2024 Revealed! Launch Date, Design, Features, Engine details Explained | CarWale · Comments.",
          "source": "www.youtube.com"
        },
        {
          "title": "New-Gen Suzuki Swift Sport to Launch in 2026",
          "url": "https://www.carlelo.com/news/new-gen-suzuki-swift-sport-to-launch-in-2026",
          "snippet": "Next-gen Suzuki Swift Sport set to launch in 2026 with updated design and mild-hybrid engine. Toyota GR Starlet may also join the hot hatch ...",
          "source": "www.carlelo.com"
        },
        {
          "title": "New Maruti Suzuki Swift 2024 Launched at Rs 6.49 lakh",
          "url": "https://www.spinny.com/blog/maruti-suzuki-swift-launch/",
          "snippet": "Maruti Suzuki has ended the anticipative buzz, launching the new generation of the iconic Maruti Swift at a starting price of Rs 6.49 lakh (ex-showroom).",
          "source": "www.spinny.com"
        },
        {
          "title": "2024 Maruti Swift Bookings Open | Everything Has Changed ...",
          "url": "https://www.youtube.com/watch?v=0ZuO0HnxHGk",
          "snippet": "Maruti Suzuki will launch the all-new 2024 Swift in India. The Swift facelift is expected to be launched on May 9 and here is everything ...",
          "source": "www.youtube.com"
        }
      ],
      "searchedAt": "2026-01-16T04:54:41.163Z"
    },
    "salesData": {
      "query": "Maruti Swift sales figures monthly india 2026 units sold",
      "results": [
        {
          "title": "Maruti Suzuki Swift Monthly Sales",
          "url": "https://www.v3cars.com/maruti-arena-cars/swift/monthly-sales",
          "snippet": "In December 2025, the total sales figure of Swift was 18,767 units, which is a 4.90 percent MoM decline. In December 2025, the total sales figure of Maruti ...",
          "source": "www.v3cars.com"
        },
        {
          "title": "Maruti Swift 2026 Sales Numbers & Trends In India",
          "url": "https://www.carbike360.com/cars/maruti/swift/monthly-sales",
          "snippet": "On month-on-month (MOM) basis, Maruti Swift witnessed a growth of -4.9%, with a sales of 18,767 units compared to 19,733 units in November 2025. Maruti Swift ...",
          "source": "www.carbike360.com"
        },
        {
          "title": "Maruti Suzuki sales in December 2025",
          "url": "https://www.marutisuzuki.com/corporate/media/press-releases/2026/january/maruti-suzuki-sales-in-december?srsltid=AfmBOopu1uF3vrAmwdmUDM17E4PupEec1LAzChvHxeCuwwFHwQYXG5YB",
          "snippet": "Domestic sales reached an all-time high of 182,165 units. The sales to other OEM were at 9,950 units and exports were at 25,739 units.",
          "source": "www.marutisuzuki.com"
        },
        {
          "title": "Best Selling Maruti Suzuki Cars in January 2026",
          "url": "https://www.spinny.com/blog/best-selling-maruti-cars/",
          "snippet": "Maruti Suzuki Swift​​ With sales of 19,733 units in November 2025, the Maruti Swift became the second-best-selling Maruti car and saw a 34 percent year-on-year ...",
          "source": "www.spinny.com"
        },
        {
          "title": "Top 10 Best-Selling Carmakers In November 2025: Maruti ...",
          "url": "https://www.cardekho.com/india-car-news/maruti-sold-more-cars-than-tata-mahindra-and-hyundai-combined-in-november-2025-35405.htm",
          "snippet": "Maruti Suzuki once again dominated the charts, selling roughly 1.71 lakh units in November 2025. While its month-on-month (MoM) numbers dipped ...",
          "source": "www.cardekho.com"
        },
        {
          "title": "Car Sales Figures",
          "url": "https://www.autopunditz.com/car-sales-figures",
          "snippet": "Around 3.53 Lakh passenger cars were sold in the Indian market in April 2025. Sales increased by 4.9% over April last year and dropped by...",
          "source": "www.autopunditz.com"
        },
        {
          "title": "Maruti Suzuki November 2025 Sales: Record-Breaking ...",
          "url": "https://blog.gaadikey.com/maruti-suzuki-november-2025-sales-record-breaking-2-29-lakh-units-sold/",
          "snippet": "Maruti Suzuki India Limited reports its highest-ever monthly sales of 229,021 units in November 2025. Exports hit an all-time high of 46,057 ...",
          "source": "blog.gaadikey.com"
        },
        {
          "title": "Maruti Suzuki Achieves Record-Breaking Monthly Sales ...",
          "url": "https://scanx.trade/stock-market-news/earnings/maruti-suzuki-achieves-record-breaking-monthly-sales-of-220-894-units-in-october-2025/23534423",
          "snippet": "Maruti Suzuki India Limited reported its highest-ever monthly sales of 220,894 units in October, including 180,675 domestic sales, 8,915 ...",
          "source": "scanx.trade"
        },
        {
          "title": "Maruti Suzuki reports highest-ever monthly sales and ...",
          "url": "https://www.indiatoday.in/auto/latest-auto-news/story/maruti-suzuki-reports-highest-ever-monthly-sales-and-record-exports-in-november-2025-2828851-2025-12-01",
          "snippet": "Cumulatively, Maruti Suzuki has sold 15,28,650 units between April and November 2025–26, ahead of the 14,51,383 units achieved in the ...",
          "source": "www.indiatoday.in"
        },
        {
          "title": "Maruti Suzuki: monthly car sales India by model 2025",
          "url": "https://www.statista.com/statistics/1091649/india-maruti-suzuki-car-sales-by-model/?srsltid=AfmBOor-4lFOP1mpc3j6zUmA2uKg_grOiF0_Oc3uxY5PtNOoeyBjoNja",
          "snippet": "Sales volume of Maruti Suzuki passenger cars across India in April 2025, by model ; Swift, 14,592 ; Fronx, 14,345 ; Wagon R · 13,413 ; Baleno, 13,180.",
          "source": "www.statista.com"
        }
      ],
      "searchedAt": "2026-01-16T04:54:40.979Z"
    }
  },
  "metadata": {
    "vehicle": "Maruti Swift",
    "scrapedAt": "2026-01-16T04:56:47.731Z",
    "totalPosts": 12,
    "totalComments": 29,
    "sourcesUsed": [
      "YouTube",
      "WebSearch"
    ]
  }
}